SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
/* MIT License

Copyright (c) 2025 Thomas Boje <info@andocs.biz>

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
*/

#ifndef CH32FUN_CH32H41XHW_H
#define CH32FUN_CH32H41XHW_H

#include "ch32fun.h"

#ifndef __ASSEMBLER__  // Things before this can be used in assembly.

#ifdef __cplusplus
extern "C" {
#endif

/* Interrupt Number Definition, according to the selected device */
typedef enum IRQn
{
	/******  RISC-V Processor Exceptions Numbers *******************************************************/
	NonMaskableInt_IRQn = 2, /* 2 Non Maskable Interrupt                             */
	EXC_IRQn = 3,            /* 3 Exception Interrupt                                */
	Ecall_M_Mode_IRQn = 5,   /* 5 Ecall M Mode Interrupt                             */
	Ecall_U_Mode_IRQn = 8,   /* 8 Ecall U Mode Interrupt                             */
	Break_Point_IRQn = 9,    /* 9 Break Point Interrupt                              */
	SysTick0_IRQn = 12,      /* 12 System timer Interrupt                            */
	SysTick1_IRQn = 13,      /* 13 System timer Interrupt                            */
	Software_IRQn = 14,      /* 14 software Interrupt                                */
	IPC_CH0_IRQn  = 16,      /* 16 IPC CH0 Interrupt                                 */
	IPC_CH1_IRQn  = 17,      /* 17 IPC CH1 Interrupt                                 */
	IPC_CH2_IRQn  = 18,      /* 18 IPC CH2 Interrupt                                 */
	IPC_CH3_IRQn  = 19,      /* 19 IPC CH3 Interrupt                                 */
	HSEM_IRQn     = 28,      /* 28 HSEM Interrupt                                    */

	/******  RISC-V specific Interrupt Numbers *********************************************************/
	WWDG_IRQn                   = 32,      /* Window WatchDog Interrupt                            */
	EXTI15_8_IRQn               = 33,      /* External Line[15:8] Interrupts                       */
	FLASH_IRQn                  = 34,      /* FLASH global Interrupt                               */
	RCC_IRQn                    = 35,      /* RCC global Interrupt                                 */
	EXTI7_0_IRQn                = 36,      /* External Line[7:0] Interrupts                        */
	SPI1_IRQn                   = 37,      /* SPI1 global Interrupt                                */
	DMA1_Channel2_IRQn          = 38,      /* DMA1 Channel 2 global Interrupt                      */
	DMA1_Channel3_IRQn          = 39,      /* DMA1 Channel 3 global Interrupt                      */
	DMA1_Channel4_IRQn          = 40,      /* DMA1 Channel 4 global Interrupt                      */
	DMA1_Channel5_IRQn          = 41,      /* DMA1 Channel 5 global Interrupt                      */
	DMA1_Channel6_IRQn          = 42,      /* DMA1 Channel 6 global Interrupt                      */
	DMA1_Channel7_IRQn          = 43,      /* DMA1 Channel 7 global Interrupt                      */
	DMA1_Channel8_IRQn          = 44,      /* DMA1 Channel 8 global Interrupt                      */
	USART2_IRQn                 = 45,      /* USART2 global Interrupt                              */
	I2C1_EV_IRQn                = 46,      /* I2C1 Event Interrupt                                 */
	I2C1_ER_IRQn                = 47,      /* I2C1 Error Interrupt                                 */
	USART1_IRQn                 = 48,      /* USART1 global Interrupt                              */
	SPI2_IRQn                   = 49,      /* SPI2 global Interrupt                                */
	SPI3_IRQn                   = 50,      /* SPI3 global Interrupt                                */
	SPI4_IRQn                   = 51,      /* SPI4 global Interrupt                                */
	I2C2_EV_IRQn                = 52,      /* I2C2 Event Interrupt                                 */
	I2C2_ER_IRQn                = 53,      /* I2C2 Error Interrupt                                 */
	USBPD_IRQn                  = 54,      /* USBPD Interrupt                                      */
	USBPDWakeUp_IRQn            = 55,      /* USBPD WakeUp Interrupt                               */
	USBHS_IRQn                  = 56,      /* USBHS global Interrupt                               */
	DMA1_Channel1_IRQn          = 57,      /* DMA1 Channel 1 global Interrupt                      */
	CAN1_SCE_IRQn               = 58,      /* CAN1 SCE Interrupt                                   */
	CAN1_TX_IRQn                = 59,      /* CAN1 TX Interrupts                                   */
	CAN1_RX0_IRQn               = 60,      /* CAN1 RX0 Interrupts                                  */
	CAN1_RX1_IRQn               = 61,      /* CAN1 RX1 Interrupts                                  */
	USBSS_IRQn                  = 62,      /* USBSS Interrupt                                      */
	USBSS_LINK_IRQn             = 63,      /* USBSS LINK Interrupt                                 */
	USBHSWakeup_IRQn            = 64,      /* USBHS WakeUp Interrupt                               */
	USBSSWakeup_IRQn            = 65,      /* USBSS WakeUp Interrupt                               */
	RTCAlarm_IRQn               = 66,      /* RTC Alarm through EXTI Line Interrupt                */
	USBFS_IRQn                  = 67,      /* USBFS global Interrupt                               */
	USBFSWakeUp_IRQn            = 68,      /* USBFS WakeUp Interrupt                               */
	ADC1_2_IRQn                 = 69,      /* ADC1 and ADC2 global Interrupt                       */
	TIM1_BRK_IRQn               = 70,      /* TIM1 Break Interrupt                                 */
	TIM1_UP_IRQn                = 71,      /* TIM1 Update Interrupt                                */
	TIM1_TRG_COM_IRQn           = 72,      /* TIM1 Trigger and Commutation Interrupt               */
	TIM1_CC_IRQn                = 73,      /* TIM1 Capture Compare Interrupt                       */
	TIM2_IRQn                   = 74,      /* TIM2 global Interrupt                                */
	TIM3_IRQn                   = 75,      /* TIM3 global Interrupt                                */
	TIM4_IRQn                   = 76,      /* TIM4 global Interrupt                                */
	TIM5_IRQn                   = 77,      /* TIM5 global Interrupt                                */
	I2C3_EV_IRQn                = 78,      /* I2C3 Event Interrupt                                 */
	I2C3_ER_IRQn                = 79,      /* I2C3 Error Interrupt                                 */
	I2C4_EV_IRQn                = 80,      /* I2C4 Event Interrupt                                 */
	I2C4_ER_IRQn                = 81,      /* I2C4 Error Interrupt                                 */
	QSPI1_IRQn                  = 82,      /* QSPI1 Interrupt                                      */
	SERDES_IRQn                 = 83,      /* SERDES Interrupt                                     */
	USART3_IRQn                 = 84,      /* USART3 global Interrupt                              */
	USART4_IRQn                 = 85,      /* USART4 global Interrupt                              */
	TIM8_BRK_IRQn               = 86,      /* TIM8 Break Interrupt                                 */
	TIM8_UP_IRQn                = 87,      /* TIM8 Update Interrupt                                */
	TIM8_TRG_COM_IRQn           = 88,      /* TIM8 Trigger and Commutation Interrupt               */
	TIM8_CC_IRQn                = 89,      /* TIM8 Capture Compare Interrupt                       */
	TIM9_IRQn                   = 90,      /* TIM9 global Interrupt                                */
	TIM10_IRQn                  = 91,      /* TIM10 global Interrupt                               */
	TIM11_IRQn                  = 92,      /* TIM11 global Interrupt                               */
	TIM12_IRQn                  = 93,      /* TIM12 global Interrupt                               */
	FMC_IRQn                    = 94,      /* FMC global Interrupt                                 */
	SDMMC_IRQn                  = 95,      /* SDMMC global Interrupt                               */
	LPTIM1_IRQn                 = 96,      /* LPTIM1 global Interrupt                              */
	LPTIM2_IRQn                 = 97,      /* LPTIM2 global Interrupt                              */
	USART5_IRQn                 = 98,      /* USART5 global Interrupt                              */
	USART6_IRQn                 = 99,      /* USART6 global Interrupt                              */
	TIM6_IRQn                   = 100,     /* TIM6 global Interrupt                                */
	TIM7_IRQn                   = 101,     /* TIM7 global Interrupt                                */
	DMA2_Channel1_IRQn          = 102,     /* DMA2 Channel 1 global Interrupt                      */
	DMA2_Channel2_IRQn          = 103,     /* DMA2 Channel 2 global Interrupt                      */
	DMA2_Channel3_IRQn          = 104,     /* DMA2 Channel 3 global Interrupt                      */
	DMA2_Channel4_IRQn          = 105,     /* DMA2 Channel 4 global Interrupt                      */
	DMA2_Channel5_IRQn          = 106,     /* DMA2 Channel 5 global Interrupt                      */
	DMA2_Channel6_IRQn          = 107,     /* DMA2 Channel 6 global Interrupt                      */
	DMA2_Channel7_IRQn          = 108,     /* DMA2 Channel 7 global Interrupt                      */
	DMA2_Channel8_IRQn          = 109,     /* DMA2 Channel 8 global Interrupt                      */
	ETH_IRQn                    = 110,     /* ETH global Interrupt                                 */
	ETH_WKUP_IRQn               = 111,     /* ETH WakeUp Interrupt                                 */
	CAN2_SCE_IRQn               = 112,     /* CAN2 SCE Interrupt                                   */
	CAN2_TX_IRQn                = 113,     /* CAN2 TX Interrupts                                   */
	CAN2_RX0_IRQn               = 114,     /* CAN2 RX0 Interrupts                                  */
	CAN2_RX1_IRQn               = 115,     /* CAN2 RX1 Interrupts                                  */
	USART7_IRQn                 = 116,     /* USART7 global Interrupt                              */
	USART8_IRQn                 = 117,     /* USART8 global Interrupt                              */
	I3C_EV_IRQn                 = 118,     /* I3C Event Interrupt                                  */
	I3C_ER_IRQn                 = 119,     /* I3C Error Interrupt                                  */
	DVP_IRQn                    = 120,     /* DVP global Interrupt                                 */
	ECDC_IRQn                   = 121,     /* ECDC global Interrupt                                */
	PIOC_IRQn                   = 122,     /* PIOC global Interrupt                                */
	SAI_IRQn                    = 123,     /* SAI global Interrupt                                 */
	LTDC_IRQn                   = 124,     /* LTDC global Interrupt                                */
	GPHA_IRQn                   = 125,     /* GPHA global Interrupt                                */
	DFSDM0_IRQn                 = 127,     /* DFSDM0 global Interrupt                              */
	DFSDM1_IRQn                 = 128,     /* DFSDM1 global Interrupt                              */
	SWPMI_IRQn                  = 131,     /* SWPMI global Interrupt                               */
	QSPI2_IRQn                  = 134,     /* QSPI2 Interrupt                                      */
	SWPMI_WKUP_IRQn             = 135,     /* SWPMI WakeUp Interrupt                               */
	CAN3_SCE_IRQn               = 136,     /* CAN3 SCE Interrupt                                   */
	CAN3_TX_IRQn                = 137,     /* CAN3 TX Interrupts                                   */
	CAN3_RX0_IRQn               = 138,     /* CAN3 RX0 Interrupts                                  */
	CAN3_RX1_IRQn               = 139,     /* CAN3 RX1 Interrupts                                  */
	LPTIM2_WKUP_IRQn            = 140,     /* LPTIM2 WakeUp Interrupt                              */
	LPTIM1_WKUP_IRQn            = 141,     /* LPTIM1 WakeUp Interrupt                              */
	I3C_WKUP_IRQn               = 142,     /* I3C WakeUp Interrupt                                 */
	RTC_IRQn                    = 143,     /* RTC global Interrupt                                 */
	HSADC_IRQn                  = 144,     /* HSADC global Interrupt                               */
	UHSIF_IRQn                  = 145,     /* UHSIF global Interrupt                               */
	RNG_IRQn                    = 146,     /* RNG global Interrupt                                 */
	SDIO_IRQn                   = 147,     /* SDIO global Interrupt                                */
	USART_WKUP_IRQn             = 148,     /* USART wakeup Interrupt                               */
} IRQn_Type;

#define BASE_VECTOR "\n\
	.balign  2\n\
	.option   push;\n\
	.option   norvc;\n\
	j handle_reset\n\
	.word   0 \n\
	.word   NMI_Handler                /* NMI */ \n\
	.word   HardFault_Handler          /* Hard Fault */ \n\
	.word   0 \n\
	.word   Ecall_M_Mode_Handler       /* Ecall M Mode */ \n\
	.word   0 \n\
	.word   0 \n\
	.word   Ecall_U_Mode_Handler       /* Ecall U Mode */ \n\
	.word   Break_Point_Handler        /* Break Point */ \n\
	.word   0 \n\
	.word   0 \n\
	.word   SysTick_Handler            /* SysTick */ \n \
	.word   SysTick_Handler            /* SysTick */ \n \
	.word   SW_Handler                 /* SW */ \n \
	.word   0 \n \
	.word   IPC_CH0_Handler \n \
	.word   IPC_CH1_Handler \n \
	.word   IPC_CH2_Handler \n \
	.word   IPC_CH3_Handler \n \
	.word   0 \n \
	.word   0 \n \
	.word   0 \n \
	.word   0 \n \
	.word   0 \n \
	.word   0 \n \
	.word   0 \n \
	.word   0 \n \
	.word   HSEM_Handler \n \
	.word   0 \n \
	.word   0 \n \
	.word   0 \n \
	/* External Interrupts */ \n \
	.word   WWDG_IRQHandler            /* Window Watchdog */ \n \
	.word   EXTI15_8_IRQHandler \n \
	.word   FLASH_IRQHandler           /* Flash */ \n \
	.word   RCC_IRQHandler             /* RCC */ \n \
	.word   EXTI7_0_IRQHandler \n \
	.word   SPI1_IRQHandler            /* SPI1 */ \n \
	.word   DMA1_Channel2_IRQHandler   /* DMA1 Channel 2 */ \n \
	.word   DMA1_Channel3_IRQHandler   /* DMA1 Channel 3 */ \n \
	.word   DMA1_Channel4_IRQHandler   /* DMA1 Channel 4 */ \n \
	.word   DMA1_Channel5_IRQHandler   /* DMA1 Channel 5 */ \n \
	.word   DMA1_Channel6_IRQHandler   /* DMA1 Channel 6 */ \n \
	.word   DMA1_Channel7_IRQHandler   /* DMA1 Channel 7 */ \n \
	.word   DMA1_Channel8_IRQHandler   /* DMA1 Channel 8 */ \n \
	.word   USART2_IRQHandler          /* USART2 */ \n \
	.word   I2C1_EV_IRQHandler         /* I2C1 Event */ \n \
	.word   I2C1_ER_IRQHandler         /* I2C1 Error */ \n \
	.word   USART1_IRQHandler          /* USART1 */ \n \
	.word   SPI2_IRQHandler            /* SPI2 */ \n \
	.word   SPI3_IRQHandler            /* SPI3 */ \n \
	.word   SPI4_IRQHandler            /* SPI4 */ \n \
	.word   I2C2_EV_IRQHandler         /* I2C2 Event */ \n \
	.word   I2C2_ER_IRQHandler         /* I2C2 Error */ \n \
	.word   USBPD_IRQHandler \n \
	.word   USBPDWakeUp_IRQHandler \n \
	.word   USBHS_IRQHandler           /* USBHS */ \n \
	.word   DMA1_Channel1_IRQHandler   /* DMA1 Channel 1 */ \n \
	.word   CAN1_SCE_IRQHandler        /* CAN1 SCE */ \n \
	.word   CAN1_TX_IRQHandler         /* CAN1 TX */ \n \
	.word   CAN1_RX0_IRQHandler        /* CAN1 RX1 */ \n \
	.word   CAN1_RX1_IRQHandler        /* CAN1 RX1 */ \n \
	.word   USBSS_IRQHandler \n \
	.word   USBSS_LINK_IRQHandler \n \
	.word   USBHSWakeup_IRQHandler \n \
	.word   USBSSWakeup_IRQHandler \n \
	.word   RTCAlarm_IRQHandler        /* RTC Alarm through EXTI Line */ \n \
	.word   USBFS_IRQHandler           /* USBFS */ \n \
	.word   USBFSWakeUp_IRQHandler     /* USBFS Wakeup */ \n \
	.word   ADC1_2_IRQHandler          /* ADC1_2 */ \n \
	.word   TIM1_BRK_IRQHandler        /* TIM1 Break */ \n \
	.word   TIM1_UP_IRQHandler         /* TIM1 Update */ \n \
	.word   TIM1_TRG_COM_IRQHandler    /* TIM1 Trigger and Commutation */ \n \
	.word   TIM1_CC_IRQHandler         /* TIM1 Capture Compare */ \n \
	.word   TIM2_IRQHandler            /* TIM2 */ \n \
	.word   TIM3_IRQHandler            /* TIM3 */ \n \
	.word   TIM4_IRQHandler            /* TIM4 */ \n \
	.word   TIM5_IRQHandler            /* TIM5 */ \n \
	.word   I2C3_EV_IRQHandler         /* I2C3 Event */ \n \
	.word   I2C3_ER_IRQHandler         /* I2C3 Error */ \n \
	.word   I2C4_EV_IRQHandler         /* I2C4 Event */ \n \
	.word   I2C4_ER_IRQHandler         /* I2C4 Error */ \n \
	.word   QSPI1_IRQHandler \n \
	.word   SERDES_IRQHandler \n \
	.word   USART3_IRQHandler          /* USART3 */ \n \
	.word   USART4_IRQHandler          /* USART4 */ \n \
	.word   TIM8_BRK_IRQHandler        /* TIM8 Break */ \n \
	.word   TIM8_UP_IRQHandler         /* TIM8 Update */ \n \
	.word   TIM8_TRG_COM_IRQHandler    /* TIM8 Trigger and Commutation */ \n \
	.word   TIM8_CC_IRQHandler         /* TIM8 Capture Compare */ \n \
	.word   TIM9_IRQHandler            /* TIM9 */ \n \
	.word   TIM10_IRQHandler           /* TIM10 */ \n \
	.word   TIM11_IRQHandler           /* TIM11 */ \n \
	.word   TIM12_IRQHandler           /* TIM12 */ \n \
	.word   FMC_IRQHandler \n \
	.word   SDMMC_IRQHandler \n \
	.word   LPTIM1_IRQHandler \n \
	.word   LPTIM2_IRQHandler \n \
	.word   USART5_IRQHandler          /* USART5 */ \n \
	.word   USART6_IRQHandler          /* USART6 */ \n \
	.word   TIM6_IRQHandler            /* TIM6 */ \n \
	.word   TIM7_IRQHandler            /* TIM7 */ \n \
	.word   DMA2_Channel1_IRQHandler   /* DMA2 Channel 1 */ \n \
	.word   DMA2_Channel2_IRQHandler   /* DMA2 Channel 2 */ \n \
	.word   DMA2_Channel3_IRQHandler   /* DMA2 Channel 3 */ \n \
	.word   DMA2_Channel4_IRQHandler   /* DMA2 Channel 4 */ \n \
	.word   DMA2_Channel5_IRQHandler   /* DMA2 Channel 5 */ \n \
	.word   DMA2_Channel6_IRQHandler   /* DMA2 Channel 6 */ \n \
	.word   DMA2_Channel7_IRQHandler   /* DMA2 Channel 7 */ \n \
	.word   DMA2_Channel8_IRQHandler   /* DMA2 Channel 8 */ \n \
	.word   ETH_IRQHandler             /* ETH */ \n \
	.word   ETHWakeUp_IRQHandler       /* ETH WakeUp */ \n \
	.word   CAN2_SCE_IRQHandler        /* CAN2 SCE */ \n \
	.word   CAN2_TX_IRQHandler         /* CAN2 TX */ \n \
	.word   CAN2_RX0_IRQHandler        /* CAN2 RX0 */ \n \
	.word   CAN2_RX1_IRQHandler        /* CAN2 RX1 */ \n \
	.word   USART7_IRQHandler          /* USART7 */ \n \
	.word   USART8_IRQHandler          /* USART8 */ \n \
	.word   I3C_EV_IRQHandler          /* I3C Event */ \n \
	.word   I3C_ER_IRQHandler          /* I3C Error */ \n \
	.word   DVP_IRQHandler             /* DVP */ \n \
	.word   ECDC_IRQHandler \n \
	.word   PIOC_IRQHandler \n \
	.word   SAI_IRQHandler \n \
	.word   LTDC_IRQHandler \n \
	.word   GPHA_IRQHandler \n \
	.word   0 \n \
	.word   DFSDM0_IRQHandler \n \
	.word   DFSDM1_IRQHandler \n \
	.word   0 \n \
	.word   0 \n \
	.word   SWPMI_IRQHandler \n \
	.word   0 \n \
	.word   0 \n \
	.word   QSPI2_IRQHandler \n \
	.word   SWPMI_WKUP_IRQHandler \n \
	.word   CAN3_SCE_IRQHandler        /* CAN3 SCE */ \n \
	.word   CAN3_TX_IRQHandler         /* CAN3 TX */ \n \
	.word   CAN3_RX0_IRQHandler        /* CAN3 RX0 */ \n \
	.word   CAN3_RX1_IRQHandler        /* CAN3 RX1 */ \n \
	.word   LPTIM2_WKUP_IRQHandler \n \
	.word   LPTIM1_WKUP_IRQHandler \n \
	.word   I3C_WKUP_IRQHandler \n \
	.word   RTC_IRQHandler             /* RTC */ \n \
	.word   HSADC_IRQHandler \n \
	.word   UHSIF_IRQHandler \n \
	.word   RNG_IRQHandler             /* RNG */ \n \
	.word   SDIO_IRQHandler            /* SDIO */ \n \
	.word   USART_WKUP_IRQHandler \n "

#define DEFAULT_INTERRUPT_VECTOR_CONTENTS BASE_VECTOR "\n.option pop;\n"

/* memory mapped structure for SysTick */
typedef struct
{
	__IO uint32_t CTLR;
	__IO uint32_t SR;
	union
	{
		struct
		{
			__IO uint32_t CNTL;
			__IO uint32_t CNTH;
			__IO uint32_t CMPL;
			__IO uint32_t CMPH;
		};
		struct
		{
			__IO uint64_t CNT;
			__IO uint64_t CMP;
		};
	};
} SysTick_Type;

#define funSysTick32() (SysTick->CNTL)
#define funSysTickHigh() (SysTick->CNTH)


#endif /* __ASSEMBLER__*/

#define HardFault_IRQn    EXC_IRQn

	#define ADC1_2_IRQn       ADC_IRQn

/* Standard Peripheral Library old definitions (maintained for legacy purpose) */
#define HSI_Value             HSI_VALUE
#define HSE_Value             HSE_VALUE
#define HSEStartUp_TimeOut    HSE_STARTUP_TIMEOUT

