SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
#ifndef __ASSEMBLER__
/* Analog to Digital Converter */
typedef struct
{
		__IO uint32_t STATR;
		__IO uint32_t CTLR1;
		__IO uint32_t CTLR2;
		__IO uint32_t SAMPTR1;
		__IO uint32_t SAMPTR2;
		__IO uint32_t IOFR1;
		__IO uint32_t IOFR2;
		__IO uint32_t IOFR3;
		__IO uint32_t IOFR4;
		__IO uint32_t WDHTR;
		__IO uint32_t WDLTR;
		__IO uint32_t RSQR1;
		__IO uint32_t RSQR2;
		__IO uint32_t RSQR3;
		__IO uint32_t ISQR;
		__IO uint32_t IDATAR1;
		__IO uint32_t IDATAR2;
		__IO uint32_t IDATAR3;
		__IO uint32_t IDATAR4;
		__IO uint32_t RDATAR;
		uint32_t  RESERVED0;
		__IO uint32_t AUX;
		__IO uint32_t DRV;
} ADC_TypeDef;

/* Controller Area Network TxMailBox */
typedef struct
{
	__IO uint32_t TXMIR;
	__IO uint32_t TXMDTR;
	__IO uint32_t TXMDLR;
	__IO uint32_t TXMDHR;
} CAN_TxMailBox_TypeDef;

/* Controller Area Network FIFOMailBox */
typedef struct
{
	__IO uint32_t RXMIR;
	__IO uint32_t RXMDTR;
	__IO uint32_t RXMDLR;
	__IO uint32_t RXMDHR;
} CAN_FIFOMailBox_TypeDef;

/* Controller Area Network FilterRegister */
typedef struct
{
	__IO uint32_t FR1;
	__IO uint32_t FR2;
} CAN_FilterRegister_TypeDef;

/* Controller Area Network */
typedef struct
{
	__IO uint32_t CTLR;
	__IO uint32_t STATR;
	__IO uint32_t TSTATR;
	__IO uint32_t RFIFO0;
	__IO uint32_t RFIFO1;
	__IO uint32_t INTENR;
	__IO uint32_t ERRSR;
	__IO uint32_t BTIMR;
	__IO uint32_t TTCTLR;
	__IO uint32_t TTCNT;
	__IO uint32_t TERR_CNT;
	uint32_t  RESERVED0[85];
	CAN_TxMailBox_TypeDef sTxMailBox[3];
	CAN_FIFOMailBox_TypeDef sFIFOMailBox[2];
	uint32_t  RESERVED1[12];
	__IO uint32_t FCTLR;
	__IO uint32_t FMCFGR;
	__IO uint32_t FMCFGR_CAN3;
	__IO uint32_t FSCFGR;
	__IO uint32_t FSCFGR_CAN3;
	__IO uint32_t FAFIFOR;
	__IO uint32_t FAFIFOR_CAN3;
	__IO uint32_t FWR;
	__IO uint32_t FWR_CAN3;
	uint32_t  RESERVED2[7];
	CAN_FilterRegister_TypeDef sFilterRegister[42];
} CAN_TypeDef;

/* CRC Calculation Unit */
typedef struct
{
	__IO uint32_t DATAR;
	__IO uint8_t  IDATAR;
	uint8_t       RESERVED0;
	uint16_t      RESERVED1;
	__IO uint32_t CTLR;
} CRC_TypeDef;

/* Digital to Analog Converter */
typedef struct
{
	__IO uint32_t CTLR;
	__IO uint32_t SWTR;
	__IO uint32_t R12BDHR1;
	__IO uint32_t L12BDHR1;
	__IO uint32_t R8BDHR1;
	__IO uint32_t R12BDHR2;
	__IO uint32_t L12BDHR2;
	__IO uint32_t R8BDHR2;
	__IO uint32_t RD12BDHR;
	__IO uint32_t LD12BDHR;
	__IO uint32_t RD8BDHR;
	__IO uint32_t DOR1;
	__IO uint32_t DOR2;
} DAC_TypeDef;

/* DMA Controller */
typedef struct
{
	__IO uint32_t CFGR;
	__IO uint32_t CNTR;
	__IO uint32_t PADDR;
	__IO uint32_t MADDR;
	__IO uint32_t M1ADDR;
} DMA_Channel_TypeDef;

typedef struct
{
	__IO uint32_t INTFR;
	__IO uint32_t INTFCR;
} DMA_TypeDef;

/* DMA MUX Controller */
typedef struct
{
	__IO uint32_t CFGR0_3;
	__IO uint32_t CFGR4_7;
	__IO uint32_t CFGR8_11;
	__IO uint32_t CFGR12_15;
} DMAMUX_TypeDef;

/* External Interrupt/Event Controller */
typedef struct
{
	__IO uint32_t INTENR;
	__IO uint32_t EVENR;
	__IO uint32_t RTENR;
	__IO uint32_t FTENR;
	__IO uint32_t SWIEVR;
	__IO uint32_t INTFR;
} EXTI_TypeDef;

/* FLASH Registers */
typedef struct
{
	__IO uint32_t ACTLR;
	__IO uint32_t KEYR;
	__IO uint32_t OBKEYR;
	__IO uint32_t STATR;
	__IO uint32_t CTLR;
	__IO uint32_t ADDR;
	__IO uint32_t RESERVED;
	__IO uint32_t OBR;
	__IO uint32_t WPR;
	__IO uint32_t MODEKEYR;
	__IO uint32_t BOOT_MODEKEYR;
} FLASH_TypeDef;

/* Option Bytes Registers */
typedef struct
{
	__IO uint16_t RDPR;
	__IO uint16_t USER;
	__IO uint16_t Data0;
	__IO uint16_t Data1;
	__IO uint16_t WRPR0;
	__IO uint16_t WRPR1;
	__IO uint16_t WRPR2;
	__IO uint16_t WRPR3;
} OB_TypeDef;

/* FMC Bank1 Registers */
typedef struct
{
  __IO uint32_t BTCR[8];
} FMC_Bank1_TypeDef;

/* FMC Bank1E Registers */
typedef struct
{
  __IO uint32_t BWTR[7];
} FMC_Bank1E_TypeDef;

/* FMC Bank3 Registers */
typedef struct
{
	__IO uint32_t PCR;
	__IO uint32_t SR;
	__IO uint32_t PMEM;
	__IO uint32_t PATT;
	uint32_t RESERVED0;
	__IO uint32_t ECCR;
} FMC_Bank3_TypeDef;

/* FMC Bank5_6 Registers */
typedef struct
{
	__IO uint32_t SDCR[2];
	__IO uint32_t SDTR[2];
	__IO uint32_t SDCMR;
	__IO uint32_t SDRTR;
	__IO uint32_t SDSR;
	uint32_t RESERVED0[9];
	__IO uint32_t MISC;
} FMC_Bank5_6_TypeDef;

/* General Purpose I/O */
typedef enum
{
	GPIO_CFGLR_IN_ANALOG = 0,
	GPIO_CFGLR_IN_FLOAT = 4,
	GPIO_CFGLR_IN_PUPD = 8,
	GPIO_CFGLR_OUT_PP = 1,
	GPIO_CFGLR_OUT_OD = 5,
	GPIO_CFGLR_OUT_AF_PP = 9,
	GPIO_CFGLR_OUT_AF_OD = 13,
} GPIO_CFGLR_PIN_MODE_Typedef;

typedef union {
	uint32_t __FULL;
	struct {
		GPIO_CFGLR_PIN_MODE_Typedef PIN0 :4;
		GPIO_CFGLR_PIN_MODE_Typedef PIN1 :4;
		GPIO_CFGLR_PIN_MODE_Typedef PIN2 :4;
		GPIO_CFGLR_PIN_MODE_Typedef PIN3 :4;
		GPIO_CFGLR_PIN_MODE_Typedef PIN4 :4;
		GPIO_CFGLR_PIN_MODE_Typedef PIN5 :4;
		GPIO_CFGLR_PIN_MODE_Typedef PIN6 :4;
		GPIO_CFGLR_PIN_MODE_Typedef PIN7 :4;
	};
} GPIO_CFGLR_t;
typedef union {
	uint32_t __FULL;
	const struct {
		uint32_t IDR0 :1;
		uint32_t IDR1 :1;
		uint32_t IDR2 :1;
		uint32_t IDR3 :1;
		uint32_t IDR4 :1;
		uint32_t IDR5 :1;
		uint32_t IDR6 :1;
		uint32_t IDR7 :1;
		uint32_t IDR8 :1;
		uint32_t IDR9 :1;
		uint32_t IDR10 :1;
		uint32_t IDR11:1;
		uint32_t IDR12 :1;
		uint32_t IDR13 :1;
		uint32_t IDR14 :1;
		uint32_t IDR15 :1;
		uint32_t :16;
	};
} GPIO_INDR_t;
typedef union {
	uint32_t __FULL;
	struct {
		uint32_t ODR0 :1;
		uint32_t ODR1 :1;
		uint32_t ODR2 :1;
		uint32_t ODR3 :1;
		uint32_t ODR4 :1;
		uint32_t ODR5 :1;
		uint32_t ODR6 :1;
		uint32_t ODR7 :1;
		uint32_t ODR8 :1;
		uint32_t ODR9 :1;
		uint32_t ODR10 :1;
		uint32_t ODR11 :1;
		uint32_t ODR12 :1;
		uint32_t ODR13 :1;
		uint32_t ODR14 :1;
		uint32_t ODR15 :1;
		uint32_t :16;
	};
} GPIO_OUTDR_t;
typedef union {
	uint32_t __FULL;
	struct {
		uint32_t BS0 :1;
		uint32_t BS1 :1;
		uint32_t BS2 :1;
		uint32_t BS3 :1;
		uint32_t BS4 :1;
		uint32_t BS5 :1;
		uint32_t BS6 :1;
		uint32_t BS7 :1;
		uint32_t BS8 :1;
		uint32_t BS9 :1;
		uint32_t BS10 :1;
		uint32_t BS11 :1;
		uint32_t BS12 :1;
		uint32_t BS13 :1;
		uint32_t BS14 :1;
		uint32_t BS15 :1;
		uint32_t BR0 :1;
		uint32_t BR1 :1;
		uint32_t BR2 :1;
		uint32_t BR3 :1;
		uint32_t BR4 :1;
		uint32_t BR5 :1;
		uint32_t BR6 :1;
		uint32_t BR7 :1;
		uint32_t BR8 :1;
		uint32_t BR9 :1;
		uint32_t BR10 :1;
		uint32_t BR11 :1;
		uint32_t BR12 :1;
		uint32_t BR13 :1;
		uint32_t BR14 :1;
		uint32_t BR15 :1;
	};
} GPIO_BSHR_t;
