SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
/* QSPI Registers */
typedef struct
{
	__IO uint32_t CR;
	__IO uint32_t DCR;
	__IO uint32_t SR;
	__IO uint32_t FCR;
	__IO uint32_t DLR;
	__IO uint32_t CCR;
	__IO uint32_t AR;
	__IO uint32_t ABR;
	__IO uint32_t DR;
	__IO uint32_t PSMKR;
	__IO uint32_t PSMAR;
	__IO uint32_t PIR;
	__IO uint32_t LPTR;
} QSPI_TypeDef;

/* SWPMI Registers */
typedef struct
{
	__IO uint32_t CR;
	__IO uint32_t BRR;
	uint32_t RESERVED0;
	__IO uint32_t ISR;
	__IO uint32_t ICR;
	__IO uint32_t IER;
	__IO uint32_t RFL;
	__IO uint32_t TDR;
	__IO uint32_t RDR;
	__IO uint32_t OR;
} SWPMI_TypeDef;

/* ECDC Registers */
typedef struct
{
	__IO uint32_t CTRL;
	__IO uint32_t INT_FG;
	__IO uint32_t KEY_255T224;
	__IO uint32_t KEY_223T192;
	__IO uint32_t KEY_191T160;
	__IO uint32_t KEY_159T128;
	__IO uint32_t KEY_127T96;
	__IO uint32_t KEY_95T64;
	__IO uint32_t KEY_63T32;
	__IO uint32_t KEY_31T0;
	__IO uint32_t IV_127T96;
	__IO uint32_t IV_95T64;
	__IO uint32_t IV_63T32;
	__IO uint32_t IV_31T0;
	uint32_t RESERVED3[2];
	__IO uint32_t SGSD_127T96;
	__IO uint32_t SGSD_95T64;
	__IO uint32_t SGSD_63T32;
	__IO uint32_t SGSD_31T0;
	__IO uint32_t SGRT_127T96;
	__IO uint32_t SGRT_95T64;
	__IO uint32_t SGRT_63T32;
	__IO uint32_t SGRT_31T0;
	__IO uint32_t SRC_ADDR;
	__IO uint32_t DST_ADDR;
	__IO uint32_t SRAM_LEN;
} ECDC_TypeDef;

/* DFSDM filter Registers */
typedef struct
{
	__IO uint32_t CR1;
	uint32_t RESERVED0;
	__IO uint32_t CR2;
	uint32_t RESERVED1;
	__IO uint32_t ISR;
	uint32_t RESERVED2;
	__IO uint32_t ICR;
	uint32_t RESERVED3;
	__IO uint32_t JCHGR;
	uint32_t RESERVED4;
	__IO uint32_t FCR3;
	uint32_t RESERVED5;
	__IO uint32_t JDATAR;
	uint32_t RESERVED6;
	__IO uint32_t RDATAR;
	uint32_t RESERVED7;
	__IO uint32_t AWHTR;
	uint32_t RESERVED8;
	__IO uint32_t AWLTR;
	uint32_t RESERVED9;
	__IO uint32_t AWSR;
	uint32_t RESERVED10;
	__IO uint32_t AWCFR;
	uint32_t RESERVED11;
	__IO uint32_t EXMAX;
	uint32_t RESERVED12;
	__IO uint32_t EXMIN;
	uint32_t RESERVED13;
	__IO uint32_t NVTIMR;
	uint32_t RESERVED14;
} DFSDM_FLT_TypeDef;

/* DFSDM channel Registers */
typedef struct
{
	__IO uint32_t CFGR1;
	uint32_t RESERVED0;
	__IO uint32_t CFGR2;
	uint32_t RESERVED1;
	__IO uint32_t AWSCDR;
	uint32_t RESERVED2;
	__IO uint32_t WDATR;
	uint32_t RESERVED3;
	union{
	__IO uint32_t DATINR;
	struct{
		__IO int16_t DATINR0;
		__IO int16_t DATINR1;
	};
	};
} DFSDM_Channel_TypeDef;

/* LTDC Registers */
typedef struct
{
	__IO uint32_t SSCR;
	__IO uint32_t BPCR;
	__IO uint32_t AWCR;
	__IO uint32_t TWCR;
	__IO uint32_t GCR;
	__IO uint32_t SRCR;
	__IO uint32_t BCCR;
	__IO uint32_t IER;
	__IO uint32_t ISR;
	__IO uint32_t ICR;
	__IO uint32_t LIPCR;
	__IO uint32_t CPSR;
	__IO uint32_t CDSR;
} LTDC_TypeDef;

/* LTDC Layer Registers */
typedef struct
{
	__IO uint32_t CR;
	__IO uint32_t WHPCR;
	__IO uint32_t WVPCR;
	__IO uint32_t CKCR;
	__IO uint32_t PFCR;
	__IO uint32_t CACR;
	__IO uint32_t DCCR;
	__IO uint32_t BFCR;
	__IO uint32_t CFBAR;
	__IO uint32_t CFBLR;
	__IO uint32_t CFBLNR;
	__IO uint32_t CLUTWR;
} LTDC_Layer_TypeDef;

/* GPHA Registers */
typedef struct
{
	__IO uint32_t CTLR;
	__IO uint32_t ISR;
	__IO uint32_t IFCR;
	__IO uint32_t FGMAR;
	__IO uint32_t FGOR;
	__IO uint32_t BGMAR;
	__IO uint32_t BGOR;
	__IO uint32_t FGPFCCR;
	__IO uint32_t FGCOLR;
	__IO uint32_t BGPFCCR;
	__IO uint32_t BGCOLR;
	__IO uint32_t FGCMAR;
	__IO uint32_t BGCMAR;
	__IO uint32_t OPFCCR;
	__IO uint32_t OCOLR;
	__IO uint32_t OMAR;
	__IO uint32_t OOR;
	__IO uint32_t NLR;
	__IO uint32_t LWR;
	__IO uint32_t AMTCR;
	__IO uint32_t FGCWRS;
	__IO uint32_t FGCDAT;
	__IO uint32_t BGCWRS;
	__IO uint32_t BGCDAT;
} GPHA_TypeDef;

/* HSADC Registers */
typedef struct
{
	__IO uint32_t CFGR;
	__IO uint32_t CTLR1;
	__IO uint32_t CTLR2;
	__IO uint32_t STATR;
	__IO uint32_t DATAR;
	__IO uint32_t ADDR0;
	__IO uint32_t ADDR1;
} HSADC_TypeDef;

/* SerDes Registers */
typedef struct
{
	__IO uint32_t CTRL;
	__IO uint32_t INT_EN;
	__IO uint32_t STATUS;
	__IO uint32_t RTX_CTRL;
	__IO uint32_t RX_LEN0;
	__IO uint32_t DATA0;
	__IO uint32_t DMA_0;
	__IO uint32_t RX_LEN1;
	__IO uint32_t DATA1;
	__IO uint32_t DMA_1;
} SDS_TypeDef;

/* memory mapped structure for Program Fast Interrupt Controller (PFIC) */
typedef struct{
	__I  uint32_t ISR[8];
	__I  uint32_t IPR[8];
	__IO uint32_t ITHRESDR;
	uint32_t RESERVED;
	__IO uint32_t CFGR;
	__I  uint32_t GISR;
	__IO uint8_t VTFIDR[4];
	uint8_t RESERVED0[12];
	__IO uint32_t VTFADDR[4];
	uint8_t RESERVED1[0x90];
	__O  uint32_t IENR[8];
	uint8_t RESERVED2[0x60];
	__O  uint32_t IRER[8];
	uint8_t RESERVED3[0x60];
	__O  uint32_t IPSR[8];
	uint8_t RESERVED4[0x60];
	__O  uint32_t IPRR[8];
	uint8_t RESERVED5[0x60];
	__IO uint32_t IACTR[8];
	uint8_t RESERVED6[0xE0];
	__IO uint8_t IPRIOR[256];
	uint8_t RESERVED7[0x100];
	__IO uint8_t IALLOCR[256];
	__I  uint32_t IAUTR[8];
	__IO uint32_t WAKEIP[2];
	uint8_t RESERVED8[0x58];
	__I  uint32_t CSTAR[2];
	uint8_t RESERVED9[0x4F8];
	__IO uint32_t EENR;
	__IO uint32_t EPR;
	__IO uint32_t EWUPR;
	uint8_t RESERVED10[0x84];
	__IO uint32_t SCTLR;
}PFIC_Type;

#endif // !__ASSEMBLER__

/* Peripheral memory map */
#ifdef __ASSEMBLER__
#define FLASH_BASE            (0x08000000) /* FLASH base address in the alias region */
#define ITCM_BASE             (0x200A0000) /* ITCM base address in the alias region */
#define DTCM_BASE             (0x200C0000) /* DTCM base address in the alias region */
#define SRAM_BASE             (0x20100000) /* SRAM base address in the alias region */
#define PERIPH_BASE           (0x40000000) /* Peripheral base address in the alias region */
#define CORE_PERIPH_BASE      (0xE0000000) /* System peripherals base address in the alias region */
#else
#define FLASH_BASE            ((uint32_t)0x08000000) /* FLASH base address in the alias region */
#define ITCM_BASE             ((uint32_t)0x200A0000) /* ITCM base address in the alias region */
#define DTCM_BASE             ((uint32_t)0x200C0000) /* DTCM base address in the alias region */
#define SRAM_BASE             ((uint32_t)0x20100000) /* SRAM base address in the alias region */
#define PERIPH_BASE           ((uint32_t)0x40000000) /* Peripheral base address in the alias region */
#define CORE_PERIPH_BASE      ((uint32_t)0xE0000000) /* System peripherals base address in the alias region */
#endif

#define HBPERIPH_BASE         (PERIPH_BASE)

#define TIM2_BASE             (HBPERIPH_BASE + 0x00000)
#define TIM3_BASE             (HBPERIPH_BASE + 0x00400)
#define TIM4_BASE             (HBPERIPH_BASE + 0x00800)
#define TIM5_BASE             (HBPERIPH_BASE + 0x00C00)
#define TIM6_BASE             (HBPERIPH_BASE + 0x01000)
#define TIM7_BASE             (HBPERIPH_BASE + 0x01400)
#define USART6_BASE           (HBPERIPH_BASE + 0x01800)
#define USART7_BASE           (HBPERIPH_BASE + 0x01C00)
#define USART8_BASE           (HBPERIPH_BASE + 0x02000)
#define LPTIM1_BASE           (HBPERIPH_BASE + 0x02400)
#define RTC_BASE              (HBPERIPH_BASE + 0x02800)
#define WWDG_BASE             (HBPERIPH_BASE + 0x02C00)
#define IWDG_BASE             (HBPERIPH_BASE + 0x03000)
#define LPTIM2_BASE           (HBPERIPH_BASE + 0x03400)
#define SPI2_BASE             (HBPERIPH_BASE + 0x03800)
#define SPI3_BASE             (HBPERIPH_BASE + 0x03C00)
#define SPI4_BASE             (HBPERIPH_BASE + 0x04000)
#define USART2_BASE           (HBPERIPH_BASE + 0x04400)
#define USART3_BASE           (HBPERIPH_BASE + 0x04800)
#define USART4_BASE           (HBPERIPH_BASE + 0x04C00)
#define USART5_BASE           (HBPERIPH_BASE + 0x05000)
#define I2C1_BASE             (HBPERIPH_BASE + 0x05400)
#define I2C2_BASE             (HBPERIPH_BASE + 0x05800)
#define I2C3_BASE             (HBPERIPH_BASE + 0x05C00)
#define CAN1_BASE             (HBPERIPH_BASE + 0x06400)
#define CAN2_BASE             (HBPERIPH_BASE + 0x06800)
#define PWR_BASE              (HBPERIPH_BASE + 0x07000)
#define DAC_BASE              (HBPERIPH_BASE + 0x07400)
#define CAN3_BASE             (HBPERIPH_BASE + 0x07800)
#define SWPMI_BASE            (HBPERIPH_BASE + 0x08400)

#define AFIO_BASE             (HBPERIPH_BASE + 0x10000)
#define EXTI_BASE             (HBPERIPH_BASE + 0x10400)
#define GPIOA_BASE            (HBPERIPH_BASE + 0x10800)
#define GPIOB_BASE            (HBPERIPH_BASE + 0x10C00)
#define GPIOC_BASE            (HBPERIPH_BASE + 0x11000)
#define GPIOD_BASE            (HBPERIPH_BASE + 0x11400)
#define GPIOE_BASE            (HBPERIPH_BASE + 0x11800)
#define GPIOF_BASE            (HBPERIPH_BASE + 0x11C00)
#define ADC1_BASE             (HBPERIPH_BASE + 0x12400)
#define ADC2_BASE             (HBPERIPH_BASE + 0x12800)
#define TIM1_BASE             (HBPERIPH_BASE + 0x12C00)
#define SPI1_BASE             (HBPERIPH_BASE + 0x13000)
#define TIM8_BASE             (HBPERIPH_BASE + 0x13400)
#define USART1_BASE           (HBPERIPH_BASE + 0x13800)
#define TIM12_BASE            (HBPERIPH_BASE + 0x13C00)
#define I2C4_BASE             (HBPERIPH_BASE + 0x14000)
#define I3C_BASE              (HBPERIPH_BASE + 0x14400)

#define LTDC_BASE             (HBPERIPH_BASE + 0x14800)
#define LTDC_L1_BASE          (HBPERIPH_BASE + 0x14834)
#define LTDC_L2_BASE          (HBPERIPH_BASE + 0x14864)

#define TIM9_BASE             (HBPERIPH_BASE + 0x14C00)
#define TIM10_BASE            (HBPERIPH_BASE + 0x15000)
#define TIM11_BASE            (HBPERIPH_BASE + 0x15400)

#define SAI_BASE              (HBPERIPH_BASE + 0x15800)
#define SAI_Block_A_BASE      (SAI_BASE + 0x04)
#define SAI_Block_B_BASE      (SAI_BASE + 0x24)

#define GPHA_BASE             (HBPERIPH_BASE + 0x16800)
#define ECDC_BASE             (HBPERIPH_BASE + 0x16C00)

#define DFSDM_BASE            (HBPERIPH_BASE + 0x17000)
#define DFSDM_Channel0_BASE   (HBPERIPH_BASE + 0x17000)
#define DFSDM_Channel1_BASE   (HBPERIPH_BASE + 0x17004)
#define DFSDM_FLT0_BASE       (HBPERIPH_BASE + 0x17028)
#define DFSDM_FLT1_BASE       (HBPERIPH_BASE + 0x1702C)

