SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
#define HSADC_BASE            (HBPERIPH_BASE + 0x17400)
#define OPA_BASE              (HBPERIPH_BASE + 0x17800)
#define SDIO_BASE             (HBPERIPH_BASE + 0x18000)

#define DMA1_BASE             (HBPERIPH_BASE + 0x20000)
#define DMA1_Channel1_BASE    (HBPERIPH_BASE + 0x20008)
#define DMA1_Channel2_BASE    (HBPERIPH_BASE + 0x2001C)
#define DMA1_Channel3_BASE    (HBPERIPH_BASE + 0x20030)
#define DMA1_Channel4_BASE    (HBPERIPH_BASE + 0x20044)
#define DMA1_Channel5_BASE    (HBPERIPH_BASE + 0x20058)
#define DMA1_Channel6_BASE    (HBPERIPH_BASE + 0x2006C)
#define DMA1_Channel7_BASE    (HBPERIPH_BASE + 0x20080)
#define DMA1_Channel8_BASE    (HBPERIPH_BASE + 0x20094)

#define DMA2_BASE             (HBPERIPH_BASE + 0x20400)
#define DMA2_Channel1_BASE    (HBPERIPH_BASE + 0x20408)
#define DMA2_Channel2_BASE    (HBPERIPH_BASE + 0x2041C)
#define DMA2_Channel3_BASE    (HBPERIPH_BASE + 0x20430)
#define DMA2_Channel4_BASE    (HBPERIPH_BASE + 0x20444)
#define DMA2_Channel5_BASE    (HBPERIPH_BASE + 0x20458)
#define DMA2_Channel6_BASE    (HBPERIPH_BASE + 0x2046C)
#define DMA2_Channel7_BASE    (HBPERIPH_BASE + 0x20480)
#define DMA2_Channel8_BASE    (HBPERIPH_BASE + 0x20494)

#define DMAMUX_BASE           (HBPERIPH_BASE + 0x20800)
#define RCC_BASE              (HBPERIPH_BASE + 0x21000)
#define FLASH_R_BASE          (HBPERIPH_BASE + 0x22000)
#define CRC_BASE              (HBPERIPH_BASE + 0x23000)
#define USBFS_BASE            (HBPERIPH_BASE + 0x23400)
#define RNG_BASE              (HBPERIPH_BASE + 0x23C00)
#define SDMMC_BASE            (HBPERIPH_BASE + 0x24000)
#define USBPD_BASE            (HBPERIPH_BASE + 0x24400)
#define QSPI1_BASE            (HBPERIPH_BASE + 0x24C00)
#define QSPI2_BASE            (HBPERIPH_BASE + 0x25000)
#define FMC_R_BASE            (HBPERIPH_BASE + 0x25400)
#define FMC_Bank1_R_BASE      (FMC_R_BASE + 0x0000)
#define FMC_Bank1E_R_BASE     (FMC_R_BASE + 0x0104)
#define FMC_Bank3_R_BASE      (FMC_R_BASE + 0x0080)
#define FMC_Bank5_6_R_BASE    (FMC_R_BASE + 0x0140)

#define DVP_BASE              (HBPERIPH_BASE + 0x25800)
#define PIOC_BASE             (HBPERIPH_BASE + 0x25C00)

#define SERDES_BASE           (HBPERIPH_BASE + 0x27C00)
#define SERDES1_BASE          (SERDES_BASE)
#define SERDES2_BASE          (SERDES_BASE+0x0040)

#define ETH_BASE              (HBPERIPH_BASE + 0x28000)
#define ETH_MAC_BASE          (ETH_BASE)
#define ETH_MMC_BASE          (ETH_BASE + 0x0100)
#define ETH_PTP_BASE          (ETH_BASE + 0x0700)
#define ETH_DMA_BASE          (ETH_BASE + 0x1000)

#define USBHS_BASE            (HBPERIPH_BASE + 0x30000)
#define USBHSD_BASE           (USBHS_BASE)
#define USBHSH_BASE           (USBHS_BASE + 0x100)

#define USBSS_BASE            (HBPERIPH_BASE + 0x34000)
#define UHSIF_BASE            (HBPERIPH_BASE + 0x38000)

#define OB_BASE               ((uint32_t)0x1FFFF800)

#define FLASH_CFGR0_BASE      ((uint32_t)0x4002202C)
#define SYS_CFGR0_BASE        ((uint32_t)0x5003C000)
#define SYS_CFGR4_BASE        ((uint32_t)0x5003C010)

#define PFIC_BASE    (CORE_PERIPH_BASE + 0xE000)
#define SysTick0_BASE    (CORE_PERIPH_BASE + 0xF000)
#define SysTick1_BASE    (CORE_PERIPH_BASE + 0xF080)

#define SysTick_BASE    (CORE_PERIPH_BASE + 0xF000)

/* Peripheral declaration */
#define TIM2                  ((TIM_TypeDef *) TIM2_BASE)
#define TIM3                  ((TIM_TypeDef *) TIM3_BASE)
#define TIM4                  ((TIM_TypeDef *) TIM4_BASE)
#define TIM5                  ((TIM_TypeDef *) TIM5_BASE)
#define TIM6                  ((TIM_TypeDef *) TIM6_BASE)
#define TIM7                  ((TIM_TypeDef *) TIM7_BASE)
#define USART6                ((USART_TypeDef *) USART6_BASE)
#define USART7                ((USART_TypeDef *) USART7_BASE)
#define USART8                ((USART_TypeDef *) USART8_BASE)
#define LPTIM1                ((LPTIM_TypeDef *) LPTIM1_BASE)

#define RTC                   ((RTC_TypeDef *) RTC_BASE)
#define WWDG                  ((WWDG_TypeDef *) WWDG_BASE)
#define IWDG                  ((IWDG_TypeDef *) IWDG_BASE)
#define LPTIM2                ((LPTIM_TypeDef *) LPTIM2_BASE)
#define SPI2                  ((SPI_TypeDef *) SPI2_BASE)
#define SPI3                  ((SPI_TypeDef *) SPI3_BASE)
#define SPI4                  ((SPI_TypeDef *) SPI4_BASE)
#define USART2                ((USART_TypeDef *) USART2_BASE)
#define USART3                ((USART_TypeDef *) USART3_BASE)
#define USART4                ((USART_TypeDef *) USART4_BASE)
#define USART5                ((USART_TypeDef *) USART5_BASE)
#define I2C1                  ((I2C_TypeDef *) I2C1_BASE)
#define I2C2                  ((I2C_TypeDef *) I2C2_BASE)
#define I2C3                  ((I2C_TypeDef *) I2C3_BASE)
#define CAN1                  ((CAN_TypeDef *) CAN1_BASE)
#define CAN2                  ((CAN_TypeDef *) CAN2_BASE)
#define PWR                   ((PWR_TypeDef *) PWR_BASE)
#define DAC                   ((DAC_TypeDef *) DAC_BASE)
#define CAN3                  ((CAN_TypeDef *) CAN3_BASE)
#define SWPMI                 ((SWPMI_TypeDef *) SWPMI_BASE)

#define AFIO                  ((AFIO_TypeDef *) AFIO_BASE)
#define EXTI                  ((EXTI_TypeDef *) EXTI_BASE)
#define GPIOA                 ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB                 ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC                 ((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOD                 ((GPIO_TypeDef *) GPIOD_BASE)
#define GPIOE                 ((GPIO_TypeDef *) GPIOE_BASE)
#define GPIOF                 ((GPIO_TypeDef *) GPIOF_BASE)
#define ADC1                  ((ADC_TypeDef *) ADC1_BASE)
#define ADC2                  ((ADC_TypeDef *) ADC2_BASE)
#define TKey1                 ((ADC_TypeDef *) ADC1_BASE)
#define TKey2                 ((ADC_TypeDef *) ADC2_BASE)
#define TIM1                  ((TIM_TypeDef *) TIM1_BASE)
#define SPI1                  ((SPI_TypeDef *) SPI1_BASE)
#define TIM8                  ((TIM_TypeDef *) TIM8_BASE)
#define USART1                ((USART_TypeDef *) USART1_BASE)
#define TIM12                 ((TIM_TypeDef *) TIM12_BASE)
#define I2C4                  ((I2C_TypeDef *) I2C4_BASE)
#define I3C                   ((I3C_TypeDef *) I3C_BASE)
#define LTDC                  ((LTDC_TypeDef *) LTDC_BASE)
#define LTDC_Layer1           ((LTDC_Layer_TypeDef *) LTDC_L1_BASE)
#define LTDC_Layer2           ((LTDC_Layer_TypeDef *) LTDC_L2_BASE)
#define TIM9                  ((TIM_TypeDef *) TIM9_BASE)
#define TIM10                 ((TIM_TypeDef *) TIM10_BASE)
#define TIM11                 ((TIM_TypeDef *) TIM11_BASE)
#define SAI_Block_A           ((SAI_Block_TypeDef *) SAI_Block_A_BASE)
#define SAI_Block_B           ((SAI_Block_TypeDef *) SAI_Block_B_BASE)
#define GPHA                  ((GPHA_TypeDef *) GPHA_BASE)
#define ECDC                  ((ECDC_TypeDef *) ECDC_BASE)
#define DFSDM_FLT0            ((DFSDM_FLT_TypeDef *) DFSDM_FLT0_BASE)
#define DFSDM_FLT1            ((DFSDM_FLT_TypeDef *) DFSDM_FLT1_BASE)
#define DFSDM_Channel0        ((DFSDM_Channel_TypeDef *) DFSDM_Channel0_BASE)
#define DFSDM_Channel1        ((DFSDM_Channel_TypeDef *) DFSDM_Channel1_BASE)
#define HSADC                 ((HSADC_TypeDef *) HSADC_BASE)
#define OPA                   ((OPA_TypeDef *) OPA_BASE)
#define SDIO                  ((SDIO_TypeDef *) SDIO_BASE)

#define DMA1                  ((DMA_TypeDef *) DMA1_BASE)
#define DMA2                  ((DMA_TypeDef *) DMA2_BASE)
#define DMA1_Channel1         ((DMA_Channel_TypeDef *) DMA1_Channel1_BASE)
#define DMA1_Channel2         ((DMA_Channel_TypeDef *) DMA1_Channel2_BASE)
#define DMA1_Channel3         ((DMA_Channel_TypeDef *) DMA1_Channel3_BASE)
#define DMA1_Channel4         ((DMA_Channel_TypeDef *) DMA1_Channel4_BASE)
#define DMA1_Channel5         ((DMA_Channel_TypeDef *) DMA1_Channel5_BASE)
#define DMA1_Channel6         ((DMA_Channel_TypeDef *) DMA1_Channel6_BASE)
#define DMA1_Channel7         ((DMA_Channel_TypeDef *) DMA1_Channel7_BASE)
#define DMA1_Channel8         ((DMA_Channel_TypeDef *) DMA1_Channel8_BASE)
#define DMA2_Channel1         ((DMA_Channel_TypeDef *) DMA2_Channel1_BASE)
#define DMA2_Channel2         ((DMA_Channel_TypeDef *) DMA2_Channel2_BASE)
#define DMA2_Channel3         ((DMA_Channel_TypeDef *) DMA2_Channel3_BASE)
#define DMA2_Channel4         ((DMA_Channel_TypeDef *) DMA2_Channel4_BASE)
#define DMA2_Channel5         ((DMA_Channel_TypeDef *) DMA2_Channel5_BASE)
#define DMA2_Channel6         ((DMA_Channel_TypeDef *) DMA2_Channel6_BASE)
#define DMA2_Channel7         ((DMA_Channel_TypeDef *) DMA2_Channel7_BASE)
#define DMA2_Channel8         ((DMA_Channel_TypeDef *) DMA2_Channel8_BASE)
#define DMAMUX                ((DMAMUX_TypeDef *) DMAMUX_BASE)
#define RCC                   ((RCC_TypeDef *) RCC_BASE)
#define FLASH                 ((FLASH_TypeDef *) FLASH_R_BASE)
#define CRC                   ((CRC_TypeDef *) CRC_BASE)

#define USBFSD                ((USBFSD_TypeDef *)USBFS_BASE)
#define USBFSH                ((USBFSH_TypeDef *)USBFS_BASE)
#define RNG                   ((RNG_TypeDef *) RNG_BASE)
#define SDMMC                 ((SDMMC_TypeDef *) SDMMC_BASE)
#define USBPD                 ((USBPD_TypeDef *) USBPD_BASE)
#define QSPI1                 ((QSPI_TypeDef *) QSPI1_BASE)
#define QSPI2                 ((QSPI_TypeDef *) QSPI2_BASE)
#define FMC_Bank1             ((FMC_Bank1_TypeDef *) FMC_Bank1_R_BASE)
#define FMC_Bank1E            ((FMC_Bank1E_TypeDef *) FMC_Bank1E_R_BASE)
#define FMC_Bank3             ((FMC_Bank3_TypeDef *) FMC_Bank3_R_BASE)
#define FMC_Bank5_6           ((FMC_Bank5_6_TypeDef *) FMC_Bank5_6_R_BASE)
#define DVP                   ((DVP_TypeDef *) DVP_BASE)
#define ETH                   ((ETH_TypeDef *) ETH_BASE)
#define USBHSD                ((USBHSD_TypeDef *) USBHSD_BASE)
#define USBHSH                ((USBHSH_TypeDef *) USBHSH_BASE)
#define USBSSD                ((USBSSD_TypeDef *) USBSS_BASE)
#define USBSSH                ((USBSSH_TypeDef *) USBSS_BASE)
#define SDS1                  ((SDS_TypeDef *) SERDES1_BASE)
#define SDS2                  ((SDS_TypeDef *) SERDES2_BASE)
#define UHSIF                 ((UHSIF_TypeDef *) UHSIF_BASE)
#define OB                    ((OB_TypeDef *) OB_BASE)

/******************************************************************************/
/*                         Peripheral Registers Bits Definition               */
/******************************************************************************/

/******************************************************************************/
/*                        Analog to Digital Converter                         */
/******************************************************************************/

/********************  Bit definition for ADC_STATR register  ********************/
#define  ADC_AWD                                     ((uint8_t)0x01)               /* Analog watchdog flag */
#define  ADC_EOC                                     ((uint8_t)0x02)               /* End of conversion */
#define  ADC_JEOC                                    ((uint8_t)0x04)               /* Injected channel end of conversion */
#define  ADC_JSTRT                                   ((uint8_t)0x08)               /* Injected channel Start flag */
#define  ADC_STRT                                    ((uint8_t)0x10)               /* Regular channel Start flag */

#define  ADC_RSTF                                    ((uint16_t)0x8000)            /* Reset flag */

/*******************  Bit definition for ADC_CTLR1 register  ********************/
#define  ADC_AWDCH                                   ((uint32_t)0x0000001F)        /* AWDCH[4:0] bits (Analog watchdog channel select bits) */
#define  ADC_AWDCH_0                                 ((uint32_t)0x00000001)        /* Bit 0 */
#define  ADC_AWDCH_1                                 ((uint32_t)0x00000002)        /* Bit 1 */
#define  ADC_AWDCH_2                                 ((uint32_t)0x00000004)        /* Bit 2 */
#define  ADC_AWDCH_3                                 ((uint32_t)0x00000008)        /* Bit 3 */
#define  ADC_AWDCH_4                                 ((uint32_t)0x00000010)        /* Bit 4 */

#define  ADC_EOCIE                                   ((uint32_t)0x00000020)        /* Interrupt enable for EOC */
#define  ADC_AWDIE                                   ((uint32_t)0x00000040)        /* Analog Watchdog interrupt enable */
#define  ADC_JEOCIE                                  ((uint32_t)0x00000080)        /* Interrupt enable for injected channels */
#define  ADC_SCAN                                    ((uint32_t)0x00000100)        /* Scan mode */
#define  ADC_AWDSGL                                  ((uint32_t)0x00000200)        /* Enable the watchdog on a single channel in scan mode */
#define  ADC_JAUTO                                   ((uint32_t)0x00000400)        /* Automatic injected group conversion */
#define  ADC_DISCEN                                  ((uint32_t)0x00000800)        /* Discontinuous mode on regular channels */
#define  ADC_JDISCEN                                 ((uint32_t)0x00001000)        /* Discontinuous mode on injected channels */

