SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
#define  ADC_L                                       ((uint32_t)0x00F00000)        /* L[3:0] bits (Regular channel sequence length) */
#define  ADC_L_0                                     ((uint32_t)0x00100000)        /* Bit 0 */
#define  ADC_L_1                                     ((uint32_t)0x00200000)        /* Bit 1 */
#define  ADC_L_2                                     ((uint32_t)0x00400000)        /* Bit 2 */
#define  ADC_L_3                                     ((uint32_t)0x00800000)        /* Bit 3 */

/*******************  Bit definition for ADC_RSQR2 register  *******************/
#define  ADC_SQ7                                     ((uint32_t)0x0000001F)        /* SQ7[4:0] bits (7th conversion in regular sequence) */
#define  ADC_SQ7_0                                   ((uint32_t)0x00000001)        /* Bit 0 */
#define  ADC_SQ7_1                                   ((uint32_t)0x00000002)        /* Bit 1 */
#define  ADC_SQ7_2                                   ((uint32_t)0x00000004)        /* Bit 2 */
#define  ADC_SQ7_3                                   ((uint32_t)0x00000008)        /* Bit 3 */
#define  ADC_SQ7_4                                   ((uint32_t)0x00000010)        /* Bit 4 */

#define  ADC_SQ8                                     ((uint32_t)0x000003E0)        /* SQ8[4:0] bits (8th conversion in regular sequence) */
#define  ADC_SQ8_0                                   ((uint32_t)0x00000020)        /* Bit 0 */
#define  ADC_SQ8_1                                   ((uint32_t)0x00000040)        /* Bit 1 */
#define  ADC_SQ8_2                                   ((uint32_t)0x00000080)        /* Bit 2 */
#define  ADC_SQ8_3                                   ((uint32_t)0x00000100)        /* Bit 3 */
#define  ADC_SQ8_4                                   ((uint32_t)0x00000200)        /* Bit 4 */

#define  ADC_SQ9                                     ((uint32_t)0x00007C00)        /* SQ9[4:0] bits (9th conversion in regular sequence) */
#define  ADC_SQ9_0                                   ((uint32_t)0x00000400)        /* Bit 0 */
#define  ADC_SQ9_1                                   ((uint32_t)0x00000800)        /* Bit 1 */
#define  ADC_SQ9_2                                   ((uint32_t)0x00001000)        /* Bit 2 */
#define  ADC_SQ9_3                                   ((uint32_t)0x00002000)        /* Bit 3 */
#define  ADC_SQ9_4                                   ((uint32_t)0x00004000)        /* Bit 4 */

#define  ADC_SQ10                                    ((uint32_t)0x000F8000)        /* SQ10[4:0] bits (10th conversion in regular sequence) */
#define  ADC_SQ10_0                                  ((uint32_t)0x00008000)        /* Bit 0 */
#define  ADC_SQ10_1                                  ((uint32_t)0x00010000)        /* Bit 1 */
#define  ADC_SQ10_2                                  ((uint32_t)0x00020000)        /* Bit 2 */
#define  ADC_SQ10_3                                  ((uint32_t)0x00040000)        /* Bit 3 */
#define  ADC_SQ10_4                                  ((uint32_t)0x00080000)        /* Bit 4 */

#define  ADC_SQ11                                    ((uint32_t)0x01F00000)        /* SQ11[4:0] bits (11th conversion in regular sequence) */
#define  ADC_SQ11_0                                  ((uint32_t)0x00100000)        /* Bit 0 */
#define  ADC_SQ11_1                                  ((uint32_t)0x00200000)        /* Bit 1 */
#define  ADC_SQ11_2                                  ((uint32_t)0x00400000)        /* Bit 2 */
#define  ADC_SQ11_3                                  ((uint32_t)0x00800000)        /* Bit 3 */
#define  ADC_SQ11_4                                  ((uint32_t)0x01000000)        /* Bit 4 */

#define  ADC_SQ12                                    ((uint32_t)0x3E000000)        /* SQ12[4:0] bits (12th conversion in regular sequence) */
#define  ADC_SQ12_0                                  ((uint32_t)0x02000000)        /* Bit 0 */
#define  ADC_SQ12_1                                  ((uint32_t)0x04000000)        /* Bit 1 */
#define  ADC_SQ12_2                                  ((uint32_t)0x08000000)        /* Bit 2 */
#define  ADC_SQ12_3                                  ((uint32_t)0x10000000)        /* Bit 3 */
#define  ADC_SQ12_4                                  ((uint32_t)0x20000000)        /* Bit 4 */

/*******************  Bit definition for ADC_RSQR3 register  *******************/
#define  ADC_SQ1                                     ((uint32_t)0x0000001F)        /* SQ1[4:0] bits (1st conversion in regular sequence) */
#define  ADC_SQ1_0                                   ((uint32_t)0x00000001)        /* Bit 0 */
#define  ADC_SQ1_1                                   ((uint32_t)0x00000002)        /* Bit 1 */
#define  ADC_SQ1_2                                   ((uint32_t)0x00000004)        /* Bit 2 */
#define  ADC_SQ1_3                                   ((uint32_t)0x00000008)        /* Bit 3 */
#define  ADC_SQ1_4                                   ((uint32_t)0x00000010)        /* Bit 4 */

#define  ADC_SQ2                                     ((uint32_t)0x000003E0)        /* SQ2[4:0] bits (2nd conversion in regular sequence) */
#define  ADC_SQ2_0                                   ((uint32_t)0x00000020)        /* Bit 0 */
#define  ADC_SQ2_1                                   ((uint32_t)0x00000040)        /* Bit 1 */
#define  ADC_SQ2_2                                   ((uint32_t)0x00000080)        /* Bit 2 */
#define  ADC_SQ2_3                                   ((uint32_t)0x00000100)        /* Bit 3 */
#define  ADC_SQ2_4                                   ((uint32_t)0x00000200)        /* Bit 4 */

#define  ADC_SQ3                                     ((uint32_t)0x00007C00)        /* SQ3[4:0] bits (3rd conversion in regular sequence) */
#define  ADC_SQ3_0                                   ((uint32_t)0x00000400)        /* Bit 0 */
#define  ADC_SQ3_1                                   ((uint32_t)0x00000800)        /* Bit 1 */
#define  ADC_SQ3_2                                   ((uint32_t)0x00001000)        /* Bit 2 */
#define  ADC_SQ3_3                                   ((uint32_t)0x00002000)        /* Bit 3 */
#define  ADC_SQ3_4                                   ((uint32_t)0x00004000)        /* Bit 4 */

