SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
#define  CAN_TSTATR_TME                              ((uint32_t)0x1C000000)        /* TME[2:0] bits */
#define  CAN_TSTATR_TME0                             ((uint32_t)0x04000000)        /* Transmit Mailbox 0 Empty */
#define  CAN_TSTATR_TME1                             ((uint32_t)0x08000000)        /* Transmit Mailbox 1 Empty */
#define  CAN_TSTATR_TME2                             ((uint32_t)0x10000000)        /* Transmit Mailbox 2 Empty */

#define  CAN_TSTATR_LOW                              ((uint32_t)0xE0000000)        /* LOW[2:0] bits */
#define  CAN_TSTATR_LOW0                             ((uint32_t)0x20000000)        /* Lowest Priority Flag for Mailbox 0 */
#define  CAN_TSTATR_LOW1                             ((uint32_t)0x40000000)        /* Lowest Priority Flag for Mailbox 1 */
#define  CAN_TSTATR_LOW2                             ((uint32_t)0x80000000)        /* Lowest Priority Flag for Mailbox 2 */

/*******************  Bit definition for CAN_RFIFO0 register  *******************/
#define  CAN_RFIFO0_FMP0                             ((uint8_t)0x03)               /* FIFO 0 Message Pending */
#define  CAN_RFIFO0_FULL0                            ((uint8_t)0x08)               /* FIFO 0 Full */
#define  CAN_RFIFO0_FOVR0                            ((uint8_t)0x10)               /* FIFO 0 Overrun */
#define  CAN_RFIFO0_RFOM0                            ((uint8_t)0x20)               /* Release FIFO 0 Output Mailbox */

/*******************  Bit definition for CAN_RFIFO1 register  *******************/
#define  CAN_RFIFO1_FMP1                             ((uint8_t)0x03)               /* FIFO 1 Message Pending */
#define  CAN_RFIFO1_FULL1                            ((uint8_t)0x08)               /* FIFO 1 Full */
#define  CAN_RFIFO1_FOVR1                            ((uint8_t)0x10)               /* FIFO 1 Overrun */
#define  CAN_RFIFO1_RFOM1                            ((uint8_t)0x20)               /* Release FIFO 1 Output Mailbox */

/********************  Bit definition for CAN_INTENR register  *******************/
#define  CAN_INTENR_TMEIE                            ((uint32_t)0x00000001)        /* Transmit Mailbox Empty Interrupt Enable */
#define  CAN_INTENR_FMPIE0                           ((uint32_t)0x00000002)        /* FIFO Message Pending Interrupt Enable */
#define  CAN_INTENR_FFIE0                            ((uint32_t)0x00000004)        /* FIFO Full Interrupt Enable */
#define  CAN_INTENR_FOVIE0                           ((uint32_t)0x00000008)        /* FIFO Overrun Interrupt Enable */
#define  CAN_INTENR_EMPIE1                           ((uint32_t)0x00000010)        /* FIF1 Message Pending Interrupt Enable */
#define  CAN_INTENR_FFIE1                            ((uint32_t)0x00000020)        /* FIF1 Full Interrupt Enable */
#define  CAN_INTENR_FOVIE1                           ((uint32_t)0x00000040)        /* FIF1 Overrun Interrupt Enable */
#define  CAN_INTENR_EWGIE                            ((uint32_t)0x00000100)        /* Error Warning Interrupt Enable */
#define  CAN_INTENR_EPVIE                            ((uint32_t)0x00000200)        /* Error Passive Interrupt Enable */
#define  CAN_INTENR_BOFIE                            ((uint32_t)0x00000400)        /* Bus-Off Interrupt Enable */
#define  CAN_INTENR_LECIE                            ((uint32_t)0x00000800)        /* Last Error Code Interrupt Enable */
#define  CAN_INTENR_ERRIE                            ((uint32_t)0x00008000)        /* Error Interrupt Enable */
#define  CAN_INTENR_WKUIE                            ((uint32_t)0x00010000)        /* Wakeup Interrupt Enable */
#define  CAN_INTENR_SLKIE                            ((uint32_t)0x00020000)        /* Sleep Interrupt Enable */

/********************  Bit definition for CAN_ERRSR register  *******************/
#define  CAN_ERRSR_EWGF                              ((uint32_t)0x00000001)        /* Error Warning Flag */
#define  CAN_ERRSR_EPVF                              ((uint32_t)0x00000002)        /* Error Passive Flag */
#define  CAN_ERRSR_BOFF                              ((uint32_t)0x00000004)        /* Bus-Off Flag */

#define  CAN_ERRSR_LEC                               ((uint32_t)0x00000070)        /* LEC[2:0] bits (Last Error Code) */
#define  CAN_ERRSR_LEC_0                             ((uint32_t)0x00000010)        /* Bit 0 */
#define  CAN_ERRSR_LEC_1                             ((uint32_t)0x00000020)        /* Bit 1 */
#define  CAN_ERRSR_LEC_2                             ((uint32_t)0x00000040)        /* Bit 2 */

#define  CAN_ERRSR_TEC                               ((uint32_t)0x00FF0000)        /* Least significant byte of the 9-bit Transmit Error Counter */
#define  CAN_ERRSR_REC                               ((uint32_t)0xFF000000)        /* Receive Error Counter */

/********************  Bit definition for CAN_BTIMR register  *******************/
#define  CAN_BTIMR_BRP                               ((uint32_t)0x000003FF)
#define  CAN_BTIMR_BTR_TS1_T                         ((uint32_t)0x0000F000)
#define  CAN_BTIMR_TS1                               ((uint32_t)0x000F0000)
#define  CAN_BTIMR_TS2                               ((uint32_t)0x00F00000)
#define  CAN_BTIMR_SJW                               ((uint32_t)0x0F000000)

#define  CAN_BTIMR_LBKM                              ((uint32_t)0x40000000)
#define  CAN_BTIMR_SILM                              ((uint32_t)0x80000000)

/*******************  Bit definition for CAN_TTCTLR register  ********************/
#define  CAN_TTCTLR_TIMCMV                           ((uint32_t)0x0000FFFF)
#define  CAN_TTCTLR_TIMRST                           ((uint32_t)0x00010000)
#define  CAN_TTCTLR_MODE                             ((uint32_t)0x00020000)

/*******************  Bit definition for CAN_TTCNT register  ********************/
#define  CAN_TIMCNT                                  ((uint32_t)0x0000FFFF)

/*******************  Bit definition for CAN_TERR_CNT register  ********************/
#define  CAN_TERR_CNT                                ((uint32_t)0x000001FF)

/******************  Bit definition for CAN_TXMI0R register  ********************/
#define CAN_TXMI0R_TXRQ                              ((uint32_t)0x00000001) /* Transmit Mailbox Request */
#define CAN_TXMI0R_RTR                               ((uint32_t)0x00000002) /* Remote Transmission Request */
#define CAN_TXMI0R_IDE                               ((uint32_t)0x00000004) /* Identifier Extension */
#define CAN_TXMI0R_EXID                              ((uint32_t)0x001FFFF8) /* Extended Identifier */
#define CAN_TXMI0R_STID                              ((uint32_t)0xFFE00000) /* Standard Identifier or Extended Identifier */

/******************  Bit definition for CAN_TXMDT0R register  *******************/
#define CAN_TXMDT0R_DLC                              ((uint32_t)0x0000000F) /* Data Length Code */
#define CAN_TXMDT0R_TGT                              ((uint32_t)0x00000100) /* Transmit Global Time */
#define CAN_TXMDT0R_TIME                             ((uint32_t)0xFFFF0000) /* Message Time Stamp */

