SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
/******************  Bit definition for CAN_TXMDL0R register  *******************/
#define CAN_TXMDL0R_DATA0                            ((uint32_t)0x000000FF) /* Data byte 0 */
#define CAN_TXMDL0R_DATA1                            ((uint32_t)0x0000FF00) /* Data byte 1 */
#define CAN_TXMDL0R_DATA2                            ((uint32_t)0x00FF0000) /* Data byte 2 */
#define CAN_TXMDL0R_DATA3                            ((uint32_t)0xFF000000) /* Data byte 3 */

/******************  Bit definition for CAN_TXMDH0R register  *******************/
#define CAN_TXMDH0R_DATA4                            ((uint32_t)0x000000FF) /* Data byte 4 */
#define CAN_TXMDH0R_DATA5                            ((uint32_t)0x0000FF00) /* Data byte 5 */
#define CAN_TXMDH0R_DATA6                            ((uint32_t)0x00FF0000) /* Data byte 6 */
#define CAN_TXMDH0R_DATA7                            ((uint32_t)0xFF000000) /* Data byte 7 */

/*******************  Bit definition for CAN_TXMI1R register  *******************/
#define CAN_TXMI1R_TXRQ                              ((uint32_t)0x00000001) /* Transmit Mailbox Request */
#define CAN_TXMI1R_RTR                               ((uint32_t)0x00000002) /* Remote Transmission Request */
#define CAN_TXMI1R_IDE                               ((uint32_t)0x00000004) /* Identifier Extension */
#define CAN_TXMI1R_EXID                              ((uint32_t)0x001FFFF8) /* Extended Identifier */
#define CAN_TXMI1R_STID                              ((uint32_t)0xFFE00000) /* Standard Identifier or Extended Identifier */

/*******************  Bit definition for CAN_TXMDT1R register  ******************/
#define CAN_TXMDT1R_DLC                              ((uint32_t)0x0000000F) /* Data Length Code */
#define CAN_TXMDT1R_TGT                              ((uint32_t)0x00000100) /* Transmit Global Time */
#define CAN_TXMDT1R_TIME                             ((uint32_t)0xFFFF0000) /* Message Time Stamp */

/*******************  Bit definition for CAN_TXMDL1R register  ******************/
#define CAN_TXMDL1R_DATA0                            ((uint32_t)0x000000FF) /* Data byte 0 */
#define CAN_TXMDL1R_DATA1                            ((uint32_t)0x0000FF00) /* Data byte 1 */
#define CAN_TXMDL1R_DATA2                            ((uint32_t)0x00FF0000) /* Data byte 2 */
#define CAN_TXMDL1R_DATA3                            ((uint32_t)0xFF000000) /* Data byte 3 */

/*******************  Bit definition for CAN_TXMDH1R register  ******************/
#define CAN_TXMDH1R_DATA4                            ((uint32_t)0x000000FF) /* Data byte 4 */
#define CAN_TXMDH1R_DATA5                            ((uint32_t)0x0000FF00) /* Data byte 5 */
#define CAN_TXMDH1R_DATA6                            ((uint32_t)0x00FF0000) /* Data byte 6 */
#define CAN_TXMDH1R_DATA7                            ((uint32_t)0xFF000000) /* Data byte 7 */

/*******************  Bit definition for CAN_TXMI2R register  *******************/
#define CAN_TXMI2R_TXRQ                              ((uint32_t)0x00000001) /* Transmit Mailbox Request */
#define CAN_TXMI2R_RTR                               ((uint32_t)0x00000002) /* Remote Transmission Request */
#define CAN_TXMI2R_IDE                               ((uint32_t)0x00000004) /* Identifier Extension */
#define CAN_TXMI2R_EXID                              ((uint32_t)0x001FFFF8) /* Extended identifier */
#define CAN_TXMI2R_STID                              ((uint32_t)0xFFE00000) /* Standard Identifier or Extended Identifier */

/*******************  Bit definition for CAN_TXMDT2R register  ******************/
#define CAN_TXMDT2R_DLC                              ((uint32_t)0x0000000F) /* Data Length Code */
#define CAN_TXMDT2R_TGT                              ((uint32_t)0x00000100) /* Transmit Global Time */
#define CAN_TXMDT2R_TIME                             ((uint32_t)0xFFFF0000) /* Message Time Stamp */

/*******************  Bit definition for CAN_TXMDL2R register  ******************/
#define CAN_TXMDL2R_DATA0                            ((uint32_t)0x000000FF) /* Data byte 0 */
#define CAN_TXMDL2R_DATA1                            ((uint32_t)0x0000FF00) /* Data byte 1 */
#define CAN_TXMDL2R_DATA2                            ((uint32_t)0x00FF0000) /* Data byte 2 */
#define CAN_TXMDL2R_DATA3                            ((uint32_t)0xFF000000) /* Data byte 3 */

/*******************  Bit definition for CAN_TXMDH2R register  ******************/
#define CAN_TXMDH2R_DATA4                            ((uint32_t)0x000000FF) /* Data byte 4 */
#define CAN_TXMDH2R_DATA5                            ((uint32_t)0x0000FF00) /* Data byte 5 */
#define CAN_TXMDH2R_DATA6                            ((uint32_t)0x00FF0000) /* Data byte 6 */
#define CAN_TXMDH2R_DATA7                            ((uint32_t)0xFF000000) /* Data byte 7 */

/*******************  Bit definition for CAN_RXMI0R register  *******************/
#define CAN_RXMI0R_RTR                               ((uint32_t)0x00000002) /* Remote Transmission Request */
#define CAN_RXMI0R_IDE                               ((uint32_t)0x00000004) /* Identifier Extension */
#define CAN_RXMI0R_EXID                              ((uint32_t)0x001FFFF8) /* Extended Identifier */
#define CAN_RXMI0R_STID                              ((uint32_t)0xFFE00000) /* Standard Identifier or Extended Identifier */

/*******************  Bit definition for CAN_RXMDT0R register  ******************/
#define CAN_RXMDT0R_DLC                              ((uint32_t)0x0000000F) /* Data Length Code */
#define CAN_RXMDT0R_BRS                              ((uint32_t)0x00000010)
#define CAN_RXMDT0R_ESI                              ((uint32_t)0x00000020)
#define CAN_RXMDH0R_RES                              ((uint32_t)0x00000100)
#define CAN_RXMDT0R_TIME                             ((uint32_t)0xFFFF0000) /* Message Time Stamp */

/*******************  Bit definition for CAN_RXMDL0R register  ******************/
#define CAN_RXMDL0R_DATA0                            ((uint32_t)0x000000FF) /* Data byte 0 */
#define CAN_RXMDL0R_DATA1                            ((uint32_t)0x0000FF00) /* Data byte 1 */
#define CAN_RXMDL0R_DATA2                            ((uint32_t)0x00FF0000) /* Data byte 2 */
#define CAN_RXMDL0R_DATA3                            ((uint32_t)0xFF000000) /* Data byte 3 */

/*******************  Bit definition for CAN_RXMDH0R register  ******************/
#define CAN_RXMDH0R_DATA4                            ((uint32_t)0x000000FF) /* Data byte 4 */
#define CAN_RXMDH0R_DATA5                            ((uint32_t)0x0000FF00) /* Data byte 5 */
#define CAN_RXMDH0R_DATA6                            ((uint32_t)0x00FF0000) /* Data byte 6 */
#define CAN_RXMDH0R_DATA7                            ((uint32_t)0xFF000000) /* Data byte 7 */

/*******************  Bit definition for CAN_RXMI1R register  *******************/
#define CAN_RXMI1R_RTR                               ((uint32_t)0x00000002) /* Remote Transmission Request */
#define CAN_RXMI1R_IDE                               ((uint32_t)0x00000004) /* Identifier Extension */
#define CAN_RXMI1R_EXID                              ((uint32_t)0x001FFFF8) /* Extended Identifier */
#define CAN_RXMI1R_STID                              ((uint32_t)0xFFE00000) /* Standard Identifier or Extended Identifier */

/*******************  Bit definition for CAN_RXMDT1R register  ******************/
#define CAN_RXMDT1R_DLC                              ((uint32_t)0x0000000F) /* Data Length Code */
#define CAN_RXMDT1R_BRS                              ((uint32_t)0x00000010)
#define CAN_RXMDT1R_ESI                              ((uint32_t)0x00000020)
#define CAN_RXMDH1R_RES                              ((uint32_t)0x00000100)
#define CAN_RXMDT1R_TIME                             ((uint32_t)0xFFFF0000) /* Message Time Stamp */

