SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
/*******************  Bit definition for CAN_RXMDL1R register  ******************/
#define CAN_RXMDL1R_DATA0                            ((uint32_t)0x000000FF) /* Data byte 0 */
#define CAN_RXMDL1R_DATA1                            ((uint32_t)0x0000FF00) /* Data byte 1 */
#define CAN_RXMDL1R_DATA2                            ((uint32_t)0x00FF0000) /* Data byte 2 */
#define CAN_RXMDL1R_DATA3                            ((uint32_t)0xFF000000) /* Data byte 3 */

/*******************  Bit definition for CAN_RXMDH1R register  ******************/
#define CAN_RXMDH1R_DATA4                            ((uint32_t)0x000000FF) /* Data byte 4 */
#define CAN_RXMDH1R_DATA5                            ((uint32_t)0x0000FF00) /* Data byte 5 */
#define CAN_RXMDH1R_DATA6                            ((uint32_t)0x00FF0000) /* Data byte 6 */
#define CAN_RXMDH1R_DATA7                            ((uint32_t)0xFF000000) /* Data byte 7 */

/*******************  Bit definition for CAN_FCTLR register  *******************/
#define CAN_FCTLR_TINIT                              ((uint32_t)0x00000001)

#define CAN_FCTLR_CAN2SB                             ((uint32_t)0x00001F00)
#define CAN_FCTLR_CAN3SB                             ((uint32_t)0x003F0000)

/******************  Bit definition for CAN_FMCFGR register  ******************/
#define CAN_FMCFGR_FBM0                              ((uint32_t)0x00000001)
#define CAN_FMCFGR_FBM1                              ((uint32_t)0x00000002)
#define CAN_FMCFGR_FBM2                              ((uint32_t)0x00000004)
#define CAN_FMCFGR_FBM3                              ((uint32_t)0x00000008)
#define CAN_FMCFGR_FBM4                              ((uint32_t)0x00000010)
#define CAN_FMCFGR_FBM5                              ((uint32_t)0x00000020)
#define CAN_FMCFGR_FBM6                              ((uint32_t)0x00000040)
#define CAN_FMCFGR_FBM7                              ((uint32_t)0x00000080)
#define CAN_FMCFGR_FBM8                              ((uint32_t)0x00000100)
#define CAN_FMCFGR_FBM9                              ((uint32_t)0x00000200)
#define CAN_FMCFGR_FBM10                             ((uint32_t)0x00000400)
#define CAN_FMCFGR_FBM11                             ((uint32_t)0x00000800)
#define CAN_FMCFGR_FBM12                             ((uint32_t)0x00001000)
#define CAN_FMCFGR_FBM13                             ((uint32_t)0x00002000)
#define CAN_FMCFGR_FBM14                             ((uint32_t)0x00004000)
#define CAN_FMCFGR_FBM15                             ((uint32_t)0x00008000)
#define CAN_FMCFGR_FBM16                             ((uint32_t)0x00010000)
#define CAN_FMCFGR_FBM17                             ((uint32_t)0x00020000)
#define CAN_FMCFGR_FBM18                             ((uint32_t)0x00040000)
#define CAN_FMCFGR_FBM19                             ((uint32_t)0x00080000)
#define CAN_FMCFGR_FBM20                             ((uint32_t)0x00100000)
#define CAN_FMCFGR_FBM21                             ((uint32_t)0x00200000)
#define CAN_FMCFGR_FBM22                             ((uint32_t)0x00400000)
#define CAN_FMCFGR_FBM23                             ((uint32_t)0x00800000)
#define CAN_FMCFGR_FBM24                             ((uint32_t)0x01000000)
#define CAN_FMCFGR_FBM25                             ((uint32_t)0x02000000)
#define CAN_FMCFGR_FBM26                             ((uint32_t)0x04000000)
#define CAN_FMCFGR_FBM27                             ((uint32_t)0x08000000)

/******************  Bit definition for CAN_FMCFGR1 register  ******************/
#define CAN_FMCFGR1_FBM28                            ((uint32_t)0x00000001)
#define CAN_FMCFGR1_FBM29                            ((uint32_t)0x00000002)
#define CAN_FMCFGR1_FBM30                            ((uint32_t)0x00000004)
#define CAN_FMCFGR1_FBM31                            ((uint32_t)0x00000008)
#define CAN_FMCFGR1_FBM32                            ((uint32_t)0x00000010)
#define CAN_FMCFGR1_FBM33                            ((uint32_t)0x00000020)
#define CAN_FMCFGR1_FBM34                            ((uint32_t)0x00000040)
#define CAN_FMCFGR1_FBM35                            ((uint32_t)0x00000080)
#define CAN_FMCFGR1_FBM36                            ((uint32_t)0x00000100)
#define CAN_FMCFGR1_FBM37                            ((uint32_t)0x00000200)
#define CAN_FMCFGR1_FBM38                            ((uint32_t)0x00000400)
#define CAN_FMCFGR1_FBM39                            ((uint32_t)0x00000800)
#define CAN_FMCFGR1_FBM40                            ((uint32_t)0x00001000)
#define CAN_FMCFGR1_FBM41                            ((uint32_t)0x00002000)

/******************  Bit definition for CAN_FSCFGR register  ******************/
#define CAN_FSCFGR_FSC0                              ((uint32_t)0x00000001)
#define CAN_FSCFGR_FSC1                              ((uint32_t)0x00000002)
#define CAN_FSCFGR_FSC2                              ((uint32_t)0x00000004)
#define CAN_FSCFGR_FSC3                              ((uint32_t)0x00000008)
#define CAN_FSCFGR_FSC4                              ((uint32_t)0x00000010)
#define CAN_FSCFGR_FSC5                              ((uint32_t)0x00000020)
#define CAN_FSCFGR_FSC6                              ((uint32_t)0x00000040)
#define CAN_FSCFGR_FSC7                              ((uint32_t)0x00000080)
#define CAN_FSCFGR_FSC8                              ((uint32_t)0x00000100)
#define CAN_FSCFGR_FSC9                              ((uint32_t)0x00000200)
#define CAN_FSCFGR_FSC10                             ((uint32_t)0x00000400)
#define CAN_FSCFGR_FSC11                             ((uint32_t)0x00000800)
#define CAN_FSCFGR_FSC12                             ((uint32_t)0x00001000)
#define CAN_FSCFGR_FSC13                             ((uint32_t)0x00002000)
#define CAN_FSCFGR_FSC14                             ((uint32_t)0x00004000)
#define CAN_FSCFGR_FSC15                             ((uint32_t)0x00008000)
#define CAN_FSCFGR_FSC16                             ((uint32_t)0x00010000)
#define CAN_FSCFGR_FSC17                             ((uint32_t)0x00020000)
#define CAN_FSCFGR_FSC18                             ((uint32_t)0x00040000)
#define CAN_FSCFGR_FSC19                             ((uint32_t)0x00080000)
#define CAN_FSCFGR_FSC20                             ((uint32_t)0x00100000)
#define CAN_FSCFGR_FSC21                             ((uint32_t)0x00200000)
#define CAN_FSCFGR_FSC22                             ((uint32_t)0x00400000)
#define CAN_FSCFGR_FSC23                             ((uint32_t)0x00800000)
#define CAN_FSCFGR_FSC24                             ((uint32_t)0x01000000)
#define CAN_FSCFGR_FSC25                             ((uint32_t)0x02000000)
#define CAN_FSCFGR_FSC26                             ((uint32_t)0x04000000)
#define CAN_FSCFGR_FSC27                             ((uint32_t)0x08000000)

