SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
/******************  Bit definition for CAN_FSCFGR1 register  ******************/
#define CAN_FSCFGR1_FSC28                            ((uint32_t)0x00000001)
#define CAN_FSCFGR1_FSC29                            ((uint32_t)0x00000002)
#define CAN_FSCFGR1_FSC30                            ((uint32_t)0x00000004)
#define CAN_FSCFGR1_FSC31                            ((uint32_t)0x00000008)
#define CAN_FSCFGR1_FSC32                            ((uint32_t)0x00000010)
#define CAN_FSCFGR1_FSC33                            ((uint32_t)0x00000020)
#define CAN_FSCFGR1_FSC34                            ((uint32_t)0x00000040)
#define CAN_FSCFGR1_FSC35                            ((uint32_t)0x00000080)
#define CAN_FSCFGR1_FSC36                            ((uint32_t)0x00000100)
#define CAN_FSCFGR1_FSC37                            ((uint32_t)0x00000200)
#define CAN_FSCFGR1_FSC38                            ((uint32_t)0x00000400)
#define CAN_FSCFGR1_FSC39                            ((uint32_t)0x00000800)
#define CAN_FSCFGR1_FSC40                            ((uint32_t)0x00001000)
#define CAN_FSCFGR1_FSC41                            ((uint32_t)0x00002000)

/******************  Bit definition for CAN_FAFIFOR register  ******************/
#define CAN_FAFIFOR_FFA0                             ((uint32_t)0x00000001)
#define CAN_FAFIFOR_FFA1                             ((uint32_t)0x00000002)
#define CAN_FAFIFOR_FFA2                             ((uint32_t)0x00000004)
#define CAN_FAFIFOR_FFA3                             ((uint32_t)0x00000008)
#define CAN_FAFIFOR_FFA4                             ((uint32_t)0x00000010)
#define CAN_FAFIFOR_FFA5                             ((uint32_t)0x00000020)
#define CAN_FAFIFOR_FFA6                             ((uint32_t)0x00000040)
#define CAN_FAFIFOR_FFA7                             ((uint32_t)0x00000080)
#define CAN_FAFIFOR_FFA8                             ((uint32_t)0x00000100)
#define CAN_FAFIFOR_FFA9                             ((uint32_t)0x00000200)
#define CAN_FAFIFOR_FFA10                            ((uint32_t)0x00000400)
#define CAN_FAFIFOR_FFA11                            ((uint32_t)0x00000800)
#define CAN_FAFIFOR_FFA12                            ((uint32_t)0x00001000)
#define CAN_FAFIFOR_FFA13                            ((uint32_t)0x00002000)
#define CAN_FAFIFOR_FFA14                            ((uint32_t)0x00004000)
#define CAN_FAFIFOR_FFA15                            ((uint32_t)0x00008000)
#define CAN_FAFIFOR_FFA16                            ((uint32_t)0x00010000)
#define CAN_FAFIFOR_FFA17                            ((uint32_t)0x00020000)
#define CAN_FAFIFOR_FFA18                            ((uint32_t)0x00040000)
#define CAN_FAFIFOR_FFA19                            ((uint32_t)0x00080000)
#define CAN_FAFIFOR_FFA20                            ((uint32_t)0x00100000)
#define CAN_FAFIFOR_FFA21                            ((uint32_t)0x00200000)
#define CAN_FAFIFOR_FFA22                            ((uint32_t)0x00400000)
#define CAN_FAFIFOR_FFA23                            ((uint32_t)0x00800000)
#define CAN_FAFIFOR_FFA24                            ((uint32_t)0x01000000)
#define CAN_FAFIFOR_FFA25                            ((uint32_t)0x02000000)
#define CAN_FAFIFOR_FFA26                            ((uint32_t)0x04000000)
#define CAN_FAFIFOR_FFA27                            ((uint32_t)0x08000000)

/******************  Bit definition for CAN_FAFIFOR1 register  ******************/
#define CAN_FAFIFOR1_FFA28                           ((uint32_t)0x00000001)
#define CAN_FAFIFOR1_FFA29                           ((uint32_t)0x00000002)
#define CAN_FAFIFOR1_FFA30                           ((uint32_t)0x00000004)
#define CAN_FAFIFOR1_FFA31                           ((uint32_t)0x00000008)
#define CAN_FAFIFOR1_FFA32                           ((uint32_t)0x00000010)
#define CAN_FAFIFOR1_FFA33                           ((uint32_t)0x00000020)
#define CAN_FAFIFOR1_FFA34                           ((uint32_t)0x00000040)
#define CAN_FAFIFOR1_FFA35                           ((uint32_t)0x00000080)
#define CAN_FAFIFOR1_FFA36                           ((uint32_t)0x00000100)
#define CAN_FAFIFOR1_FFA37                           ((uint32_t)0x00000200)
#define CAN_FAFIFOR1_FFA38                           ((uint32_t)0x00000400)
#define CAN_FAFIFOR1_FFA39                           ((uint32_t)0x00000800)
#define CAN_FAFIFOR1_FFA40                           ((uint32_t)0x00001000)
#define CAN_FAFIFOR1_FFA41                           ((uint32_t)0x00002000)

/********************  Bit definition for CAN_FWR register  ********************/
#define CAN_FWR_FACT0                                ((uint32_t)0x00000001)
#define CAN_FWR_FACT1                                ((uint32_t)0x00000002)
#define CAN_FWR_FACT2                                ((uint32_t)0x00000004)
#define CAN_FWR_FACT3                                ((uint32_t)0x00000008)
#define CAN_FWR_FACT4                                ((uint32_t)0x00000010)
#define CAN_FWR_FACT5                                ((uint32_t)0x00000020)
#define CAN_FWR_FACT6                                ((uint32_t)0x00000040)
#define CAN_FWR_FACT7                                ((uint32_t)0x00000080)
#define CAN_FWR_FACT8                                ((uint32_t)0x00000100)
#define CAN_FWR_FACT9                                ((uint32_t)0x00000200)
#define CAN_FWR_FACT10                               ((uint32_t)0x00000400)
#define CAN_FWR_FACT11                               ((uint32_t)0x00000800)
#define CAN_FWR_FACT12                               ((uint32_t)0x00001000)
#define CAN_FWR_FACT13                               ((uint32_t)0x00002000)
#define CAN_FWR_FACT14                               ((uint32_t)0x00004000)
#define CAN_FWR_FACT15                               ((uint32_t)0x00008000)
#define CAN_FWR_FACT16                               ((uint32_t)0x00010000)
#define CAN_FWR_FACT17                               ((uint32_t)0x00020000)
#define CAN_FWR_FACT18                               ((uint32_t)0x00040000)
#define CAN_FWR_FACT19                               ((uint32_t)0x00080000)
#define CAN_FWR_FACT20                               ((uint32_t)0x00100000)
#define CAN_FWR_FACT21                               ((uint32_t)0x00200000)
#define CAN_FWR_FACT22                               ((uint32_t)0x00400000)
#define CAN_FWR_FACT23                               ((uint32_t)0x00800000)
#define CAN_FWR_FACT24                               ((uint32_t)0x01000000)
#define CAN_FWR_FACT25                               ((uint32_t)0x02000000)
#define CAN_FWR_FACT26                               ((uint32_t)0x04000000)
#define CAN_FWR_FACT27                               ((uint32_t)0x08000000)

/********************  Bit definition for CAN_FWR1 register  ********************/
#define CAN_FWR1_FACT28                              ((uint32_t)0x00000001)
#define CAN_FWR1_FACT29                              ((uint32_t)0x00000002)
#define CAN_FWR1_FACT30                              ((uint32_t)0x00000004)
#define CAN_FWR1_FACT31                              ((uint32_t)0x00000008)
#define CAN_FWR1_FACT32                              ((uint32_t)0x00000010)
#define CAN_FWR1_FACT33                              ((uint32_t)0x00000020)
#define CAN_FWR1_FACT34                              ((uint32_t)0x00000040)
#define CAN_FWR1_FACT35                              ((uint32_t)0x00000080)
#define CAN_FWR1_FACT36                              ((uint32_t)0x00000100)
#define CAN_FWR1_FACT37                              ((uint32_t)0x00000200)
#define CAN_FWR1_FACT38                              ((uint32_t)0x00000400)
#define CAN_FWR1_FACT39                              ((uint32_t)0x00000800)
#define CAN_FWR1_FACT40                              ((uint32_t)0x00001000)
#define CAN_FWR1_FACT41                              ((uint32_t)0x00002000)

/********************  Bit definition for CAN_F0R1 register  ********************/
#define CAN_F0R1_FB0                                 ((uint32_t)0x00000001)
#define CAN_F0R1_FB1                                 ((uint32_t)0x00000002)
#define CAN_F0R1_FB2                                 ((uint32_t)0x00000004)
#define CAN_F0R1_FB3                                 ((uint32_t)0x00000008)
#define CAN_F0R1_FB4                                 ((uint32_t)0x00000010)
#define CAN_F0R1_FB5                                 ((uint32_t)0x00000020)
#define CAN_F0R1_FB6                                 ((uint32_t)0x00000040)
#define CAN_F0R1_FB7                                 ((uint32_t)0x00000080)
#define CAN_F0R1_FB8                                 ((uint32_t)0x00000100)
#define CAN_F0R1_FB9                                 ((uint32_t)0x00000200)
#define CAN_F0R1_FB10                                ((uint32_t)0x00000400)
#define CAN_F0R1_FB11                                ((uint32_t)0x00000800)
#define CAN_F0R1_FB12                                ((uint32_t)0x00001000)
#define CAN_F0R1_FB13                                ((uint32_t)0x00002000)
#define CAN_F0R1_FB14                                ((uint32_t)0x00004000)
#define CAN_F0R1_FB15                                ((uint32_t)0x00008000)
#define CAN_F0R1_FB16                                ((uint32_t)0x00010000)
#define CAN_F0R1_FB17                                ((uint32_t)0x00020000)
#define CAN_F0R1_FB18                                ((uint32_t)0x00040000)
#define CAN_F0R1_FB19                                ((uint32_t)0x00080000)
#define CAN_F0R1_FB20                                ((uint32_t)0x00100000)
#define CAN_F0R1_FB21                                ((uint32_t)0x00200000)
#define CAN_F0R1_FB22                                ((uint32_t)0x00400000)
#define CAN_F0R1_FB23                                ((uint32_t)0x00800000)
#define CAN_F0R1_FB24                                ((uint32_t)0x01000000)
#define CAN_F0R1_FB25                                ((uint32_t)0x02000000)
#define CAN_F0R1_FB26                                ((uint32_t)0x04000000)
#define CAN_F0R1_FB27                                ((uint32_t)0x08000000)
#define CAN_F0R1_FB28                                ((uint32_t)0x10000000)
#define CAN_F0R1_FB29                                ((uint32_t)0x20000000)
#define CAN_F0R1_FB30                                ((uint32_t)0x40000000)
#define CAN_F0R1_FB31                                ((uint32_t)0x80000000)

/********************  Bit definition for CAN_F1R1 register  ********************/
#define CAN_F1R1_FB0                                 ((uint32_t)0x00000001)
#define CAN_F1R1_FB1                                 ((uint32_t)0x00000002)
#define CAN_F1R1_FB2                                 ((uint32_t)0x00000004)
#define CAN_F1R1_FB3                                 ((uint32_t)0x00000008)
#define CAN_F1R1_FB4                                 ((uint32_t)0x00000010)
#define CAN_F1R1_FB5                                 ((uint32_t)0x00000020)
#define CAN_F1R1_FB6                                 ((uint32_t)0x00000040)
#define CAN_F1R1_FB7                                 ((uint32_t)0x00000080)
#define CAN_F1R1_FB8                                 ((uint32_t)0x00000100)
#define CAN_F1R1_FB9                                 ((uint32_t)0x00000200)
#define CAN_F1R1_FB10                                ((uint32_t)0x00000400)
#define CAN_F1R1_FB11                                ((uint32_t)0x00000800)
#define CAN_F1R1_FB12                                ((uint32_t)0x00001000)
#define CAN_F1R1_FB13                                ((uint32_t)0x00002000)
#define CAN_F1R1_FB14                                ((uint32_t)0x00004000)
#define CAN_F1R1_FB15                                ((uint32_t)0x00008000)
#define CAN_F1R1_FB16                                ((uint32_t)0x00010000)
#define CAN_F1R1_FB17                                ((uint32_t)0x00020000)
#define CAN_F1R1_FB18                                ((uint32_t)0x00040000)
#define CAN_F1R1_FB19                                ((uint32_t)0x00080000)
#define CAN_F1R1_FB20                                ((uint32_t)0x00100000)
#define CAN_F1R1_FB21                                ((uint32_t)0x00200000)
#define CAN_F1R1_FB22                                ((uint32_t)0x00400000)
#define CAN_F1R1_FB23                                ((uint32_t)0x00800000)
#define CAN_F1R1_FB24                                ((uint32_t)0x01000000)
#define CAN_F1R1_FB25                                ((uint32_t)0x02000000)
#define CAN_F1R1_FB26                                ((uint32_t)0x04000000)
#define CAN_F1R1_FB27                                ((uint32_t)0x08000000)
#define CAN_F1R1_FB28                                ((uint32_t)0x10000000)
#define CAN_F1R1_FB29                                ((uint32_t)0x20000000)
#define CAN_F1R1_FB30                                ((uint32_t)0x40000000)
#define CAN_F1R1_FB31                                ((uint32_t)0x80000000)

/********************  Bit definition for CAN_F2R1 register  ********************/
#define CAN_F2R1_FB0                                 ((uint32_t)0x00000001)
#define CAN_F2R1_FB1                                 ((uint32_t)0x00000002)
#define CAN_F2R1_FB2                                 ((uint32_t)0x00000004)
#define CAN_F2R1_FB3                                 ((uint32_t)0x00000008)
#define CAN_F2R1_FB4                                 ((uint32_t)0x00000010)
#define CAN_F2R1_FB5                                 ((uint32_t)0x00000020)
#define CAN_F2R1_FB6                                 ((uint32_t)0x00000040)
#define CAN_F2R1_FB7                                 ((uint32_t)0x00000080)
#define CAN_F2R1_FB8                                 ((uint32_t)0x00000100)
#define CAN_F2R1_FB9                                 ((uint32_t)0x00000200)
#define CAN_F2R1_FB10                                ((uint32_t)0x00000400)
#define CAN_F2R1_FB11                                ((uint32_t)0x00000800)
#define CAN_F2R1_FB12                                ((uint32_t)0x00001000)
#define CAN_F2R1_FB13                                ((uint32_t)0x00002000)
#define CAN_F2R1_FB14                                ((uint32_t)0x00004000)
#define CAN_F2R1_FB15                                ((uint32_t)0x00008000)
#define CAN_F2R1_FB16                                ((uint32_t)0x00010000)
#define CAN_F2R1_FB17                                ((uint32_t)0x00020000)
#define CAN_F2R1_FB18                                ((uint32_t)0x00040000)
#define CAN_F2R1_FB19                                ((uint32_t)0x00080000)
#define CAN_F2R1_FB20                                ((uint32_t)0x00100000)
#define CAN_F2R1_FB21                                ((uint32_t)0x00200000)
#define CAN_F2R1_FB22                                ((uint32_t)0x00400000)
#define CAN_F2R1_FB23                                ((uint32_t)0x00800000)
#define CAN_F2R1_FB24                                ((uint32_t)0x01000000)
#define CAN_F2R1_FB25                                ((uint32_t)0x02000000)
#define CAN_F2R1_FB26                                ((uint32_t)0x04000000)
#define CAN_F2R1_FB27                                ((uint32_t)0x08000000)
#define CAN_F2R1_FB28                                ((uint32_t)0x10000000)
#define CAN_F2R1_FB29                                ((uint32_t)0x20000000)
#define CAN_F2R1_FB30                                ((uint32_t)0x40000000)
#define CAN_F2R1_FB31                                ((uint32_t)0x80000000)

/********************  Bit definition for CAN_F3R1 register  ********************/
#define CAN_F3R1_FB0                                 ((uint32_t)0x00000001)
#define CAN_F3R1_FB1                                 ((uint32_t)0x00000002)
#define CAN_F3R1_FB2                                 ((uint32_t)0x00000004)
#define CAN_F3R1_FB3                                 ((uint32_t)0x00000008)
#define CAN_F3R1_FB4                                 ((uint32_t)0x00000010)
#define CAN_F3R1_FB5                                 ((uint32_t)0x00000020)
#define CAN_F3R1_FB6                                 ((uint32_t)0x00000040)
#define CAN_F3R1_FB7                                 ((uint32_t)0x00000080)
#define CAN_F3R1_FB8                                 ((uint32_t)0x00000100)
#define CAN_F3R1_FB9                                 ((uint32_t)0x00000200)
#define CAN_F3R1_FB10                                ((uint32_t)0x00000400)
#define CAN_F3R1_FB11                                ((uint32_t)0x00000800)
#define CAN_F3R1_FB12                                ((uint32_t)0x00001000)
#define CAN_F3R1_FB13                                ((uint32_t)0x00002000)
#define CAN_F3R1_FB14                                ((uint32_t)0x00004000)
#define CAN_F3R1_FB15                                ((uint32_t)0x00008000)
#define CAN_F3R1_FB16                                ((uint32_t)0x00010000)
#define CAN_F3R1_FB17                                ((uint32_t)0x00020000)
#define CAN_F3R1_FB18                                ((uint32_t)0x00040000)
#define CAN_F3R1_FB19                                ((uint32_t)0x00080000)
#define CAN_F3R1_FB20                                ((uint32_t)0x00100000)
#define CAN_F3R1_FB21                                ((uint32_t)0x00200000)
#define CAN_F3R1_FB22                                ((uint32_t)0x00400000)
#define CAN_F3R1_FB23                                ((uint32_t)0x00800000)
#define CAN_F3R1_FB24                                ((uint32_t)0x01000000)
#define CAN_F3R1_FB25                                ((uint32_t)0x02000000)
#define CAN_F3R1_FB26                                ((uint32_t)0x04000000)
#define CAN_F3R1_FB27                                ((uint32_t)0x08000000)
#define CAN_F3R1_FB28                                ((uint32_t)0x10000000)
#define CAN_F3R1_FB29                                ((uint32_t)0x20000000)
#define CAN_F3R1_FB30                                ((uint32_t)0x40000000)
#define CAN_F3R1_FB31                                ((uint32_t)0x80000000)

