SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
/********************  Bit definition for CAN_F4R1 register  ********************/
#define CAN_F4R1_FB0                                 ((uint32_t)0x00000001)
#define CAN_F4R1_FB1                                 ((uint32_t)0x00000002)
#define CAN_F4R1_FB2                                 ((uint32_t)0x00000004)
#define CAN_F4R1_FB3                                 ((uint32_t)0x00000008)
#define CAN_F4R1_FB4                                 ((uint32_t)0x00000010)
#define CAN_F4R1_FB5                                 ((uint32_t)0x00000020)
#define CAN_F4R1_FB6                                 ((uint32_t)0x00000040)
#define CAN_F4R1_FB7                                 ((uint32_t)0x00000080)
#define CAN_F4R1_FB8                                 ((uint32_t)0x00000100)
#define CAN_F4R1_FB9                                 ((uint32_t)0x00000200)
#define CAN_F4R1_FB10                                ((uint32_t)0x00000400)
#define CAN_F4R1_FB11                                ((uint32_t)0x00000800)
#define CAN_F4R1_FB12                                ((uint32_t)0x00001000)
#define CAN_F4R1_FB13                                ((uint32_t)0x00002000)
#define CAN_F4R1_FB14                                ((uint32_t)0x00004000)
#define CAN_F4R1_FB15                                ((uint32_t)0x00008000)
#define CAN_F4R1_FB16                                ((uint32_t)0x00010000)
#define CAN_F4R1_FB17                                ((uint32_t)0x00020000)
#define CAN_F4R1_FB18                                ((uint32_t)0x00040000)
#define CAN_F4R1_FB19                                ((uint32_t)0x00080000)
#define CAN_F4R1_FB20                                ((uint32_t)0x00100000)
#define CAN_F4R1_FB21                                ((uint32_t)0x00200000)
#define CAN_F4R1_FB22                                ((uint32_t)0x00400000)
#define CAN_F4R1_FB23                                ((uint32_t)0x00800000)
#define CAN_F4R1_FB24                                ((uint32_t)0x01000000)
#define CAN_F4R1_FB25                                ((uint32_t)0x02000000)
#define CAN_F4R1_FB26                                ((uint32_t)0x04000000)
#define CAN_F4R1_FB27                                ((uint32_t)0x08000000)
#define CAN_F4R1_FB28                                ((uint32_t)0x10000000)
#define CAN_F4R1_FB29                                ((uint32_t)0x20000000)
#define CAN_F4R1_FB30                                ((uint32_t)0x40000000)
#define CAN_F4R1_FB31                                ((uint32_t)0x80000000)

/********************  Bit definition for CAN_F5R1 register  ********************/
#define CAN_F5R1_FB0                                 ((uint32_t)0x00000001)
#define CAN_F5R1_FB1                                 ((uint32_t)0x00000002)
#define CAN_F5R1_FB2                                 ((uint32_t)0x00000004)
#define CAN_F5R1_FB3                                 ((uint32_t)0x00000008)
#define CAN_F5R1_FB4                                 ((uint32_t)0x00000010)
#define CAN_F5R1_FB5                                 ((uint32_t)0x00000020)
#define CAN_F5R1_FB6                                 ((uint32_t)0x00000040)
#define CAN_F5R1_FB7                                 ((uint32_t)0x00000080)
#define CAN_F5R1_FB8                                 ((uint32_t)0x00000100)
#define CAN_F5R1_FB9                                 ((uint32_t)0x00000200)
#define CAN_F5R1_FB10                                ((uint32_t)0x00000400)
#define CAN_F5R1_FB11                                ((uint32_t)0x00000800)
#define CAN_F5R1_FB12                                ((uint32_t)0x00001000)
#define CAN_F5R1_FB13                                ((uint32_t)0x00002000)
#define CAN_F5R1_FB14                                ((uint32_t)0x00004000)
#define CAN_F5R1_FB15                                ((uint32_t)0x00008000)
#define CAN_F5R1_FB16                                ((uint32_t)0x00010000)
#define CAN_F5R1_FB17                                ((uint32_t)0x00020000)
#define CAN_F5R1_FB18                                ((uint32_t)0x00040000)
#define CAN_F5R1_FB19                                ((uint32_t)0x00080000)
#define CAN_F5R1_FB20                                ((uint32_t)0x00100000)
#define CAN_F5R1_FB21                                ((uint32_t)0x00200000)
#define CAN_F5R1_FB22                                ((uint32_t)0x00400000)
#define CAN_F5R1_FB23                                ((uint32_t)0x00800000)
#define CAN_F5R1_FB24                                ((uint32_t)0x01000000)
#define CAN_F5R1_FB25                                ((uint32_t)0x02000000)
#define CAN_F5R1_FB26                                ((uint32_t)0x04000000)
#define CAN_F5R1_FB27                                ((uint32_t)0x08000000)
#define CAN_F5R1_FB28                                ((uint32_t)0x10000000)
#define CAN_F5R1_FB29                                ((uint32_t)0x20000000)
#define CAN_F5R1_FB30                                ((uint32_t)0x40000000)
#define CAN_F5R1_FB31                                ((uint32_t)0x80000000)

/********************  Bit definition for CAN_F6R1 register  ********************/
#define CAN_F6R1_FB0                                 ((uint32_t)0x00000001)
#define CAN_F6R1_FB1                                 ((uint32_t)0x00000002)
#define CAN_F6R1_FB2                                 ((uint32_t)0x00000004)
#define CAN_F6R1_FB3                                 ((uint32_t)0x00000008)
#define CAN_F6R1_FB4                                 ((uint32_t)0x00000010)
#define CAN_F6R1_FB5                                 ((uint32_t)0x00000020)
#define CAN_F6R1_FB6                                 ((uint32_t)0x00000040)
#define CAN_F6R1_FB7                                 ((uint32_t)0x00000080)
#define CAN_F6R1_FB8                                 ((uint32_t)0x00000100)
#define CAN_F6R1_FB9                                 ((uint32_t)0x00000200)
#define CAN_F6R1_FB10                                ((uint32_t)0x00000400)
#define CAN_F6R1_FB11                                ((uint32_t)0x00000800)
#define CAN_F6R1_FB12                                ((uint32_t)0x00001000)
#define CAN_F6R1_FB13                                ((uint32_t)0x00002000)
#define CAN_F6R1_FB14                                ((uint32_t)0x00004000)
#define CAN_F6R1_FB15                                ((uint32_t)0x00008000)
#define CAN_F6R1_FB16                                ((uint32_t)0x00010000)
#define CAN_F6R1_FB17                                ((uint32_t)0x00020000)
#define CAN_F6R1_FB18                                ((uint32_t)0x00040000)
#define CAN_F6R1_FB19                                ((uint32_t)0x00080000)
#define CAN_F6R1_FB20                                ((uint32_t)0x00100000)
#define CAN_F6R1_FB21                                ((uint32_t)0x00200000)
#define CAN_F6R1_FB22                                ((uint32_t)0x00400000)
#define CAN_F6R1_FB23                                ((uint32_t)0x00800000)
#define CAN_F6R1_FB24                                ((uint32_t)0x01000000)
#define CAN_F6R1_FB25                                ((uint32_t)0x02000000)
#define CAN_F6R1_FB26                                ((uint32_t)0x04000000)
#define CAN_F6R1_FB27                                ((uint32_t)0x08000000)
#define CAN_F6R1_FB28                                ((uint32_t)0x10000000)
#define CAN_F6R1_FB29                                ((uint32_t)0x20000000)
#define CAN_F6R1_FB30                                ((uint32_t)0x40000000)
#define CAN_F6R1_FB31                                ((uint32_t)0x80000000)

/********************  Bit definition for CAN_F7R1 register  ********************/
#define CAN_F7R1_FB0                                 ((uint32_t)0x00000001)
#define CAN_F7R1_FB1                                 ((uint32_t)0x00000002)
#define CAN_F7R1_FB2                                 ((uint32_t)0x00000004)
#define CAN_F7R1_FB3                                 ((uint32_t)0x00000008)
#define CAN_F7R1_FB4                                 ((uint32_t)0x00000010)
#define CAN_F7R1_FB5                                 ((uint32_t)0x00000020)
#define CAN_F7R1_FB6                                 ((uint32_t)0x00000040)
#define CAN_F7R1_FB7                                 ((uint32_t)0x00000080)
#define CAN_F7R1_FB8                                 ((uint32_t)0x00000100)
#define CAN_F7R1_FB9                                 ((uint32_t)0x00000200)
#define CAN_F7R1_FB10                                ((uint32_t)0x00000400)
#define CAN_F7R1_FB11                                ((uint32_t)0x00000800)
#define CAN_F7R1_FB12                                ((uint32_t)0x00001000)
#define CAN_F7R1_FB13                                ((uint32_t)0x00002000)
#define CAN_F7R1_FB14                                ((uint32_t)0x00004000)
#define CAN_F7R1_FB15                                ((uint32_t)0x00008000)
#define CAN_F7R1_FB16                                ((uint32_t)0x00010000)
#define CAN_F7R1_FB17                                ((uint32_t)0x00020000)
#define CAN_F7R1_FB18                                ((uint32_t)0x00040000)
#define CAN_F7R1_FB19                                ((uint32_t)0x00080000)
#define CAN_F7R1_FB20                                ((uint32_t)0x00100000)
#define CAN_F7R1_FB21                                ((uint32_t)0x00200000)
#define CAN_F7R1_FB22                                ((uint32_t)0x00400000)
#define CAN_F7R1_FB23                                ((uint32_t)0x00800000)
#define CAN_F7R1_FB24                                ((uint32_t)0x01000000)
#define CAN_F7R1_FB25                                ((uint32_t)0x02000000)
#define CAN_F7R1_FB26                                ((uint32_t)0x04000000)
#define CAN_F7R1_FB27                                ((uint32_t)0x08000000)
#define CAN_F7R1_FB28                                ((uint32_t)0x10000000)
#define CAN_F7R1_FB29                                ((uint32_t)0x20000000)
#define CAN_F7R1_FB30                                ((uint32_t)0x40000000)
#define CAN_F7R1_FB31                                ((uint32_t)0x80000000)

/********************  Bit definition for CAN_F8R1 register  ********************/
#define CAN_F8R1_FB0                                 ((uint32_t)0x00000001)
#define CAN_F8R1_FB1                                 ((uint32_t)0x00000002)
#define CAN_F8R1_FB2                                 ((uint32_t)0x00000004)
#define CAN_F8R1_FB3                                 ((uint32_t)0x00000008)
#define CAN_F8R1_FB4                                 ((uint32_t)0x00000010)
#define CAN_F8R1_FB5                                 ((uint32_t)0x00000020)
#define CAN_F8R1_FB6                                 ((uint32_t)0x00000040)
#define CAN_F8R1_FB7                                 ((uint32_t)0x00000080)
#define CAN_F8R1_FB8                                 ((uint32_t)0x00000100)
#define CAN_F8R1_FB9                                 ((uint32_t)0x00000200)
#define CAN_F8R1_FB10                                ((uint32_t)0x00000400)
#define CAN_F8R1_FB11                                ((uint32_t)0x00000800)
#define CAN_F8R1_FB12                                ((uint32_t)0x00001000)
#define CAN_F8R1_FB13                                ((uint32_t)0x00002000)
#define CAN_F8R1_FB14                                ((uint32_t)0x00004000)
#define CAN_F8R1_FB15                                ((uint32_t)0x00008000)
#define CAN_F8R1_FB16                                ((uint32_t)0x00010000)
#define CAN_F8R1_FB17                                ((uint32_t)0x00020000)
#define CAN_F8R1_FB18                                ((uint32_t)0x00040000)
#define CAN_F8R1_FB19                                ((uint32_t)0x00080000)
#define CAN_F8R1_FB20                                ((uint32_t)0x00100000)
#define CAN_F8R1_FB21                                ((uint32_t)0x00200000)
#define CAN_F8R1_FB22                                ((uint32_t)0x00400000)
#define CAN_F8R1_FB23                                ((uint32_t)0x00800000)
#define CAN_F8R1_FB24                                ((uint32_t)0x01000000)
#define CAN_F8R1_FB25                                ((uint32_t)0x02000000)
#define CAN_F8R1_FB26                                ((uint32_t)0x04000000)
#define CAN_F8R1_FB27                                ((uint32_t)0x08000000)
#define CAN_F8R1_FB28                                ((uint32_t)0x10000000)
#define CAN_F8R1_FB29                                ((uint32_t)0x20000000)
#define CAN_F8R1_FB30                                ((uint32_t)0x40000000)
#define CAN_F8R1_FB31                                ((uint32_t)0x80000000)

/********************  Bit definition for CAN_F9R1 register  ********************/
#define CAN_F9R1_FB0                                 ((uint32_t)0x00000001)
#define CAN_F9R1_FB1                                 ((uint32_t)0x00000002)
#define CAN_F9R1_FB2                                 ((uint32_t)0x00000004)
#define CAN_F9R1_FB3                                 ((uint32_t)0x00000008)
#define CAN_F9R1_FB4                                 ((uint32_t)0x00000010)
#define CAN_F9R1_FB5                                 ((uint32_t)0x00000020)
#define CAN_F9R1_FB6                                 ((uint32_t)0x00000040)
#define CAN_F9R1_FB7                                 ((uint32_t)0x00000080)
#define CAN_F9R1_FB8                                 ((uint32_t)0x00000100)
#define CAN_F9R1_FB9                                 ((uint32_t)0x00000200)
#define CAN_F9R1_FB10                                ((uint32_t)0x00000400)
#define CAN_F9R1_FB11                                ((uint32_t)0x00000800)
#define CAN_F9R1_FB12                                ((uint32_t)0x00001000)
#define CAN_F9R1_FB13                                ((uint32_t)0x00002000)
#define CAN_F9R1_FB14                                ((uint32_t)0x00004000)
#define CAN_F9R1_FB15                                ((uint32_t)0x00008000)
#define CAN_F9R1_FB16                                ((uint32_t)0x00010000)
#define CAN_F9R1_FB17                                ((uint32_t)0x00020000)
#define CAN_F9R1_FB18                                ((uint32_t)0x00040000)
#define CAN_F9R1_FB19                                ((uint32_t)0x00080000)
#define CAN_F9R1_FB20                                ((uint32_t)0x00100000)
#define CAN_F9R1_FB21                                ((uint32_t)0x00200000)
#define CAN_F9R1_FB22                                ((uint32_t)0x00400000)
#define CAN_F9R1_FB23                                ((uint32_t)0x00800000)
#define CAN_F9R1_FB24                                ((uint32_t)0x01000000)
#define CAN_F9R1_FB25                                ((uint32_t)0x02000000)
#define CAN_F9R1_FB26                                ((uint32_t)0x04000000)
#define CAN_F9R1_FB27                                ((uint32_t)0x08000000)
#define CAN_F9R1_FB28                                ((uint32_t)0x10000000)
#define CAN_F9R1_FB29                                ((uint32_t)0x20000000)
#define CAN_F9R1_FB30                                ((uint32_t)0x40000000)
#define CAN_F9R1_FB31                                ((uint32_t)0x80000000)

/********************  Bit definition for CAN_F10R1 register  ********************/
#define CAN_F10R1_FB0                                ((uint32_t)0x00000001)
#define CAN_F10R1_FB1                                ((uint32_t)0x00000002)
#define CAN_F10R1_FB2                                ((uint32_t)0x00000004)
#define CAN_F10R1_FB3                                ((uint32_t)0x00000008)
#define CAN_F10R1_FB4                                ((uint32_t)0x00000010)
#define CAN_F10R1_FB5                                ((uint32_t)0x00000020)
#define CAN_F10R1_FB6                                ((uint32_t)0x00000040)
#define CAN_F10R1_FB7                                ((uint32_t)0x00000080)
#define CAN_F10R1_FB8                                ((uint32_t)0x00000100)
#define CAN_F10R1_FB9                                ((uint32_t)0x00000200)
#define CAN_F10R1_FB10                               ((uint32_t)0x00000400)
#define CAN_F10R1_FB11                               ((uint32_t)0x00000800)
#define CAN_F10R1_FB12                               ((uint32_t)0x00001000)
#define CAN_F10R1_FB13                               ((uint32_t)0x00002000)
#define CAN_F10R1_FB14                               ((uint32_t)0x00004000)
#define CAN_F10R1_FB15                               ((uint32_t)0x00008000)
#define CAN_F10R1_FB16                               ((uint32_t)0x00010000)
#define CAN_F10R1_FB17                               ((uint32_t)0x00020000)
#define CAN_F10R1_FB18                               ((uint32_t)0x00040000)
#define CAN_F10R1_FB19                               ((uint32_t)0x00080000)
#define CAN_F10R1_FB20                               ((uint32_t)0x00100000)
#define CAN_F10R1_FB21                               ((uint32_t)0x00200000)
#define CAN_F10R1_FB22                               ((uint32_t)0x00400000)
#define CAN_F10R1_FB23                               ((uint32_t)0x00800000)
#define CAN_F10R1_FB24                               ((uint32_t)0x01000000)
#define CAN_F10R1_FB25                               ((uint32_t)0x02000000)
#define CAN_F10R1_FB26                               ((uint32_t)0x04000000)
#define CAN_F10R1_FB27                               ((uint32_t)0x08000000)
#define CAN_F10R1_FB28                               ((uint32_t)0x10000000)
#define CAN_F10R1_FB29                               ((uint32_t)0x20000000)
#define CAN_F10R1_FB30                               ((uint32_t)0x40000000)
#define CAN_F10R1_FB31                               ((uint32_t)0x80000000)

/********************  Bit definition for CAN_F11R1 register  ********************/
#define CAN_F11R1_FB0                                ((uint32_t)0x00000001)
#define CAN_F11R1_FB1                                ((uint32_t)0x00000002)
#define CAN_F11R1_FB2                                ((uint32_t)0x00000004)
#define CAN_F11R1_FB3                                ((uint32_t)0x00000008)
#define CAN_F11R1_FB4                                ((uint32_t)0x00000010)
#define CAN_F11R1_FB5                                ((uint32_t)0x00000020)
#define CAN_F11R1_FB6                                ((uint32_t)0x00000040)
#define CAN_F11R1_FB7                                ((uint32_t)0x00000080)
#define CAN_F11R1_FB8                                ((uint32_t)0x00000100)
#define CAN_F11R1_FB9                                ((uint32_t)0x00000200)
#define CAN_F11R1_FB10                               ((uint32_t)0x00000400)
#define CAN_F11R1_FB11                               ((uint32_t)0x00000800)
#define CAN_F11R1_FB12                               ((uint32_t)0x00001000)
#define CAN_F11R1_FB13                               ((uint32_t)0x00002000)
#define CAN_F11R1_FB14                               ((uint32_t)0x00004000)
#define CAN_F11R1_FB15                               ((uint32_t)0x00008000)
#define CAN_F11R1_FB16                               ((uint32_t)0x00010000)
#define CAN_F11R1_FB17                               ((uint32_t)0x00020000)
#define CAN_F11R1_FB18                               ((uint32_t)0x00040000)
#define CAN_F11R1_FB19                               ((uint32_t)0x00080000)
#define CAN_F11R1_FB20                               ((uint32_t)0x00100000)
#define CAN_F11R1_FB21                               ((uint32_t)0x00200000)
#define CAN_F11R1_FB22                               ((uint32_t)0x00400000)
#define CAN_F11R1_FB23                               ((uint32_t)0x00800000)
#define CAN_F11R1_FB24                               ((uint32_t)0x01000000)
#define CAN_F11R1_FB25                               ((uint32_t)0x02000000)
#define CAN_F11R1_FB26                               ((uint32_t)0x04000000)
#define CAN_F11R1_FB27                               ((uint32_t)0x08000000)
#define CAN_F11R1_FB28                               ((uint32_t)0x10000000)
#define CAN_F11R1_FB29                               ((uint32_t)0x20000000)
#define CAN_F11R1_FB30                               ((uint32_t)0x40000000)
#define CAN_F11R1_FB31                               ((uint32_t)0x80000000)

/********************  Bit definition for CAN_F12R1 register  ********************/
#define CAN_F12R1_FB0                                ((uint32_t)0x00000001)
#define CAN_F12R1_FB1                                ((uint32_t)0x00000002)
#define CAN_F12R1_FB2                                ((uint32_t)0x00000004)
#define CAN_F12R1_FB3                                ((uint32_t)0x00000008)
#define CAN_F12R1_FB4                                ((uint32_t)0x00000010)
#define CAN_F12R1_FB5                                ((uint32_t)0x00000020)
#define CAN_F12R1_FB6                                ((uint32_t)0x00000040)
#define CAN_F12R1_FB7                                ((uint32_t)0x00000080)
#define CAN_F12R1_FB8                                ((uint32_t)0x00000100)
#define CAN_F12R1_FB9                                ((uint32_t)0x00000200)
#define CAN_F12R1_FB10                               ((uint32_t)0x00000400)
#define CAN_F12R1_FB11                               ((uint32_t)0x00000800)
#define CAN_F12R1_FB12                               ((uint32_t)0x00001000)
#define CAN_F12R1_FB13                               ((uint32_t)0x00002000)
#define CAN_F12R1_FB14                               ((uint32_t)0x00004000)
#define CAN_F12R1_FB15                               ((uint32_t)0x00008000)
#define CAN_F12R1_FB16                               ((uint32_t)0x00010000)
#define CAN_F12R1_FB17                               ((uint32_t)0x00020000)
#define CAN_F12R1_FB18                               ((uint32_t)0x00040000)
#define CAN_F12R1_FB19                               ((uint32_t)0x00080000)
#define CAN_F12R1_FB20                               ((uint32_t)0x00100000)
#define CAN_F12R1_FB21                               ((uint32_t)0x00200000)
#define CAN_F12R1_FB22                               ((uint32_t)0x00400000)
#define CAN_F12R1_FB23                               ((uint32_t)0x00800000)
#define CAN_F12R1_FB24                               ((uint32_t)0x01000000)
#define CAN_F12R1_FB25                               ((uint32_t)0x02000000)
#define CAN_F12R1_FB26                               ((uint32_t)0x04000000)
#define CAN_F12R1_FB27                               ((uint32_t)0x08000000)
#define CAN_F12R1_FB28                               ((uint32_t)0x10000000)
#define CAN_F12R1_FB29                               ((uint32_t)0x20000000)
#define CAN_F12R1_FB30                               ((uint32_t)0x40000000)
#define CAN_F12R1_FB31                               ((uint32_t)0x80000000)

