SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
/********************  Bit definition for CAN_F6R2 register  ********************/
#define CAN_F6R2_FB0                                 ((uint32_t)0x00000001)
#define CAN_F6R2_FB1                                 ((uint32_t)0x00000002)
#define CAN_F6R2_FB2                                 ((uint32_t)0x00000004)
#define CAN_F6R2_FB3                                 ((uint32_t)0x00000008)
#define CAN_F6R2_FB4                                 ((uint32_t)0x00000010)
#define CAN_F6R2_FB5                                 ((uint32_t)0x00000020)
#define CAN_F6R2_FB6                                 ((uint32_t)0x00000040)
#define CAN_F6R2_FB7                                 ((uint32_t)0x00000080)
#define CAN_F6R2_FB8                                 ((uint32_t)0x00000100)
#define CAN_F6R2_FB9                                 ((uint32_t)0x00000200)
#define CAN_F6R2_FB10                                ((uint32_t)0x00000400)
#define CAN_F6R2_FB11                                ((uint32_t)0x00000800)
#define CAN_F6R2_FB12                                ((uint32_t)0x00001000)
#define CAN_F6R2_FB13                                ((uint32_t)0x00002000)
#define CAN_F6R2_FB14                                ((uint32_t)0x00004000)
#define CAN_F6R2_FB15                                ((uint32_t)0x00008000)
#define CAN_F6R2_FB16                                ((uint32_t)0x00010000)
#define CAN_F6R2_FB17                                ((uint32_t)0x00020000)
#define CAN_F6R2_FB18                                ((uint32_t)0x00040000)
#define CAN_F6R2_FB19                                ((uint32_t)0x00080000)
#define CAN_F6R2_FB20                                ((uint32_t)0x00100000)
#define CAN_F6R2_FB21                                ((uint32_t)0x00200000)
#define CAN_F6R2_FB22                                ((uint32_t)0x00400000)
#define CAN_F6R2_FB23                                ((uint32_t)0x00800000)
#define CAN_F6R2_FB24                                ((uint32_t)0x01000000)
#define CAN_F6R2_FB25                                ((uint32_t)0x02000000)
#define CAN_F6R2_FB26                                ((uint32_t)0x04000000)
#define CAN_F6R2_FB27                                ((uint32_t)0x08000000)
#define CAN_F6R2_FB28                                ((uint32_t)0x10000000)
#define CAN_F6R2_FB29                                ((uint32_t)0x20000000)
#define CAN_F6R2_FB30                                ((uint32_t)0x40000000)
#define CAN_F6R2_FB31                                ((uint32_t)0x80000000)

/********************  Bit definition for CAN_F7R2 register  ********************/
#define CAN_F7R2_FB0                                 ((uint32_t)0x00000001)
#define CAN_F7R2_FB1                                 ((uint32_t)0x00000002)
#define CAN_F7R2_FB2                                 ((uint32_t)0x00000004)
#define CAN_F7R2_FB3                                 ((uint32_t)0x00000008)
#define CAN_F7R2_FB4                                 ((uint32_t)0x00000010)
#define CAN_F7R2_FB5                                 ((uint32_t)0x00000020)
#define CAN_F7R2_FB6                                 ((uint32_t)0x00000040)
#define CAN_F7R2_FB7                                 ((uint32_t)0x00000080)
#define CAN_F7R2_FB8                                 ((uint32_t)0x00000100)
#define CAN_F7R2_FB9                                 ((uint32_t)0x00000200)
#define CAN_F7R2_FB10                                ((uint32_t)0x00000400)
#define CAN_F7R2_FB11                                ((uint32_t)0x00000800)
#define CAN_F7R2_FB12                                ((uint32_t)0x00001000)
#define CAN_F7R2_FB13                                ((uint32_t)0x00002000)
#define CAN_F7R2_FB14                                ((uint32_t)0x00004000)
#define CAN_F7R2_FB15                                ((uint32_t)0x00008000)
#define CAN_F7R2_FB16                                ((uint32_t)0x00010000)
#define CAN_F7R2_FB17                                ((uint32_t)0x00020000)
#define CAN_F7R2_FB18                                ((uint32_t)0x00040000)
#define CAN_F7R2_FB19                                ((uint32_t)0x00080000)
#define CAN_F7R2_FB20                                ((uint32_t)0x00100000)
#define CAN_F7R2_FB21                                ((uint32_t)0x00200000)
#define CAN_F7R2_FB22                                ((uint32_t)0x00400000)
#define CAN_F7R2_FB23                                ((uint32_t)0x00800000)
#define CAN_F7R2_FB24                                ((uint32_t)0x01000000)
#define CAN_F7R2_FB25                                ((uint32_t)0x02000000)
#define CAN_F7R2_FB26                                ((uint32_t)0x04000000)
#define CAN_F7R2_FB27                                ((uint32_t)0x08000000)
#define CAN_F7R2_FB28                                ((uint32_t)0x10000000)
#define CAN_F7R2_FB29                                ((uint32_t)0x20000000)
#define CAN_F7R2_FB30                                ((uint32_t)0x40000000)
#define CAN_F7R2_FB31                                ((uint32_t)0x80000000)

/********************  Bit definition for CAN_F8R2 register  ********************/
#define CAN_F8R2_FB0                                 ((uint32_t)0x00000001)
#define CAN_F8R2_FB1                                 ((uint32_t)0x00000002)
#define CAN_F8R2_FB2                                 ((uint32_t)0x00000004)
#define CAN_F8R2_FB3                                 ((uint32_t)0x00000008)
#define CAN_F8R2_FB4                                 ((uint32_t)0x00000010)
#define CAN_F8R2_FB5                                 ((uint32_t)0x00000020)
#define CAN_F8R2_FB6                                 ((uint32_t)0x00000040)
#define CAN_F8R2_FB7                                 ((uint32_t)0x00000080)
#define CAN_F8R2_FB8                                 ((uint32_t)0x00000100)
#define CAN_F8R2_FB9                                 ((uint32_t)0x00000200)
#define CAN_F8R2_FB10                                ((uint32_t)0x00000400)
#define CAN_F8R2_FB11                                ((uint32_t)0x00000800)
#define CAN_F8R2_FB12                                ((uint32_t)0x00001000)
#define CAN_F8R2_FB13                                ((uint32_t)0x00002000)
#define CAN_F8R2_FB14                                ((uint32_t)0x00004000)
#define CAN_F8R2_FB15                                ((uint32_t)0x00008000)
#define CAN_F8R2_FB16                                ((uint32_t)0x00010000)
#define CAN_F8R2_FB17                                ((uint32_t)0x00020000)
#define CAN_F8R2_FB18                                ((uint32_t)0x00040000)
#define CAN_F8R2_FB19                                ((uint32_t)0x00080000)
#define CAN_F8R2_FB20                                ((uint32_t)0x00100000)
#define CAN_F8R2_FB21                                ((uint32_t)0x00200000)
#define CAN_F8R2_FB22                                ((uint32_t)0x00400000)
#define CAN_F8R2_FB23                                ((uint32_t)0x00800000)
#define CAN_F8R2_FB24                                ((uint32_t)0x01000000)
#define CAN_F8R2_FB25                                ((uint32_t)0x02000000)
#define CAN_F8R2_FB26                                ((uint32_t)0x04000000)
#define CAN_F8R2_FB27                                ((uint32_t)0x08000000)
#define CAN_F8R2_FB28                                ((uint32_t)0x10000000)
#define CAN_F8R2_FB29                                ((uint32_t)0x20000000)
#define CAN_F8R2_FB30                                ((uint32_t)0x40000000)
#define CAN_F8R2_FB31                                ((uint32_t)0x80000000)

/********************  Bit definition for CAN_F9R2 register  ********************/
#define CAN_F9R2_FB0                                 ((uint32_t)0x00000001)
#define CAN_F9R2_FB1                                 ((uint32_t)0x00000002)
#define CAN_F9R2_FB2                                 ((uint32_t)0x00000004)
#define CAN_F9R2_FB3                                 ((uint32_t)0x00000008)
#define CAN_F9R2_FB4                                 ((uint32_t)0x00000010)
#define CAN_F9R2_FB5                                 ((uint32_t)0x00000020)
#define CAN_F9R2_FB6                                 ((uint32_t)0x00000040)
#define CAN_F9R2_FB7                                 ((uint32_t)0x00000080)
#define CAN_F9R2_FB8                                 ((uint32_t)0x00000100)
#define CAN_F9R2_FB9                                 ((uint32_t)0x00000200)
#define CAN_F9R2_FB10                                ((uint32_t)0x00000400)
#define CAN_F9R2_FB11                                ((uint32_t)0x00000800)
#define CAN_F9R2_FB12                                ((uint32_t)0x00001000)
#define CAN_F9R2_FB13                                ((uint32_t)0x00002000)
#define CAN_F9R2_FB14                                ((uint32_t)0x00004000)
#define CAN_F9R2_FB15                                ((uint32_t)0x00008000)
#define CAN_F9R2_FB16                                ((uint32_t)0x00010000)
#define CAN_F9R2_FB17                                ((uint32_t)0x00020000)
#define CAN_F9R2_FB18                                ((uint32_t)0x00040000)
#define CAN_F9R2_FB19                                ((uint32_t)0x00080000)
#define CAN_F9R2_FB20                                ((uint32_t)0x00100000)
#define CAN_F9R2_FB21                                ((uint32_t)0x00200000)
#define CAN_F9R2_FB22                                ((uint32_t)0x00400000)
#define CAN_F9R2_FB23                                ((uint32_t)0x00800000)
#define CAN_F9R2_FB24                                ((uint32_t)0x01000000)
#define CAN_F9R2_FB25                                ((uint32_t)0x02000000)
#define CAN_F9R2_FB26                                ((uint32_t)0x04000000)
#define CAN_F9R2_FB27                                ((uint32_t)0x08000000)
#define CAN_F9R2_FB28                                ((uint32_t)0x10000000)
#define CAN_F9R2_FB29                                ((uint32_t)0x20000000)
#define CAN_F9R2_FB30                                ((uint32_t)0x40000000)
#define CAN_F9R2_FB31                                ((uint32_t)0x80000000)

/********************  Bit definition for CAN_F10R2 register  ********************/
#define CAN_F10R2_FB0                                ((uint32_t)0x00000001)
#define CAN_F10R2_FB1                                ((uint32_t)0x00000002)
#define CAN_F10R2_FB2                                ((uint32_t)0x00000004)
#define CAN_F10R2_FB3                                ((uint32_t)0x00000008)
#define CAN_F10R2_FB4                                ((uint32_t)0x00000010)
#define CAN_F10R2_FB5                                ((uint32_t)0x00000020)
#define CAN_F10R2_FB6                                ((uint32_t)0x00000040)
#define CAN_F10R2_FB7                                ((uint32_t)0x00000080)
#define CAN_F10R2_FB8                                ((uint32_t)0x00000100)
#define CAN_F10R2_FB9                                ((uint32_t)0x00000200)
#define CAN_F10R2_FB10                               ((uint32_t)0x00000400)
#define CAN_F10R2_FB11                               ((uint32_t)0x00000800)
#define CAN_F10R2_FB12                               ((uint32_t)0x00001000)
#define CAN_F10R2_FB13                               ((uint32_t)0x00002000)
#define CAN_F10R2_FB14                               ((uint32_t)0x00004000)
#define CAN_F10R2_FB15                               ((uint32_t)0x00008000)
#define CAN_F10R2_FB16                               ((uint32_t)0x00010000)
#define CAN_F10R2_FB17                               ((uint32_t)0x00020000)
#define CAN_F10R2_FB18                               ((uint32_t)0x00040000)
#define CAN_F10R2_FB19                               ((uint32_t)0x00080000)
#define CAN_F10R2_FB20                               ((uint32_t)0x00100000)
#define CAN_F10R2_FB21                               ((uint32_t)0x00200000)
#define CAN_F10R2_FB22                               ((uint32_t)0x00400000)
#define CAN_F10R2_FB23                               ((uint32_t)0x00800000)
#define CAN_F10R2_FB24                               ((uint32_t)0x01000000)
#define CAN_F10R2_FB25                               ((uint32_t)0x02000000)
#define CAN_F10R2_FB26                               ((uint32_t)0x04000000)
#define CAN_F10R2_FB27                               ((uint32_t)0x08000000)
#define CAN_F10R2_FB28                               ((uint32_t)0x10000000)
#define CAN_F10R2_FB29                               ((uint32_t)0x20000000)
#define CAN_F10R2_FB30                               ((uint32_t)0x40000000)
#define CAN_F10R2_FB31                               ((uint32_t)0x80000000)

/********************  Bit definition for CAN_F11R2 register  ********************/
#define CAN_F11R2_FB0                                ((uint32_t)0x00000001)
#define CAN_F11R2_FB1                                ((uint32_t)0x00000002)
#define CAN_F11R2_FB2                                ((uint32_t)0x00000004)
#define CAN_F11R2_FB3                                ((uint32_t)0x00000008)
#define CAN_F11R2_FB4                                ((uint32_t)0x00000010)
#define CAN_F11R2_FB5                                ((uint32_t)0x00000020)
#define CAN_F11R2_FB6                                ((uint32_t)0x00000040)
#define CAN_F11R2_FB7                                ((uint32_t)0x00000080)
#define CAN_F11R2_FB8                                ((uint32_t)0x00000100)
#define CAN_F11R2_FB9                                ((uint32_t)0x00000200)
#define CAN_F11R2_FB10                               ((uint32_t)0x00000400)
#define CAN_F11R2_FB11                               ((uint32_t)0x00000800)
#define CAN_F11R2_FB12                               ((uint32_t)0x00001000)
#define CAN_F11R2_FB13                               ((uint32_t)0x00002000)
#define CAN_F11R2_FB14                               ((uint32_t)0x00004000)
#define CAN_F11R2_FB15                               ((uint32_t)0x00008000)
#define CAN_F11R2_FB16                               ((uint32_t)0x00010000)
#define CAN_F11R2_FB17                               ((uint32_t)0x00020000)
#define CAN_F11R2_FB18                               ((uint32_t)0x00040000)
#define CAN_F11R2_FB19                               ((uint32_t)0x00080000)
#define CAN_F11R2_FB20                               ((uint32_t)0x00100000)
#define CAN_F11R2_FB21                               ((uint32_t)0x00200000)
#define CAN_F11R2_FB22                               ((uint32_t)0x00400000)
#define CAN_F11R2_FB23                               ((uint32_t)0x00800000)
#define CAN_F11R2_FB24                               ((uint32_t)0x01000000)
#define CAN_F11R2_FB25                               ((uint32_t)0x02000000)
#define CAN_F11R2_FB26                               ((uint32_t)0x04000000)
#define CAN_F11R2_FB27                               ((uint32_t)0x08000000)
#define CAN_F11R2_FB28                               ((uint32_t)0x10000000)
#define CAN_F11R2_FB29                               ((uint32_t)0x20000000)
#define CAN_F11R2_FB30                               ((uint32_t)0x40000000)
#define CAN_F11R2_FB31                               ((uint32_t)0x80000000)

/********************  Bit definition for CAN_F12R2 register  ********************/
#define CAN_F12R2_FB0                                ((uint32_t)0x00000001)
#define CAN_F12R2_FB1                                ((uint32_t)0x00000002)
#define CAN_F12R2_FB2                                ((uint32_t)0x00000004)
#define CAN_F12R2_FB3                                ((uint32_t)0x00000008)
#define CAN_F12R2_FB4                                ((uint32_t)0x00000010)
#define CAN_F12R2_FB5                                ((uint32_t)0x00000020)
#define CAN_F12R2_FB6                                ((uint32_t)0x00000040)
#define CAN_F12R2_FB7                                ((uint32_t)0x00000080)
#define CAN_F12R2_FB8                                ((uint32_t)0x00000100)
#define CAN_F12R2_FB9                                ((uint32_t)0x00000200)
#define CAN_F12R2_FB10                               ((uint32_t)0x00000400)
#define CAN_F12R2_FB11                               ((uint32_t)0x00000800)
#define CAN_F12R2_FB12                               ((uint32_t)0x00001000)
#define CAN_F12R2_FB13                               ((uint32_t)0x00002000)
#define CAN_F12R2_FB14                               ((uint32_t)0x00004000)
#define CAN_F12R2_FB15                               ((uint32_t)0x00008000)
#define CAN_F12R2_FB16                               ((uint32_t)0x00010000)
#define CAN_F12R2_FB17                               ((uint32_t)0x00020000)
#define CAN_F12R2_FB18                               ((uint32_t)0x00040000)
#define CAN_F12R2_FB19                               ((uint32_t)0x00080000)
#define CAN_F12R2_FB20                               ((uint32_t)0x00100000)
#define CAN_F12R2_FB21                               ((uint32_t)0x00200000)
#define CAN_F12R2_FB22                               ((uint32_t)0x00400000)
#define CAN_F12R2_FB23                               ((uint32_t)0x00800000)
#define CAN_F12R2_FB24                               ((uint32_t)0x01000000)
#define CAN_F12R2_FB25                               ((uint32_t)0x02000000)
#define CAN_F12R2_FB26                               ((uint32_t)0x04000000)
#define CAN_F12R2_FB27                               ((uint32_t)0x08000000)
#define CAN_F12R2_FB28                               ((uint32_t)0x10000000)
#define CAN_F12R2_FB29                               ((uint32_t)0x20000000)
#define CAN_F12R2_FB30                               ((uint32_t)0x40000000)
#define CAN_F12R2_FB31                               ((uint32_t)0x80000000)

/********************  Bit definition for CAN_F13R2 register  ********************/
#define CAN_F13R2_FB0                                ((uint32_t)0x00000001)
#define CAN_F13R2_FB1                                ((uint32_t)0x00000002)
#define CAN_F13R2_FB2                                ((uint32_t)0x00000004)
#define CAN_F13R2_FB3                                ((uint32_t)0x00000008)
#define CAN_F13R2_FB4                                ((uint32_t)0x00000010)
#define CAN_F13R2_FB5                                ((uint32_t)0x00000020)
#define CAN_F13R2_FB6                                ((uint32_t)0x00000040)
#define CAN_F13R2_FB7                                ((uint32_t)0x00000080)
#define CAN_F13R2_FB8                                ((uint32_t)0x00000100)
#define CAN_F13R2_FB9                                ((uint32_t)0x00000200)
#define CAN_F13R2_FB10                               ((uint32_t)0x00000400)
#define CAN_F13R2_FB11                               ((uint32_t)0x00000800)
#define CAN_F13R2_FB12                               ((uint32_t)0x00001000)
#define CAN_F13R2_FB13                               ((uint32_t)0x00002000)
#define CAN_F13R2_FB14                               ((uint32_t)0x00004000)
#define CAN_F13R2_FB15                               ((uint32_t)0x00008000)
#define CAN_F13R2_FB16                               ((uint32_t)0x00010000)
#define CAN_F13R2_FB17                               ((uint32_t)0x00020000)
#define CAN_F13R2_FB18                               ((uint32_t)0x00040000)
#define CAN_F13R2_FB19                               ((uint32_t)0x00080000)
#define CAN_F13R2_FB20                               ((uint32_t)0x00100000)
#define CAN_F13R2_FB21                               ((uint32_t)0x00200000)
#define CAN_F13R2_FB22                               ((uint32_t)0x00400000)
#define CAN_F13R2_FB23                               ((uint32_t)0x00800000)
#define CAN_F13R2_FB24                               ((uint32_t)0x01000000)
#define CAN_F13R2_FB25                               ((uint32_t)0x02000000)
#define CAN_F13R2_FB26                               ((uint32_t)0x04000000)
#define CAN_F13R2_FB27                               ((uint32_t)0x08000000)
#define CAN_F13R2_FB28                               ((uint32_t)0x10000000)
#define CAN_F13R2_FB29                               ((uint32_t)0x20000000)
#define CAN_F13R2_FB30                               ((uint32_t)0x40000000)
#define CAN_F13R2_FB31                               ((uint32_t)0x80000000)

