SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
/*******************  Bit definition for FLASH_ACTLR register  ******************/

/******************  Bit definition for FLASH_ACTLR register  ******************/
#define  FLASH_ACTLR_SCK_CFG                         ((uint32_t)0x00000003)
#define  FLASH_ACTLR_SCK_CFG_0                       ((uint32_t)0x00000001)
#define  FLASH_ACTLR_SCK_CFG_1                       ((uint32_t)0x00000002)

#define  FLASH_ACTLR_LATENCY_HCLK_DIV1               ((uint32_t)0x00000000)
#define  FLASH_ACTLR_LATENCY_HCLK_DIV2               ((uint32_t)0x00000001)
#define  FLASH_ACTLR_LATENCY_HCLK_DIV4               ((uint32_t)0x00000002)

#define  FLASH_ACTLR_ENHANCE_STATUS                  ((uint32_t)0x00000040)
#define  FLASH_ACTLR_EHMOD                           ((uint32_t)0x00000080)

#define  FLASH_ACTLR_LP                              ((uint32_t)0x00000100)
#define  FLASH_ACTLR_RD_MD                           ((uint32_t)0x00000800)
#define  FLASH_ACTLR_READY                           ((uint32_t)0x00004000)
#define  FLASH_ACTLR_ST                              ((uint32_t)0x00008000)

/******************  Bit definition for FLASH_KEYR register  ******************/
#define  FLASH_KEYR_FKEYR                            ((uint32_t)0xFFFFFFFF)        /* FPEC Key */
#define  FLASH_KEYR_KEY1                             ((uint32_t)0x45670123)
#define  FLASH_KEYR_KEY2                             ((uint32_t)0xCDEF89AB)

/*****************  Bit definition for FLASH_OBKEYR register  ****************/
#define  FLASH_OBKEYR_OBKEYR                         ((uint32_t)0xFFFFFFFF)        /* Option Byte Key */

/******************  Bit definition for FLASH_STATR register  *******************/
#define  FLASH_STATR_BSY                             ((uint8_t)0x01)               /* Busy */
#define  FLASH_STATR_WRBSY                           ((uint8_t)0x02)
#define  FLASH_STATR_WRPRTERR                        ((uint8_t)0x10)               /* Write Protection Error */
#define  FLASH_STATR_EOP                             ((uint8_t)0x20)               /* End of operation */

#define  FLASH_STATR_BOOT_AVA                        ((uint16_t)0x1000)
#define  FLASH_STATR_BOOT_STATUS                     ((uint16_t)0x2000)
#define  FLASH_STATR_BOOT_MODE                       ((uint16_t)0x4000)
#define  FLASH_STATR_BOOT_LOCK                       ((uint16_t)0x8000)

/*******************  Bit definition for FLASH_CTLR register  *******************/
#define  FLASH_CTLR_PG                               ((uint32_t)0x00000001)        /* Programming */
#define  FLASH_CTLR_PER                              ((uint32_t)0x00000002)        /* Sector Erase 4K */
#define  FLASH_CTLR_OPTPG                            ((uint32_t)0x00000010)        /* Option Byte Programming */
#define  FLASH_CTLR_OPTER                            ((uint32_t)0x00000020)        /* Option Byte Erase */
#define  FLASH_CTLR_STRT                             ((uint32_t)0x00000040)        /* Start */
#define  FLASH_CTLR_LOCK                             ((uint32_t)0x00000080)        /* Lock */
#define  FLASH_CTLR_OPTWRE                           ((uint32_t)0x00000200)        /* Option Bytes Write Enable */
#define  FLASH_CTLR_ERRIE                            ((uint32_t)0x00000400)        /* Error Interrupt Enable */
#define  FLASH_CTLR_EOPIE                            ((uint32_t)0x00001000)        /* End of operation interrupt enable */
#define  FLASH_CTLR_FAST_LOCK                        ((uint32_t)0x00008000)        /* Fast Lock */
#define  FLASH_CTLR_PAGE_PG                          ((uint32_t)0x00010000)        /* Page Programming 256Byte */
#define  FLASH_CTLR_PAGE_BER32                       ((uint32_t)0x00040000)        /* Block Erase 32K */
#define  FLASH_CTLR_PG_STRT                          ((uint32_t)0x00200000)        /* Page Programming Start */
#define  FLASH_CTLR_RSENACT                          ((uint32_t)0x00400000)

/*******************  Bit definition for FLASH_ADDR register  *******************/
#define  FLASH_ADDR_FAR                              ((uint32_t)0xFFFFFFFF)        /* Flash Address */

/******************  Bit definition for FLASH_OBR register  *******************/
#define  FLASH_OBR_OPTERR                            ((uint16_t)0x0001)            /* Option Byte Error */
#define  FLASH_OBR_RDPRT                             ((uint16_t)0x0002)            /* Read protection */

#define  FLASH_OBR_USER                              ((uint16_t)0x0304)            /* User Option Bytes */
#define  FLASH_OBR_WDG_SW                            ((uint16_t)0x0004)            /* WDG_SW */
#define  FLASH_OBR_FIX_11                            ((uint16_t)0x0300)            /* nRST_STOP */

#define  FLASH_OBR_DATA0                             ((uint32_t)0x0003FC00)
#define  FLASH_OBR_DATA1                             ((uint32_t)0x03FC0000)

/******************  Bit definition for FLASH_WPR register  ******************/
#define  FLASH_WPR_WRP                               ((uint32_t)0xFFFFFFFF)        /* Write Protect */

/******************  Bit definition for FLASH_MODEKEYR register  ******************/
#define  FLASH_MODEKEYR_KEY1                         ((uint32_t)0x45670123)
#define  FLASH_MODEKEYR_KEY2                         ((uint32_t)0xCDEF89AB)

/******************  Bit definition for FLASH_RDPR register  *******************/
#define  FLASH_RDPR_RDPR                             ((uint32_t)0x000000FF)        /* Read protection option byte */
#define  FLASH_RDPR_nRDPR                            ((uint32_t)0x0000FF00)        /* Read protection complemented option byte */

/******************  Bit definition for FLASH_USER register  ******************/
#define  FLASH_USER_USER                             ((uint32_t)0x00FF0000)        /* User option byte */
#define  FLASH_USER_nUSER                            ((uint32_t)0xFF000000)        /* User complemented option byte */

/******************  Bit definition for FLASH_Data0 register  *****************/
#define  FLASH_Data0_Data0                           ((uint32_t)0x000000FF)        /* User data storage option byte */
#define  FLASH_Data0_nData0                          ((uint32_t)0x0000FF00)        /* User data storage complemented option byte */

/******************  Bit definition for FLASH_Data1 register  *****************/
#define  FLASH_Data1_Data1                           ((uint32_t)0x00FF0000)        /* User data storage option byte */
#define  FLASH_Data1_nData1                          ((uint32_t)0xFF000000)        /* User data storage complemented option byte */

/******************  Bit definition for FLASH_WRPR0 register  ******************/
#define  FLASH_WRPR0_WRPR0                           ((uint32_t)0x000000FF)        /* Flash memory write protection option bytes */
#define  FLASH_WRPR0_nWRPR0                          ((uint32_t)0x0000FF00)        /* Flash memory write protection complemented option bytes */

/******************  Bit definition for FLASH_WRPR1 register  ******************/
#define  FLASH_WRPR1_WRPR1                           ((uint32_t)0x00FF0000)        /* Flash memory write protection option bytes */
#define  FLASH_WRPR1_nWRPR1                          ((uint32_t)0xFF000000)        /* Flash memory write protection complemented option bytes */

/******************  Bit definition for FLASH_WRPR2 register  ******************/
#define  FLASH_WRPR2_WRPR2                           ((uint32_t)0x000000FF)        /* Flash memory write protection option bytes */
#define  FLASH_WRPR2_nWRPR2                          ((uint32_t)0x0000FF00)        /* Flash memory write protection complemented option bytes */

