SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
/*****************  Bit definition for I3C_DEVR1 register  ******************/
#define  I3C_DEVR1_DA                                ((uint32_t)0x000000FE)

#define  I3C_DEVR1_IBIACK                            ((uint32_t)0x00010000)
#define  I3C_DEVR1_CRACK                             ((uint32_t)0x00020000)
#define  I3C_DEVR1_IBIDEN                            ((uint32_t)0x00040000)
#define  I3C_DEVR1_SUSP                              ((uint32_t)0x00080000)

#define  I3C_DEVR1_DIS                               ((uint32_t)0x80000000)

/*****************  Bit definition for I3C_DEVR2 register  ******************/
#define  I3C_DEVR2_DA                                ((uint32_t)0x000000FE)

#define  I3C_DEVR2_IBIACK                            ((uint32_t)0x00010000)
#define  I3C_DEVR2_CRACK                             ((uint32_t)0x00020000)
#define  I3C_DEVR2_IBIDEN                            ((uint32_t)0x00040000)
#define  I3C_DEVR2_SUSP                              ((uint32_t)0x00080000)

#define  I3C_DEVR2_DIS                               ((uint32_t)0x80000000)

/*****************  Bit definition for I3C_DEVR3 register  ******************/
#define  I3C_DEVR3_DA                                ((uint32_t)0x000000FE)

#define  I3C_DEVR3_IBIACK                            ((uint32_t)0x00010000)
#define  I3C_DEVR3_CRACK                             ((uint32_t)0x00020000)
#define  I3C_DEVR3_IBIDEN                            ((uint32_t)0x00040000)
#define  I3C_DEVR3_SUSP                              ((uint32_t)0x00080000)

#define  I3C_DEVR3_DIS                               ((uint32_t)0x80000000)

/*****************  Bit definition for I3C_DEVR4 register  ******************/
#define  I3C_DEVR4_DA                                ((uint32_t)0x000000FE)

#define  I3C_DEVR4_IBIACK                            ((uint32_t)0x00010000)
#define  I3C_DEVR4_CRACK                             ((uint32_t)0x00020000)
#define  I3C_DEVR4_IBIDEN                            ((uint32_t)0x00040000)
#define  I3C_DEVR4_SUSP                              ((uint32_t)0x00080000)

#define  I3C_DEVR4_DIS                               ((uint32_t)0x80000000)

/*****************  Bit definition for I3C_MAXRLR register  ******************/
#define  I3C_MAXRLR_MRL                              ((uint32_t)0x0000FFFF)

#define  I3C_MAXRLR_IBIP                             ((uint32_t)0x00070000)
#define  I3C_MAXRLR_IBIP_0                           ((uint32_t)0x00010000)
#define  I3C_MAXRLR_IBIP_1                           ((uint32_t)0x00020000)
#define  I3C_MAXRLR_IBIP_2                           ((uint32_t)0x00040000)

/*****************  Bit definition for I3C_MAXWLR register  ******************/
#define  I3C_MAXWLR_MWL                              ((uint32_t)0x0000FFFF)

/*****************  Bit definition for I3C_TIMINGR0 register  ******************/
#define  I3C_TIMINGR0_SCLL_PP                        ((uint32_t)0x000000FF)
#define  I3C_TIMINGR0_SCLH_I3C                       ((uint32_t)0x0000FF00)
#define  I3C_TIMINGR0_SCLL_OD                        ((uint32_t)0x00FF0000)
#define  I3C_TIMINGR0_SCLH_I2C                       ((uint32_t)0xFF000000)

/*****************  Bit definition for I3C_TIMINGR1 register  ******************/
#define  I3C_TIMINGR1_AVAL                           ((uint32_t)0x000000FF)
#define  I3C_TIMINGR1_ASNCR                          ((uint32_t)0x00000300)

#define  I3C_TIMINGR1_FREE                           ((uint32_t)0x007F0000)
#define  I3C_TIMINGR1_SDA_HD                         ((uint32_t)0x10000000)

/*****************  Bit definition for I3C_TIMINGR2 register  ******************/
#define  I3C_TIMINGR2_STALLT                         ((uint32_t)0x00000001)
#define  I3C_TIMINGR2_STALLD                         ((uint32_t)0x00000002)
#define  I3C_TIMINGR2_STALLC                         ((uint32_t)0x00000004)
#define  I3C_TIMINGR2_STALLA                         ((uint32_t)0x00000008)

#define  I3C_TIMINGR2_STALL                          ((uint32_t)0x0000FF00)

/*****************  Bit definition for I3C_DCR register  ******************/
#define  I3C_DCR                                     ((uint32_t)0x000000FF)

/*****************  Bit definition for I3C_GETCAPR register  ******************/
#define  I3C_GETCAPR_CAPPEND                         ((uint32_t)0x00004000)

/*****************  Bit definition for I3C_CRCAPR register  ******************/
#define  I3C_CRCAPR_CAPDHOFF                         ((uint32_t)0x00000008)
#define  I3C_CRCAPR_CAPGRP                           ((uint32_t)0x00000200)

/*****************  Bit definition for I3C_GETMDSR register  ******************/
#define  I3C_GETMDSR_HOFFAS                          ((uint32_t)0x00000003)
#define  I3C_GETMDSR_HOFFAS_0                        ((uint32_t)0x00000001)
#define  I3C_GETMDSR_HOFFAS_1                        ((uint32_t)0x00000002)

#define  I3C_GETMDSR_FMT                             ((uint32_t)0x00000300)
#define  I3C_GETMDSR_FMT_0                           ((uint32_t)0x00000100)
#define  I3C_GETMDSR_FMT_1                           ((uint32_t)0x00000200)

#define  I3C_GETMDSR_RDTURN                          ((uint32_t)0x00FF0000)
#define  I3C_GETMDSR_TSCO                            ((uint32_t)0x01000000)

/*****************  Bit definition for I3C_EPIDR register  ******************/
#define  I3C_EPIDR_MIPIID                            ((uint32_t)0x0000F000)
#define  I3C_EPIDR_IDTSEL                            ((uint32_t)0x00010000)
#define  I3C_EPIDR_MIPIMID                           ((uint32_t)0xFFFE0000)

/******************************************************************************/
/*                              LOW POWER TIM                                 */
/******************************************************************************/
/*******************  Bit definition for LPTIM_ISR register  *******************/
#define LPTIM_ISR_CMPM                               ((uint32_t)0x00000001)
#define LPTIM_ISR_ARRM                               ((uint32_t)0x00000002)
#define LPTIM_ISR_EXTTRIG                            ((uint32_t)0x00000004)
#define LPTIM_ISR_CMPOK                              ((uint32_t)0x00000008)
#define LPTIM_ISR_ARROK                              ((uint32_t)0000000010)
#define LPTIM_ISR_UP                                 ((uint32_t)0x00000020)
#define LPTIM_ISR_DOWN                               ((uint32_t)0x00000040)
#define LPTIM_ISR_DIRSYNC                            ((uint32_t)0x00000080)

