SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
/*******************  Bit definition for RCC_INTR register  ********************/
#define  RCC_LSIRDYF                                 ((uint32_t)0x00000001)        /* LSI Ready Interrupt flag */
#define  RCC_LSERDYF                                 ((uint32_t)0x00000002)        /* LSE Ready Interrupt flag */
#define  RCC_HSIRDYF                                 ((uint32_t)0x00000004)        /* HSI Ready Interrupt flag */
#define  RCC_HSERDYF                                 ((uint32_t)0x00000008)        /* HSE Ready Interrupt flag */
#define  RCC_PLLRDYF                                 ((uint32_t)0x00000010)        /* PLL Ready Interrupt flag */
#define  RCC_ETHPLLRDYF                              ((uint32_t)0x00000020)
#define  RCC_SERDESPLLRDYF                           ((uint32_t)0x00000040)
#define  RCC_CSSF                                    ((uint32_t)0x00000080)        /* Clock Security System Interrupt flag */
#define  RCC_LSIRDYIE                                ((uint32_t)0x00000100)        /* LSI Ready Interrupt Enable */
#define  RCC_LSERDYIE                                ((uint32_t)0x00000200)        /* LSE Ready Interrupt Enable */
#define  RCC_HSIRDYIE                                ((uint32_t)0x00000400)        /* HSI Ready Interrupt Enable */
#define  RCC_HSERDYIE                                ((uint32_t)0x00000800)        /* HSE Ready Interrupt Enable */
#define  RCC_PLLRDYIE                                ((uint32_t)0x00001000)        /* PLL Ready Interrupt Enable */
#define  RCC_ETHPLLRDYIE                             ((uint32_t)0x00002000)
#define  RCC_SERDESPLLRDYIE                          ((uint32_t)0x00004000)
#define  RCC_LSIRDYC                                 ((uint32_t)0x00010000)        /* LSI Ready Interrupt Clear */
#define  RCC_LSERDYC                                 ((uint32_t)0x00020000)        /* LSE Ready Interrupt Clear */
#define  RCC_HSIRDYC                                 ((uint32_t)0x00040000)        /* HSI Ready Interrupt Clear */
#define  RCC_HSERDYC                                 ((uint32_t)0x00080000)        /* HSE Ready Interrupt Clear */
#define  RCC_PLLRDYC                                 ((uint32_t)0x00100000)        /* PLL Ready Interrupt Clear */
#define  RCC_ETHPLLRDYC                              ((uint32_t)0x00200000)
#define  RCC_SERDESPLLRDYC                           ((uint32_t)0x00400000)
#define  RCC_CSSC                                    ((uint32_t)0x00800000)        /* Clock Security System Interrupt Clear */

/*****************  Bit definition for RCC_HB2PRSTR register  *****************/
#define  RCC_AFIORST                                 ((uint32_t)0x00000001)        /* Alternate Function I/O reset */
#define  RCC_HSADCRST                                ((uint32_t)0x00000002)
#define  RCC_IOPARST                                 ((uint32_t)0x00000004)        /* I/O port A reset */
#define  RCC_IOPBRST                                 ((uint32_t)0x00000008)        /* I/O port B reset */
#define  RCC_IOPCRST                                 ((uint32_t)0x00000010)        /* I/O port C reset */
#define  RCC_IOPDRST                                 ((uint32_t)0x00000020)        /* I/O port D reset */
#define  RCC_IOPERST                                 ((uint32_t)0x00000040)
#define  RCC_IOPFRST                                 ((uint32_t)0x00000080)

#define  RCC_ADC1RST                                 ((uint32_t)0x00000200)        /* ADC 1 interface reset */
#define  RCC_ADC2RST                                 ((uint32_t)0x00000400)        /* ADC 2 interface reset */
#define  RCC_TIM1RST                                 ((uint32_t)0x00000800)        /* TIM1 Timer reset */
#define  RCC_SPI1RST                                 ((uint32_t)0x00001000)        /* SPI 1 reset */
#define  RCC_TIM8RST                                 ((uint32_t)0x00002000)
#define  RCC_USART1RST                               ((uint32_t)0x00004000)        /* USART1 reset */
#define  RCC_I2C4RST                                 ((uint32_t)0x00008000)
#define  RCC_SAIRST                                  ((uint32_t)0x00010000)
#define  RCC_SDIORST                                 ((uint32_t)0x00040000)
#define  RCC_TIM9RST                                 ((uint32_t)0x00080000)
#define  RCC_TIM10RST                                ((uint32_t)0x00100000)
#define  RCC_TIM11RST                                ((uint32_t)0x00200000)
#define  RCC_TIM12RST                                ((uint32_t)0x00400000)
#define  RCC_OPCMRST                                 ((uint32_t)0x00800000)
#define  RCC_DFSDMRST                                ((uint32_t)0x02000000)
#define  RCC_ECDCRST                                 ((uint32_t)0x04000000)
#define  RCC_GPHARST                                 ((uint32_t)0x08000000)
#define  RCC_LTDCRST                                 ((uint32_t)0x40000000)
#define  RCC_I3CRST                                  ((uint32_t)0x80000000)

/*****************  Bit definition for RCC_HB1PRSTR register  *****************/
#define  RCC_TIM2RST                                 ((uint32_t)0x00000001)        /* Timer 2 reset */
#define  RCC_TIM3RST                                 ((uint32_t)0x00000002)        /* Timer 3 reset */
#define  RCC_TIM4RST                                 ((uint32_t)0x00000004)        /* Timer 4 reset */
#define  RCC_TIM5RST                                 ((uint32_t)0x00000008)        /* Timer 5 reset */
#define  RCC_TIM6RST                                 ((uint32_t)0x00000010)        /* Timer 6 reset */
#define  RCC_TIM7RST                                 ((uint32_t)0x00000020)        /* Timer 7 reset */
#define  RCC_USART6RST                               ((uint32_t)0x00000040)        /* USART 2 reset */
#define  RCC_USART7RST                               ((uint32_t)0x00000080)        /* USART 2 reset */
#define  RCC_USART8RST                               ((uint32_t)0x00000100)        /* USART 2 reset */
#define  RCC_LPTIM1RST                               ((uint32_t)0x00000200)
#define  RCC_LPTIM2RST                               ((uint32_t)0x00000400)
#define  RCC_WWDGRST                                 ((uint32_t)0x00000800)        /* Window Watchdog reset */
#define  RCC_QSPI1RST                                ((uint32_t)0x00001000)
#define  RCC_QSPI2RST                                ((uint32_t)0x00002000)
#define  RCC_SPI2RST                                 ((uint32_t)0x00004000)        /* SPI 2 reset */
#define  RCC_SPI3RST                                 ((uint32_t)0x00008000)        /* SPI 3 reset */
#define  RCC_SPI4RST                                 ((uint32_t)0x00010000)
#define  RCC_USART2RST                               ((uint32_t)0x00020000)        /* USART 2 reset */
#define  RCC_USART3RST                               ((uint32_t)0x00040000)        /* USART 3 reset */
#define  RCC_USART4RST                               ((uint32_t)0x00080000)        /* USART 4 reset */
#define  RCC_USART5RST                               ((uint32_t)0x00100000)        /* USART 5 reset */
#define  RCC_I2C1RST                                 ((uint32_t)0x00200000)        /* I2C 1 reset */
#define  RCC_I2C2RST                                 ((uint32_t)0x00400000)        /* I2C 2 reset */
#define  RCC_CAN3RST                                 ((uint32_t)0x01000000)
#define  RCC_CAN1RST                                 ((uint32_t)0x02000000)        /* CAN1 reset */
#define  RCC_CAN2RST                                 ((uint32_t)0x04000000)        /* CAN2 reset */
#define  RCC_BKPRST                                  ((uint32_t)0x08000000)        /* Backup interface reset */
#define  RCC_PWRRST                                  ((uint32_t)0x10000000)        /* Power interface reset */
#define  RCC_DACRST                                  ((uint32_t)0x20000000)        /* DAC reset */
#define  RCC_I2C3RST                                 ((uint32_t)0x40000000)
#define  RCC_SWPMIRST                                ((uint32_t)0x80000000)

/******************  Bit definition for RCC_HBPCENR register  ******************/
#define  RCC_DMA1EN                                  ((uint16_t)0x0001)            /* DMA1 clock enable */
#define  RCC_DMA2EN                                  ((uint16_t)0x0002)
#define  RCC_CRCEN                                   ((uint16_t)0x0040)            /* CRC clock enable */
#define  RCC_FMCEN                                   ((uint16_t)0x0100)
#define  RCC_RNGEN                                   ((uint16_t)0x0200)
#define  RCC_SDMMCEN                                 ((uint16_t)0x0400)
#define  RCC_USBHSEN                                 ((uint16_t)0x0800)
#define  RCC_USBSSEN                                 ((uint16_t)0x1000)
#define  RCC_DVPEN                                   ((uint16_t)0x2000)
#define  RCC_ETHEN                                   ((uint16_t)0x4000)

#define  RCC_USBOTGEN                                ((uint32_t)0x00020000)
#define  RCC_UHSIFEN                                 ((uint32_t)0x00040000)
#define  RCC_USBPDEN                                 ((uint32_t)0x00080000)
#define  RCC_SERDESEN                                ((uint32_t)0x00100000)
#define  RCC_PIOCEN                                  ((uint32_t)0x00400000)

/******************  Bit definition for RCC_HB2PCENR register  *****************/
#define  RCC_AFIOEN                                  ((uint32_t)0x00000001)         /* Alternate Function I/O clock enable */
#define  RCC_HSADCEN                                 ((uint32_t)0x00000002)
#define  RCC_IOPAEN                                  ((uint32_t)0x00000004)         /* I/O port A clock enable */
#define  RCC_IOPBEN                                  ((uint32_t)0x00000008)         /* I/O port B clock enable */
#define  RCC_IOPCEN                                  ((uint32_t)0x00000010)         /* I/O port C clock enable */
#define  RCC_IOPDEN                                  ((uint32_t)0x00000020)         /* I/O port D clock enable */
#define  RCC_IOPEEN                                  ((uint32_t)0x00000040)
#define  RCC_IOPFEN                                  ((uint32_t)0x00000080)

#define  RCC_ADC1EN                                  ((uint32_t)0x00000200)         /* ADC 1 interface clock enable */
#define  RCC_ADC2EN                                  ((uint32_t)0x00000400)         /* ADC 2 interface clock enable */
#define  RCC_TIM1EN                                  ((uint32_t)0x00000800)         /* TIM1 Timer clock enable */
#define  RCC_SPI1EN                                  ((uint32_t)0x00001000)         /* SPI 1 clock enable */
#define  RCC_TIM8EN                                  ((uint32_t)0x00002000)
#define  RCC_USART1EN                                ((uint32_t)0x00004000)         /* USART1 clock enable */
#define  RCC_I2C4EN                                  ((uint32_t)0x00008000)

#define  RCC_SAIEN                                   ((uint32_t)0x00010000)
#define  RCC_SDIOEN                                  ((uint32_t)0x00040000)
#define  RCC_TIM9EN                                  ((uint32_t)0x00080000)
#define  RCC_TIM10EN                                 ((uint32_t)0x00100000)
#define  RCC_TIM11EN                                 ((uint32_t)0x00200000)
#define  RCC_TIM12EN                                 ((uint32_t)0x00400000)
#define  RCC_OPCMEN                                  ((uint32_t)0x00800000)

#define  RCC_DFSDMEN                                 ((uint32_t)0x02000000)
#define  RCC_ECDCEN                                  ((uint32_t)0x04000000)
#define  RCC_GPHAEN                                  ((uint32_t)0x08000000)
#define  RCC_LTDCEN                                  ((uint32_t)0x40000000)
#define  RCC_I3CEN                                   ((uint32_t)0x80000000)

/*****************  Bit definition for RCC_HB1PCENR register  ******************/
#define  RCC_TIM2EN                                  ((uint32_t)0x00000001)        /* Timer 2 clock enabled*/
#define  RCC_TIM3EN                                  ((uint32_t)0x00000002)        /* Timer 3 clock enable */
#define  RCC_TIM4EN                                  ((uint32_t)0x00000004)
#define  RCC_TIM5EN                                  ((uint32_t)0x00000008)
#define  RCC_TIM6EN                                  ((uint32_t)0x00000010)
#define  RCC_TIM7EN                                  ((uint32_t)0x00000020)
#define  RCC_USART6EN                                ((uint32_t)0x00000040)
#define  RCC_USART7EN                                ((uint32_t)0x00000080)
#define  RCC_USART8EN                                ((uint32_t)0x00000100)
#define  RCC_LPTIM1EN                                ((uint32_t)0x00000200)
#define  RCC_LPTIM2EN                                ((uint32_t)0x00000400)
#define  RCC_WWDGEN                                  ((uint32_t)0x00000800)        /* Window Watchdog clock enable */

#define  RCC_QSPI1EN                                 ((uint32_t)0x00001000)
#define  RCC_QSPI2EN                                 ((uint32_t)0x00002000)
#define  RCC_SPI2EN                                  ((uint32_t)0x00004000)
#define  RCC_SPI3EN                                  ((uint32_t)0x00008000)
#define  RCC_SPI4EN                                  ((uint32_t)0x00010000)

