SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
#define  RCC_USART2EN                                ((uint32_t)0x00020000)        /* USART 2 clock enable */
#define  RCC_USART3EN                                ((uint32_t)0x00040000)
#define  RCC_USART4EN                                ((uint32_t)0x00080000)
#define  RCC_USART5EN                                ((uint32_t)0x00100000)
#define  RCC_I2C1EN                                  ((uint32_t)0x00200000)        /* I2C 1 clock enable */
#define  RCC_I2C2EN                                  ((uint32_t)0x00400000)
#define  RCC_CAN3EN                                  ((uint32_t)0x01000000)        /* USB Device clock enable */
#define  RCC_CAN1EN                                  ((uint32_t)0x02000000)
#define  RCC_CAN2EN                                  ((uint32_t)0x04000000)
#define  RCC_BKPEN                                   ((uint32_t)0x08000000)        /* Backup interface clock enable */
#define  RCC_PWREN                                   ((uint32_t)0x10000000)        /* Power interface clock enable */
#define  RCC_DACEN                                   ((uint32_t)0x20000000)
#define  RCC_I2C3EN                                  ((uint32_t)0x40000000)
#define  RCC_SWPMIEN                                 ((uint32_t)0x80000000)

/*******************  Bit definition for RCC_BDCTLR register  *******************/
#define  RCC_LSEON                                   ((uint32_t)0x00000001)        /* External Low Speed oscillator enable */
#define  RCC_LSERDY                                  ((uint32_t)0x00000002)        /* External Low Speed oscillator Ready */
#define  RCC_LSEBYP                                  ((uint32_t)0x00000004)        /* External Low Speed oscillator Bypass */
#define  RCC_CCO                                     ((uint32_t)0x00000008)
#define  RCC_ASOE                                    ((uint32_t)0x00000010)
#define  RCC_ASOS                                    ((uint32_t)0x00000020)

#define  RCC_RTCSEL                                  ((uint32_t)0x000000C0)        /* RTCSEL[1:0] bits (RTC clock source selection) */
#define  RCC_RTCSEL_0                                ((uint32_t)0x00000040)        /* Bit 0 */
#define  RCC_RTCSEL_1                                ((uint32_t)0x00000080)        /* Bit 1 */

#define  RCC_RTCSEL_NOCLOCK                          ((uint32_t)0x00000000)        /* No clock */
#define  RCC_RTCSEL_LSE                              ((uint32_t)0x00000040)        /* LSE oscillator clock used as RTC clock */
#define  RCC_RTCSEL_LSI                              ((uint32_t)0x00000080)        /* LSI oscillator clock used as RTC clock */
#define  RCC_RTCSEL_HSE                              ((uint32_t)0x000000C0)

#define  RCC_RTCEN                                   ((uint32_t)0x00000100)        /* RTC clock enable */
#define  RCC_RTCCAL                                  ((uint32_t)0x0000FE00)
#define  RCC_BDRST                                   ((uint32_t)0x00010000)        /* Backup domain software reset  */

/*******************  Bit definition for RCC_RSTSCKR register  ********************/
#define  RCC_LSION                                   ((uint32_t)0x00000001)        /* Internal Low Speed oscillator enable */
#define  RCC_LSIRDY                                  ((uint32_t)0x00000002)        /* Internal Low Speed oscillator Ready */
#define  RCC_RMVF                                    ((uint32_t)0x01000000)        /* Remove reset flag */
#define  RCC_PINRSTF                                 ((uint32_t)0x04000000)        /* PIN reset flag */
#define  RCC_PORRSTF                                 ((uint32_t)0x08000000)        /* POR/PDR reset flag */
#define  RCC_SFTRSTF                                 ((uint32_t)0x10000000)        /* Software Reset flag */
#define  RCC_IWDGRSTF                                ((uint32_t)0x20000000)        /* Independent Watchdog reset flag */
#define  RCC_WWDGRSTF                                ((uint32_t)0x40000000)        /* Window watchdog reset flag */
#define  RCC_LOCKUPRSTF                              ((uint32_t)0x80000000)        /* Low-Power reset flag */

/*******************  Bit definition for RCC_HBRSTR register  ********************/
#define  RCC_DMA1RST                                 ((uint32_t)0x00000001)
#define  RCC_DMA2RST                                 ((uint32_t)0x00000002)
#define  RCC_FMCRST                                  ((uint32_t)0x00000100)
#define  RCC_RNGRST                                  ((uint32_t)0x00000200)
#define  RCC_SDMMCRST                                ((uint32_t)0x00000400)
#define  RCC_USBHSRST                                ((uint32_t)0x00000800)

#define  RCC_USBSSRST                                ((uint32_t)0x00001000)
#define  RCC_DVPRST                                  ((uint32_t)0x00002000)
#define  RCC_ETHRST                                  ((uint32_t)0x00004000)

#define  RCC_USBOTGRST                               ((uint32_t)0x00020000)
#define  RCC_UHSIFRST                                ((uint32_t)0x00040000)
#define  RCC_USBPDRST                                ((uint32_t)0x00080000)
#define  RCC_SERDESRST                               ((uint32_t)0x00100000)
#define  RCC_PIOCRST                                 ((uint32_t)0x00400000)

/*******************  Bit definition for RCC_CFGR2 register  ********************/
#define  RCC_UHSIFDIV                                ((uint32_t)0x0000003F)
#define  RCC_UHSIFDIV_0                              ((uint32_t)0x00000001)
#define  RCC_UHSIFDIV_1                              ((uint32_t)0x00000002)
#define  RCC_UHSIFDIV_2                              ((uint32_t)0x00000004)
#define  RCC_UHSIFDIV_3                              ((uint32_t)0x00000008)
#define  RCC_UHSIFDIV_4                              ((uint32_t)0x00000010)
#define  RCC_UHSIFDIV_5                              ((uint32_t)0x00000020)

#define  RCC_UHSIFDIV_DIV1                           ((uint32_t)0x00000000)
#define  RCC_UHSIFDIV_DIV2                           ((uint32_t)0x00000001)
#define  RCC_UHSIFDIV_DIV3                           ((uint32_t)0x00000002)
#define  RCC_UHSIFDIV_DIV4                           ((uint32_t)0x00000003)
#define  RCC_UHSIFDIV_DIV5                           ((uint32_t)0x00000004)
#define  RCC_UHSIFDIV_DIV6                           ((uint32_t)0x00000005)
#define  RCC_UHSIFDIV_DIV7                           ((uint32_t)0x00000006)
#define  RCC_UHSIFDIV_DIV8                           ((uint32_t)0x00000007)
#define  RCC_UHSIFDIV_DIV9                           ((uint32_t)0x00000008)
#define  RCC_UHSIFDIV_DIV10                          ((uint32_t)0x00000009)
#define  RCC_UHSIFDIV_DIV11                          ((uint32_t)0x0000000A)
#define  RCC_UHSIFDIV_DIV12                          ((uint32_t)0x0000000B)
#define  RCC_UHSIFDIV_DIV13                          ((uint32_t)0x0000000C)
#define  RCC_UHSIFDIV_DIV14                          ((uint32_t)0x0000000D)
#define  RCC_UHSIFDIV_DIV15                          ((uint32_t)0x0000000E)
#define  RCC_UHSIFDIV_DIV16                          ((uint32_t)0x0000000F)
#define  RCC_UHSIFDIV_DIV17                          ((uint32_t)0x00000010)
#define  RCC_UHSIFDIV_DIV18                          ((uint32_t)0x00000011)
#define  RCC_UHSIFDIV_DIV19                          ((uint32_t)0x00000012)
#define  RCC_UHSIFDIV_DIV20                          ((uint32_t)0x00000013)
#define  RCC_UHSIFDIV_DIV21                          ((uint32_t)0x00000014)
#define  RCC_UHSIFDIV_DIV22                          ((uint32_t)0x00000015)
#define  RCC_UHSIFDIV_DIV23                          ((uint32_t)0x00000016)
#define  RCC_UHSIFDIV_DIV24                          ((uint32_t)0x00000017)
#define  RCC_UHSIFDIV_DIV25                          ((uint32_t)0x00000018)
#define  RCC_UHSIFDIV_DIV26                          ((uint32_t)0x00000019)
#define  RCC_UHSIFDIV_DIV27                          ((uint32_t)0x0000001A)
#define  RCC_UHSIFDIV_DIV28                          ((uint32_t)0x0000001B)
#define  RCC_UHSIFDIV_DIV29                          ((uint32_t)0x0000001C)
#define  RCC_UHSIFDIV_DIV30                          ((uint32_t)0x0000001D)
#define  RCC_UHSIFDIV_DIV31                          ((uint32_t)0x0000001E)
#define  RCC_UHSIFDIV_DIV32                          ((uint32_t)0x0000001F)
#define  RCC_UHSIFDIV_DIV33                          ((uint32_t)0x00000020)
#define  RCC_UHSIFDIV_DIV34                          ((uint32_t)0x00000021)
#define  RCC_UHSIFDIV_DIV35                          ((uint32_t)0x00000022)
#define  RCC_UHSIFDIV_DIV36                          ((uint32_t)0x00000023)
#define  RCC_UHSIFDIV_DIV37                          ((uint32_t)0x00000024)
#define  RCC_UHSIFDIV_DIV38                          ((uint32_t)0x00000025)
#define  RCC_UHSIFDIV_DIV39                          ((uint32_t)0x00000026)
#define  RCC_UHSIFDIV_DIV40                          ((uint32_t)0x00000027)
#define  RCC_UHSIFDIV_DIV41                          ((uint32_t)0x00000028)
#define  RCC_UHSIFDIV_DIV42                          ((uint32_t)0x00000029)
#define  RCC_UHSIFDIV_DIV43                          ((uint32_t)0x0000002A)
#define  RCC_UHSIFDIV_DIV44                          ((uint32_t)0x0000002B)
#define  RCC_UHSIFDIV_DIV45                          ((uint32_t)0x0000002C)
#define  RCC_UHSIFDIV_DIV46                          ((uint32_t)0x0000002D)
#define  RCC_UHSIFDIV_DIV47                          ((uint32_t)0x0000002E)
#define  RCC_UHSIFDIV_DIV48                          ((uint32_t)0x0000002F)
#define  RCC_UHSIFDIV_DIV49                          ((uint32_t)0x00000030)
#define  RCC_UHSIFDIV_DIV50                          ((uint32_t)0x00000031)
#define  RCC_UHSIFDIV_DIV51                          ((uint32_t)0x00000032)
#define  RCC_UHSIFDIV_DIV52                          ((uint32_t)0x00000033)
#define  RCC_UHSIFDIV_DIV53                          ((uint32_t)0x00000034)
#define  RCC_UHSIFDIV_DIV54                          ((uint32_t)0x00000035)
#define  RCC_UHSIFDIV_DIV55                          ((uint32_t)0x00000036)
#define  RCC_UHSIFDIV_DIV56                          ((uint32_t)0x00000037)
#define  RCC_UHSIFDIV_DIV57                          ((uint32_t)0x00000038)
#define  RCC_UHSIFDIV_DIV58                          ((uint32_t)0x00000039)
#define  RCC_UHSIFDIV_DIV59                          ((uint32_t)0x0000003A)
#define  RCC_UHSIFDIV_DIV60                          ((uint32_t)0x0000003B)
#define  RCC_UHSIFDIV_DIV61                          ((uint32_t)0x0000003C)
#define  RCC_UHSIFDIV_DIV62                          ((uint32_t)0x0000003D)
#define  RCC_UHSIFDIV_DIV63                          ((uint32_t)0x0000003E)
#define  RCC_UHSIFDIV_DIV64                          ((uint32_t)0x0000003F)

