SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
#define  RCC_UHSIFSRC                                ((uint32_t)0x000000C0)
#define  RCC_UHSIFSRC_0                              ((uint32_t)0x00000040)
#define  RCC_UHSIFSRC_1                              ((uint32_t)0x00000080)

#define  RCC_UHSIFSRC_SYSCLK                         ((uint32_t)0x00000000)
#define  RCC_UHSIFSRC_PLLCLK                         ((uint32_t)0x00000040)
#define  RCC_UHSIFSRC_USBHSPLL                       ((uint32_t)0x00000080)
#define  RCC_UHSIFSRC_ETHPLL                         ((uint32_t)0x000000C0)

#define  RCC_LTDCDIV                                 ((uint32_t)0x00003F00)
#define  RCC_LTDCDIV_0                               ((uint32_t)0x00000100)
#define  RCC_LTDCDIV_1                               ((uint32_t)0x00000200)
#define  RCC_LTDCDIV_2                               ((uint32_t)0x00000400)
#define  RCC_LTDCDIV_3                               ((uint32_t)0x00000800)
#define  RCC_LTDCDIV_4                               ((uint32_t)0x00001000)
#define  RCC_LTDCDIV_5                               ((uint32_t)0x00002000)

#define  RCC_LTDCDIV_DIV1                            ((uint32_t)0x00000000)
#define  RCC_LTDCDIV_DIV2                            ((uint32_t)0x00000100)
#define  RCC_LTDCDIV_DIV3                            ((uint32_t)0x00000200)
#define  RCC_LTDCDIV_DIV4                            ((uint32_t)0x00000300)
#define  RCC_LTDCDIV_DIV5                            ((uint32_t)0x00000400)
#define  RCC_LTDCDIV_DIV6                            ((uint32_t)0x00000500)
#define  RCC_LTDCDIV_DIV7                            ((uint32_t)0x00000600)
#define  RCC_LTDCDIV_DIV8                            ((uint32_t)0x00000700)
#define  RCC_LTDCDIV_DIV9                            ((uint32_t)0x00000800)
#define  RCC_LTDCDIV_DIV10                           ((uint32_t)0x00000900)
#define  RCC_LTDCDIV_DIV11                           ((uint32_t)0x00000A00)
#define  RCC_LTDCDIV_DIV12                           ((uint32_t)0x00000B00)
#define  RCC_LTDCDIV_DIV13                           ((uint32_t)0x00000C00)
#define  RCC_LTDCDIV_DIV14                           ((uint32_t)0x00000D00)
#define  RCC_LTDCDIV_DIV15                           ((uint32_t)0x00000E00)
#define  RCC_LTDCDIV_DIV16                           ((uint32_t)0x00000F00)
#define  RCC_LTDCDIV_DIV17                           ((uint32_t)0x00001000)
#define  RCC_LTDCDIV_DIV18                           ((uint32_t)0x00001100)
#define  RCC_LTDCDIV_DIV19                           ((uint32_t)0x00001200)
#define  RCC_LTDCDIV_DIV20                           ((uint32_t)0x00001300)
#define  RCC_LTDCDIV_DIV21                           ((uint32_t)0x00001400)
#define  RCC_LTDCDIV_DIV22                           ((uint32_t)0x00001500)
#define  RCC_LTDCDIV_DIV23                           ((uint32_t)0x00001600)
#define  RCC_LTDCDIV_DIV24                           ((uint32_t)0x00001700)
#define  RCC_LTDCDIV_DIV25                           ((uint32_t)0x00001800)
#define  RCC_LTDCDIV_DIV26                           ((uint32_t)0x00001900)
#define  RCC_LTDCDIV_DIV27                           ((uint32_t)0x00001A00)
#define  RCC_LTDCDIV_DIV28                           ((uint32_t)0x00001B00)
#define  RCC_LTDCDIV_DIV29                           ((uint32_t)0x00001C00)
#define  RCC_LTDCDIV_DIV30                           ((uint32_t)0x00001D00)
#define  RCC_LTDCDIV_DIV31                           ((uint32_t)0x00001E00)
#define  RCC_LTDCDIV_DIV32                           ((uint32_t)0x00001F00)
#define  RCC_LTDCDIV_DIV33                           ((uint32_t)0x00002000)
#define  RCC_LTDCDIV_DIV34                           ((uint32_t)0x00002100)
#define  RCC_LTDCDIV_DIV35                           ((uint32_t)0x00002200)
#define  RCC_LTDCDIV_DIV36                           ((uint32_t)0x00002300)
#define  RCC_LTDCDIV_DIV37                           ((uint32_t)0x00002400)
#define  RCC_LTDCDIV_DIV38                           ((uint32_t)0x00002500)
#define  RCC_LTDCDIV_DIV39                           ((uint32_t)0x00002600)
#define  RCC_LTDCDIV_DIV40                           ((uint32_t)0x00002700)
#define  RCC_LTDCDIV_DIV41                           ((uint32_t)0x00002800)
#define  RCC_LTDCDIV_DIV42                           ((uint32_t)0x00002900)
#define  RCC_LTDCDIV_DIV43                           ((uint32_t)0x00002A00)
#define  RCC_LTDCDIV_DIV44                           ((uint32_t)0x00002B00)
#define  RCC_LTDCDIV_DIV45                           ((uint32_t)0x00002C00)
#define  RCC_LTDCDIV_DIV46                           ((uint32_t)0x00002D00)
#define  RCC_LTDCDIV_DIV47                           ((uint32_t)0x00002E00)
#define  RCC_LTDCDIV_DIV48                           ((uint32_t)0x00002F00)
#define  RCC_LTDCDIV_DIV49                           ((uint32_t)0x00003000)
#define  RCC_LTDCDIV_DIV50                           ((uint32_t)0x00003100)
#define  RCC_LTDCDIV_DIV51                           ((uint32_t)0x00003200)
#define  RCC_LTDCDIV_DIV52                           ((uint32_t)0x00003300)
#define  RCC_LTDCDIV_DIV53                           ((uint32_t)0x00003400)
#define  RCC_LTDCDIV_DIV54                           ((uint32_t)0x00003500)
#define  RCC_LTDCDIV_DIV55                           ((uint32_t)0x00003600)
#define  RCC_LTDCDIV_DIV56                           ((uint32_t)0x00003700)
#define  RCC_LTDCDIV_DIV57                           ((uint32_t)0x00003800)
#define  RCC_LTDCDIV_DIV58                           ((uint32_t)0x00003900)
#define  RCC_LTDCDIV_DIV59                           ((uint32_t)0x00003A00)
#define  RCC_LTDCDIV_DIV60                           ((uint32_t)0x00003B00)
#define  RCC_LTDCDIV_DIV61                           ((uint32_t)0x00003C00)
#define  RCC_LTDCDIV_DIV62                           ((uint32_t)0x00003D00)
#define  RCC_LTDCDIV_DIV63                           ((uint32_t)0x00003E00)
#define  RCC_LTDCDIV_DIV64                           ((uint32_t)0x00003F00)

#define  RCC_LTDCSRC                                 ((uint32_t)0x0000C000)
#define  RCC_LTDCSRC_0                               ((uint32_t)0x00004000)
#define  RCC_LTDCSRC_1                               ((uint32_t)0x00008000)

