SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
#define  TKEY_CHARGE1_TKCG14                         ((uint32_t)0x7000)
#define  TKEY_CHARGE1_TKCG15                         ((uint32_t)0x38000)

/******************************************************************************/
/*                                  SDMMC                                       */
/******************************************************************************/
/*******************  Bit definition for SDMMC_ARGUMENT register  *******************/
#define  SDMMC_ARGUMENT                              ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for SDMMC_CMD_SET register  *******************/
#define  SDMMC_CMDIDX_MASK                           ((uint16_t)0x003F)
#define  SDMMC_RPTY_MASK                             ((uint16_t)0x0300)
#define  SDMMC_CKCRC                                 ((uint16_t)0x0400)
#define  SDMMC_CKIDX                                 ((uint16_t)0x0800)

/*******************  Bit definition for SDMMC_RESPONSE0 register  *******************/
#define  SDMMC_RESPONSE0                             ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for SDMMC_RESPONSE1 register  *******************/
#define  SDMMC_RESPONSE1                             ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for SDMMC_RESPONSE2 register  *******************/
#define  SDMMC_RESPONSE2                             ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for SDMMC_RESPONSE3 register  *******************/
#define  SDMMC_RESPONSE3                             ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for SDMMC_WRITE_CONT register  *******************/
#define  SDMMC_WRITE_CONT                            ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for SDMMC_CONTROL register  *******************/
#define  SDMMC_LW_MASK                               ((uint16_t)0x0003)
#define  SDMMC_LW_MASK_0                             ((uint16_t)0x0001)
#define  SDMMC_LW_MASK_1                             ((uint16_t)0x0002)

#define  SDMMC_ALL_CLR                               ((uint16_t)0x0004)
#define  SDMMC_DMAEN                                 ((uint16_t)0x0008)
#define  SDMMC_RST_LGC                               ((uint16_t)0x0010)
#define  SDMMC_NEGSMP                                ((uint16_t)0x0020)
#define  SDMMC_SLV_MODE                              ((uint16_t)0x0100)
#define  SDMMC_SLV_FORCE_ERR                         ((uint16_t)000200)

/*******************  Bit definition for SDMMC_TIMEOUT register  *******************/
#define  SDMMC_TOCNT_MASK                            ((uint8_t)0x0F)

/*******************  Bit definition for SDMMC_STATUS register  *******************/
#define  SDMMC_MASK_BLOCK_NUM                        ((uint16_t)0xFFFF)
#define  SDMMC_CMDSTA                                ((uint32_t)0x00010000)
#define  SDMMC_DAT0STA                               ((uint32_t)0x00020000)

/*******************  Bit definition for SDMMC_INT_FG register  *******************/
#define  SDMMC_IF_RE_TMOUT                           ((uint16_t)0x0001)
#define  SDMMC_IF_RECRC_WR                           ((uint16_t)0x0002)
#define  SDMMC_IF_REIDX_ER                           ((uint16_t)0x0004)
#define  SDMMC_IF_CMDDONE                            ((uint16_t)0x0008)
#define  SDMMC_IF_DATTMO                             ((uint16_t)0x0010)
#define  SDMMC_IF_TRANERR                            ((uint16_t)0x0020)
#define  SDMMC_IF_TRANDONE                           ((uint16_t)0x0040)
#define  SDMMC_IF_BKGAP                              ((uint16_t)0x0080)
#define  SDMMC_IF_FIFO_OV                            ((uint16_t)0x0100)
#define  SDMMC_IF_SDIOINT                            ((uint16_t)0x0200)
#define  SDMMC_SIF_SLV_BUF_RELEAS                    ((uint16_t)0x0400)

/*******************  Bit definition for SDMMC_INT_EN register  *******************/
#define  SDMMC_IE_RE_TMOUT                           ((uint16_t)0x0001)
#define  SDMMC_IE_RECRC_WR                           ((uint16_t)0x0002)
#define  SDMMC_IE_REIDX_ER                           ((uint16_t)0x0004)
#define  SDMMC_IE_CMDDONE                            ((uint16_t)0x0008)
#define  SDMMC_IE_DATTMO                             ((uint16_t)0x0010)
#define  SDMMC_IE_TRANERR                            ((uint16_t)0x0020)
#define  SDMMC_IE_TRANDONE                           ((uint16_t)0x0040)
#define  SDMMC_IE_FIFO_OV                            ((uint16_t)0x0080)
#define  SDMMC_IE_SDIOINT                            ((uint16_t)0x0100)

/*******************  Bit definition for SDMMC_DMA_BEG1 register  *******************/
#define  SDMMC_DMAAD1_MASK                           ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for SDMMC_BLOCK_CFG register  *******************/
#define  SDMMC_BKNUM_MASK                            ((uint32_t)0x0000FFFF)
#define  SDMMC_BKSIZE_MASK                           ((uint32_t)0x0FFF0000)

/*******************  Bit definition for SDMMC_TRAN_MODE register  *******************/
#define  SDMMC_DMA_DIR                               ((uint32_t)0x00000001)
#define  SDMMC_GAP_STOP                              ((uint32_t)0x00000002)
#define  SDMMC_MODE_BOOT                             ((uint32_t)0x00000004)
#define  SDMMC_AUTOGAPSTOP                           ((uint32_t)0x00000010)

#define  SDMMC_DMATN_CNT                             ((uint32_t)0x00007F00)

#define  SDMMC_DULEDMA_EN                            ((uint32_t)0x00010000)
#define  SDMMC_DDR_MODE                              ((uint32_t)0x00020000)
#define  SDMMC_CARE_NEG                              ((uint32_t)0x00040000)

#define  SDMMC_SW                                    ((uint32_t)0x00180000)
#define  SDMMC_SW_0                                  ((uint32_t)0x00080000)
#define  SDMMC_SW_1                                  ((uint32_t)0x00100000)

/*******************  Bit definition for SDMMC_CLK_DIV register  *******************/
#define  SDMMC_DIV_MASK                              ((uint32_t)0x0000001F)
#define  SDMMC_CLKOE                                 ((uint32_t)0x00000100)
#define  SDMMC_CLKMode                               ((uint32_t)0x00000200)
#define  SDMMC_PHASEINV                              ((uint32_t)0x00000400)

