SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
/*******************  Bit definition for SDMMC_CLK_DIV register  *******************/
#define  EMMC_DIV_MASK                               SDMMC_DIV_MASK
#define  EMMC_CLKOE                                  SDMMC_CLKOE
#define  EMMC_CLKMode                                SDMMC_CLKMode
#define  EMMC_PHASEINV                               SDMMC_PHASEINV

/*******************  Bit definition for SDMMC_DMA_BEG2 register  *******************/
#define  EMMC_DMAAD2_MASK                            SDMMC_DMAAD2_MASK

/*******************  Bit definition for SDMMC_TUNE_DATO register  *******************/
#define  EMMC_TUNNE_DAT0_O                           SDMMC_TUNNE_DAT0_O
#define  EMMC_TUNNE_DAT1_O                           SDMMC_TUNNE_DAT1_O
#define  EMMC_TUNNE_DAT2_O                           SDMMC_TUNNE_DAT2_O
#define  EMMC_TUNNE_DAT3_O                           SDMMC_TUNNE_DAT3_O
#define  EMMC_TUNNE_DAT4_O                           SDMMC_TUNNE_DAT4_O
#define  EMMC_TUNNE_DAT5_O                           SDMMC_TUNNE_DAT5_O
#define  EMMC_TUNNE_DAT6_O                           SDMMC_TUNNE_DAT6_O
#define  EMMC_TUNNE_DAT7_O                           SDMMC_TUNNE_DAT7_O

/*******************  Bit definition for SDMMC_TUNE_DATI register  *******************/
#define  EMMC_TUNNE_DAT0_I                           SDMMC_TUNNE_DAT0_I
#define  EMMC_TUNNE_DAT1_I                           SDMMC_TUNNE_DAT1_I
#define  EMMC_TUNNE_DAT2_I                           SDMMC_TUNNE_DAT2_I
#define  EMMC_TUNNE_DAT3_I                           SDMMC_TUNNE_DAT3_I
#define  EMMC_TUNNE_DAT4_I                           SDMMC_TUNNE_DAT4_I
#define  EMMC_TUNNE_DAT5_I                           SDMMC_TUNNE_DAT5_I
#define  EMMC_TUNNE_DAT6_I                           SDMMC_TUNNE_DAT6_I
#define  EMMC_TUNNE_DAT7_I                           SDMMC_TUNNE_DAT7_I

/*******************  Bit definition for SDMMC_TUNE_CLK_CMD register  *******************/
#define  EMMC_TUNNE_CLK_O                            SDMMC_TUNNE_CLK_O
#define  EMMC_TUNNE_CLK_I                            SDMMC_TUNNE_CLK_I
#define  EMMC_TUNNE_CMD_O                            SDMMC_TUNNE_CMD_O
#define  EMMC_TUNNE_CMD_I                            SDMMC_TUNNE_CMD_I

/******************************************************************************/
/*                                  SAI                                       */
/******************************************************************************/
/*******************  Bit definition for SAI_xCFGR1 register  *******************/
#define  SAI_CFGR1_MODE                              ((uint32_t)0x00000003)
#define  SAI_CFGR1_MODE_0                            ((uint32_t)0x00000001)
#define  SAI_CFGR1_MODE_1                            ((uint32_t)0x00000002)

#define  SAI_CFGR1_PRTCFG                            ((uint32_t)0x0000000C)
#define  SAI_CFGR1_PRTCFG_0                          ((uint32_t)0x00000004)
#define  SAI_CFGR1_PRTCFG_1                          ((uint32_t)0x00000008)

#define  SAI_CFGR1_DS                                ((uint32_t)0x000000E0)
#define  SAI_CFGR1_DS_0                              ((uint32_t)0x00000020)
#define  SAI_CFGR1_DS_1                              ((uint32_t)0x00000040)
#define  SAI_CFGR1_DS_2                              ((uint32_t)0x00000080)

#define  SAI_CFGR1_LSBFIRST                          ((uint32_t)0x00000100)
#define  SAI_CFGR1_CKSTR                             ((uint32_t)0x00000200)

#define  SAI_CFGR1_SYNCEN                            ((uint32_t)0x00000C00)
#define  SAI_CFGR1_SYNCEN_0                          ((uint32_t)0x00000400)
#define  SAI_CFGR1_SYNCEN_1                          ((uint32_t)0x00000800)
#define  SAI_CFGR1_MONO                              ((uint32_t)0x00001000)
#define  SAI_CFGR1_EN                                ((uint32_t)0x00010000)
#define  SAI_CFGR1_DMAEN                             ((uint32_t)0x00020000)
#define  SAI_CFGR1_NODIV                             ((uint32_t)0x00080000)
#define  SAI_CFGR1_MCKDIV                            ((uint32_t)0x03F00000)
#define  SAI_CFGR1_OSR                               ((uint32_t)0x04000000)

/*******************  Bit definition for SAI_xCFGR2 register  *******************/
#define  SAI_CFGR2_FTH                               ((uint32_t)0x00000007)
#define  SAI_CFGR2_FTH_0                             ((uint32_t)0x00000001)
#define  SAI_CFGR2_FTH_1                             ((uint32_t)0x00000002)
#define  SAI_CFGR2_FTH_2                             ((uint32_t)0x00000004)

#define  SAI_CFGR2_FFLUSH                            ((uint32_t)0x00000008)
#define  SAI_CFGR2_TRIS                              ((uint32_t)0x00000010)
#define  SAI_CFGR2_MUTE                              ((uint32_t)0x00000020)
#define  SAI_CFGR2_MUTEVAL                           ((uint32_t)0x00000040)

#define  SAI_CFGR2_MUTECNT                           ((uint32_t)0x00001F80)

#define  SAI_CFGR2_CPL                               ((uint32_t)0x00002000)
#define  SAI_CFGR2_COMP                              ((uint32_t)0x0000C000)

/*******************  Bit definition for SAI_xFRCR register  *******************/
#define  SAI_FRCR_FRL                                ((uint32_t)0x000000FF)

#define  SAI_FRCR_FSALL                              ((uint32_t)0x00007F00)
#define  SAI_FRCR_FSDEF                              ((uint32_t)0x00010000)
#define  SAI_FRCR_FSPOL                              ((uint32_t)0x00020000)
#define  SAI_FRCR_FSOFF                              ((uint32_t)0x00040000)

/*******************  Bit definition for SAI_xSLOTR register  *******************/
#define  SAI_SLOTR_FBOFF                             ((uint32_t)0x0000001F)
#define  SAI_SLOTR_SLOTSZ                            ((uint32_t)0x000000C0)
#define  SAI_SLOTR_NBSLOT                            ((uint32_t)0x00000F00)
#define  SAI_SLOTR_SLOTEN                            ((uint32_t)0xFFFF0000)

/*******************  Bit definition for SAI_xINTENR register  *******************/
#define  SAI_INTENR_OVRUDRIE                         ((uint32_t)0x00000001)
#define  SAI_INTENR_MUTEDETIE                        ((uint32_t)0x00000002)
#define  SAI_INTENR_WCKCFGIE                         ((uint32_t)0x00000004)
#define  SAI_INTENR_FREQIE                           ((uint32_t)0x00000008)
#define  SAI_INTENR_CNRDYIE                          ((uint32_t)0x00000010)
#define  SAI_INTENR_AFSDETIE                         ((uint32_t)0x00000020)
#define  SAI_INTENR_LFSDETIE                         ((uint32_t)0x00000040)

/*********************  Bit definition for SAI_xSR register  *********************/
#define  SAI_SR_OVRUDR                               ((uint32_t)0x00000001)
#define  SAI_SR_MUTEDET                              ((uint32_t)0x00000002)
#define  SAI_SR_WCKCFG                               ((uint32_t)0x00000004)
#define  SAI_SR_FREQ                                 ((uint32_t)0x00000008)
#define  SAI_SR_CNRDY                                ((uint32_t)0x00000010)
#define  SAI_SR_AFSDET                               ((uint32_t)0x00000020)
#define  SAI_SR_LFSDET                               ((uint32_t)0x00000040)

#define  SAI_SR_FLTH                                 ((uint32_t)0x00070000)
#define  SAI_SR_FLTH_0                               ((uint32_t)0x00010000)
#define  SAI_SR_FLTH_1                               ((uint32_t)0x00020000)
#define  SAI_SR_FLTH_2                               ((uint32_t)0x00030000)

/*********************  Bit definition for SAI_xDATAR register  *********************/
#define  SAI_DATAR_DR                                ((uint32_t)0xFFFFFFFF)

/******************************************************************************/
/*                                 SERDES                                     */
/******************************************************************************/
/*********************  Bit definition for SERDES_CTRL register  *********************/
#define  SDS_CLR_ALL                                 ((uint32_t)0x00000001)
#define  SDS_RESET_LINK                              ((uint32_t)0x00000002)
#define  SDS_RESET_PHY                               ((uint32_t)0x00000004)
#define  SDS_INT_BUSY_EN                             ((uint32_t)0x00000008)
#define  SDS_RX_POLARITY                             ((uint32_t)0x00000010)
#define  SDS_RX_EN                                   ((uint32_t)0x00000020)
#define  SDS_TX_EN                                   ((uint32_t)0x00000040)
#define  SDS_DMA_EN                                  ((uint32_t)0x00000080)
#define  SDS_PLL_FACTOR                              ((uint32_t)0x00001F00)
#define  SDS_PLL_PWR_UP                              ((uint32_t)0x00002000)
#define  SDS_RX_PWR_UP                               ((uint32_t)0x00004000)
#define  SDS_TX_PWR_UP                               ((uint32_t)0x00008000)
#define  SDS_PHY_PWR_UP                              ((uint32_t)0x00010000)
#define  SDS_CONT_EN                                 ((uint32_t)0x00020000)
#define  SDS_ALIGN_EN                                ((uint32_t)0x00040000)



/*********************  Bit definition for SERDES_INT_EN register  *********************/
#define  SDS_PHYRDY_IE                               ((uint32_t)0x00000001)
#define  SDS_RECV_ERR_IE                             ((uint32_t)0x00000002)
#define  SDS_TRAN_DONE_IE                            ((uint32_t)0x00000002)
#define  SDS_RECV_DONE_IE                            ((uint32_t)0x00000004)
#define  SDS_FIFO_OV_IE                              ((uint32_t)0x00000008)
#define  SDS_COMINIT_IE                              ((uint32_t)0x00000020)

