SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
#define  FMC_BCR4_FMCEN                              ((uint32_t)0x80000000)

/*******************  Bit definition for FMC_BTR1 register  *******************/
#define  FMC_BTR1_ADDSET                             ((uint32_t)0x0000000F)
#define  FMC_BTR1_ADDSET_0                           ((uint32_t)0x00000001)
#define  FMC_BTR1_ADDSET_1                           ((uint32_t)0x00000002)
#define  FMC_BTR1_ADDSET_2                           ((uint32_t)0x00000004)
#define  FMC_BTR1_ADDSET_3                           ((uint32_t)0x00000008)

#define  FMC_BTR1_ADDHLD                             ((uint32_t)0x000000F0)
#define  FMC_BTR1_ADDHLD_0                           ((uint32_t)0x00000010)
#define  FMC_BTR1_ADDHLD_1                           ((uint32_t)0x00000020)
#define  FMC_BTR1_ADDHLD_2                           ((uint32_t)0x00000040)
#define  FMC_BTR1_ADDHLD_3                           ((uint32_t)0x00000080)

#define  FMC_BTR1_DATAST                             ((uint32_t)0x0000FF00)
#define  FMC_BTR1_DATAST_0                           ((uint32_t)0x00000100)
#define  FMC_BTR1_DATAST_1                           ((uint32_t)0x00000200)
#define  FMC_BTR1_DATAST_2                           ((uint32_t)0x00000400)
#define  FMC_BTR1_DATAST_3                           ((uint32_t)0x00000800)
#define  FMC_BTR1_DATAST_4                           ((uint32_t)0x00001000)
#define  FMC_BTR1_DATAST_5                           ((uint32_t)0x00002000)
#define  FMC_BTR1_DATAST_6                           ((uint32_t)0x00004000)
#define  FMC_BTR1_DATAST_7                           ((uint32_t)0x00008000)

#define  FMC_BTR1_BUSTURN                            ((uint32_t)0x000F0000)
#define  FMC_BTR1_BUSTURN_0                          ((uint32_t)0x00010000)
#define  FMC_BTR1_BUSTURN_1                          ((uint32_t)0x00020000)
#define  FMC_BTR1_BUSTURN_2                          ((uint32_t)0x00040000)
#define  FMC_BTR1_BUSTURN_3                          ((uint32_t)0x00080000)

#define  FMC_BTR1_CLKDIV                             ((uint32_t)0x00F00000)
#define  FMC_BTR1_CLKDIV_0                           ((uint32_t)0x00100000)
#define  FMC_BTR1_CLKDIV_1                           ((uint32_t)0x00200000)
#define  FMC_BTR1_CLKDIV_2                           ((uint32_t)0x00400000)
#define  FMC_BTR1_CLKDIV_3                           ((uint32_t)0x00800000)

#define  FMC_BTR1_DATLAT                             ((uint32_t)0x0F000000)
#define  FMC_BTR1_DATLAT_0                           ((uint32_t)0x01000000)
#define  FMC_BTR1_DATLAT_1                           ((uint32_t)0x02000000)
#define  FMC_BTR1_DATLAT_2                           ((uint32_t)0x04000000)
#define  FMC_BTR1_DATLAT_3                           ((uint32_t)0x08000000)

#define  FMC_BTR1_ACCMOD                             ((uint32_t)0x30000000)
#define  FMC_BTR1_ACCMOD_0                           ((uint32_t)0x10000000)
#define  FMC_BTR1_ACCMOD_1                           ((uint32_t)0x20000000)

/*******************  Bit definition for FMC_BTR2 register  *******************/
#define  FMC_BTR2_ADDSET                             ((uint32_t)0x0000000F)
#define  FMC_BTR2_ADDSET_0                           ((uint32_t)0x00000001)
#define  FMC_BTR2_ADDSET_1                           ((uint32_t)0x00000002)
#define  FMC_BTR2_ADDSET_2                           ((uint32_t)0x00000004)
#define  FMC_BTR2_ADDSET_3                           ((uint32_t)0x00000008)

#define  FMC_BTR2_ADDHLD                             ((uint32_t)0x000000F0)
#define  FMC_BTR2_ADDHLD_0                           ((uint32_t)0x00000010)
#define  FMC_BTR2_ADDHLD_1                           ((uint32_t)0x00000020)
#define  FMC_BTR2_ADDHLD_2                           ((uint32_t)0x00000040)
#define  FMC_BTR2_ADDHLD_3                           ((uint32_t)0x00000080)

#define  FMC_BTR2_DATAST                             ((uint32_t)0x0000FF00)
#define  FMC_BTR2_DATAST_0                           ((uint32_t)0x00000100)
#define  FMC_BTR2_DATAST_1                           ((uint32_t)0x00000200)
#define  FMC_BTR2_DATAST_2                           ((uint32_t)0x00000400)
#define  FMC_BTR2_DATAST_3                           ((uint32_t)0x00000800)
#define  FMC_BTR2_DATAST_4                           ((uint32_t)0x00001000)
#define  FMC_BTR2_DATAST_5                           ((uint32_t)0x00002000)
#define  FMC_BTR2_DATAST_6                           ((uint32_t)0x00004000)
#define  FMC_BTR2_DATAST_7                           ((uint32_t)0x00008000)

#define  FMC_BTR2_BUSTURN                            ((uint32_t)0x000F0000)
#define  FMC_BTR2_BUSTURN_0                          ((uint32_t)0x00010000)
#define  FMC_BTR2_BUSTURN_1                          ((uint32_t)0x00020000)
#define  FMC_BTR2_BUSTURN_2                          ((uint32_t)0x00040000)
#define  FMC_BTR2_BUSTURN_3                          ((uint32_t)0x00080000)

#define  FMC_BTR2_CLKDIV                             ((uint32_t)0x00F00000)
#define  FMC_BTR2_CLKDIV_0                           ((uint32_t)0x00100000)
#define  FMC_BTR2_CLKDIV_1                           ((uint32_t)0x00200000)
#define  FMC_BTR2_CLKDIV_2                           ((uint32_t)0x00400000)
#define  FMC_BTR2_CLKDIV_3                           ((uint32_t)0x00800000)

#define  FMC_BTR2_DATLAT                             ((uint32_t)0x0F000000)
#define  FMC_BTR2_DATLAT_0                           ((uint32_t)0x01000000)
#define  FMC_BTR2_DATLAT_1                           ((uint32_t)0x02000000)
#define  FMC_BTR2_DATLAT_2                           ((uint32_t)0x04000000)
#define  FMC_BTR2_DATLAT_3                           ((uint32_t)0x08000000)

#define  FMC_BTR2_ACCMOD                             ((uint32_t)0x30000000)
#define  FMC_BTR2_ACCMOD_0                           ((uint32_t)0x10000000)
#define  FMC_BTR2_ACCMOD_1                           ((uint32_t)0x20000000)

/*******************  Bit definition for FMC_BTR3 register  *******************/
#define  FMC_BTR3_ADDSET                             ((uint32_t)0x0000000F)
#define  FMC_BTR3_ADDSET_0                           ((uint32_t)0x00000001)
#define  FMC_BTR3_ADDSET_1                           ((uint32_t)0x00000002)
#define  FMC_BTR3_ADDSET_2                           ((uint32_t)0x00000004)
#define  FMC_BTR3_ADDSET_3                           ((uint32_t)0x00000008)

