SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
#define  FMC_BWTR4_BUSTURN                           ((uint32_t)0x000F0000)
#define  FMC_BWTR4_BUSTURN_0                         ((uint32_t)0x00010000)
#define  FMC_BWTR4_BUSTURN_1                         ((uint32_t)0x00020000)
#define  FMC_BWTR4_BUSTURN_2                         ((uint32_t)0x00040000)
#define  FMC_BWTR4_BUSTURN_3                         ((uint32_t)0x00080000)

#define  FMC_BWTR4_ACCMOD                            ((uint32_t)0x30000000)
#define  FMC_BWTR4_ACCMOD_0                          ((uint32_t)0x10000000)
#define  FMC_BWTR4_ACCMOD_1                          ((uint32_t)0x20000000)

/*******************  Bit definition for FMC_PCR register  *******************/
#define  FMC_PCR_PWAITEN                             ((uint32_t)0x00000020)
#define  FMC_PCR_PBKEN                               ((uint32_t)0x00000040)
#define  FMC_PCR_PTYP                                ((uint32_t)0x00000080)
#define  FMC_PCR_PWID                                ((uint32_t)0x00000300)
#define  FMC_PCR_PWID_0                              ((uint32_t)0x00000100)
#define  FMC_PCR_PWID_1                              ((uint32_t)0x00000200)

#define  FMC_PCR_ECCEN                               ((uint32_t)0x00000400)

#define  FMC_PCR_TCLR                                ((uint32_t)0x00001E00)
#define  FMC_PCR_TCLR_0                              ((uint32_t)0x00000200)
#define  FMC_PCR_TCLR_1                              ((uint32_t)0x00000400)
#define  FMC_PCR_TCLR_2                              ((uint32_t)0x00000800)
#define  FMC_PCR_TCLR_3                              ((uint32_t)0x00001000)

#define  FMC_PCR_TAR                                 ((uint32_t)0x0001E000)
#define  FMC_PCR_TAR_0                               ((uint32_t)0x00002000)
#define  FMC_PCR_TAR_1                               ((uint32_t)0x00004000)
#define  FMC_PCR_TAR_2                               ((uint32_t)0x00008000)
#define  FMC_PCR_TAR_3                               ((uint32_t)0x00010000)

#define  FMC_PCR_ECCPS                               ((uint32_t)0x000E0000)
#define  FMC_PCR_ECCPS_0                             ((uint32_t)0x00020000)
#define  FMC_PCR_ECCPS_1                             ((uint32_t)0x00040000)
#define  FMC_PCR_ECCPS_2                             ((uint32_t)0x00080000)

/*******************  Bit definition for FMC_SR register  *******************/
#define  FMC_SR_IRS                                  ((uint32_t)0x00000001)
#define  FMC_SR_ILS                                  ((uint32_t)0x00000002)
#define  FMC_SR_IFS                                  ((uint32_t)0x00000004)
#define  FMC_SR_IREN                                 ((uint32_t)0x00000008)
#define  FMC_SR_ILEN                                 ((uint32_t)0x00000010)
#define  FMC_SR_IFEN                                 ((uint32_t)0x00000020)
#define  FMC_SR_FEMPT                                ((uint32_t)0x00000040)

/*******************  Bit definition for FMC_PMEM register  *******************/
#define  FMC_PMEM_MEMSET                             ((uint32_t)0x000000FF)
#define  FMC_PMEM_MEMWAIT                            ((uint32_t)0x0000FF00)
#define  FMC_PMEM_MEMHOLD                            ((uint32_t)0x00FF0000)
#define  FMC_PMEM_MEMHIZ                             ((uint32_t)0xFF000000)

/*******************  Bit definition for FMC_PATT register  *******************/
#define  FMC_PATT_ATTSET                             ((uint32_t)0x000000FF)
#define  FMC_PATT_ATTWAIT                            ((uint32_t)0x0000FF00)
#define  FMC_PATT_ATTHOLD                            ((uint32_t)0x00FF0000)
#define  FMC_PATT_ATTHIZ                             ((uint32_t)0xFF000000)

/*******************  Bit definition for FMC_ECCR register  *******************/
#define  FMC_ECCR_ECC                                ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for FMC_SDCR1 register  *******************/
#define  FMC_SDCR1_NC                                ((uint32_t)0x00000003)
#define  FMC_SDCR1_NC_0                              ((uint32_t)0x00000001)
#define  FMC_SDCR1_NC_1                              ((uint32_t)0x00000002)

#define  FMC_SDCR1_NR                                ((uint32_t)0x0000000C)
#define  FMC_SDCR1_NR_0                              ((uint32_t)0x00000004)
#define  FMC_SDCR1_NR_1                              ((uint32_t)0x00000008)

#define  FMC_SDCR1_MWID                              ((uint32_t)0x00000030)
#define  FMC_SDCR1_MWID_0                            ((uint32_t)0x00000010)
#define  FMC_SDCR1_MWID_1                            ((uint32_t)0x00000020)

#define  FMC_SDCR1_NB                                ((uint32_t)0x00000040)
#define  FMC_SDCR1_CAS                               ((uint32_t)0x00000180)
#define  FMC_SDCR1_CAS_0                             ((uint32_t)0x00000080)
#define  FMC_SDCR1_CAS_1                             ((uint32_t)0x00000100)

#define  FMC_SDCR1_WP                                ((uint32_t)0x00000200)
#define  FMC_SDCR1_SDCLK                             ((uint32_t)0x00000C00)
#define  FMC_SDCR1_SDCLK_0                           ((uint32_t)0x00000400)
#define  FMC_SDCR1_SDCLK_1                           ((uint32_t)0x00000800)

#define  FMC_SDCR1_RBURST                            ((uint32_t)0x00001000)

#define  FMC_SDCR1_RPIPE                             ((uint32_t)0x00006000)
#define  FMC_SDCR1_RPIPE_0                           ((uint32_t)0x00002000)
#define  FMC_SDCR1_RPIPE_1                           ((uint32_t)0x00004000)

/*******************  Bit definition for FMC_SDCR2 register  *******************/
#define  FMC_SDCR2_NC                                ((uint32_t)0x00000003)
#define  FMC_SDCR2_NC_0                              ((uint32_t)0x00000001)
#define  FMC_SDCR2_NC_1                              ((uint32_t)0x00000002)

#define  FMC_SDCR2_NR                                ((uint32_t)0x0000000C)
#define  FMC_SDCR2_NR_0                              ((uint32_t)0x00000004)
#define  FMC_SDCR2_NR_1                              ((uint32_t)0x00000008)

#define  FMC_SDCR2_MWID                              ((uint32_t)0x00000030)
#define  FMC_SDCR2_MWID_0                            ((uint32_t)0x00000010)
#define  FMC_SDCR2_MWID_1                            ((uint32_t)0x00000020)

#define  FMC_SDCR2_NB                                ((uint32_t)0x00000040)
#define  FMC_SDCR2_CAS                               ((uint32_t)0x00000180)
#define  FMC_SDCR2_CAS_0                             ((uint32_t)0x00000080)
#define  FMC_SDCR2_CAS_1                             ((uint32_t)0x00000100)

#define  FMC_SDCR2_WP                                ((uint32_t)0x00000200)
#define  FMC_SDCR2_SDCLK                             ((uint32_t)0x00000C00)
#define  FMC_SDCR2_SDCLK_0                           ((uint32_t)0x00000400)
#define  FMC_SDCR2_SDCLK_1                           ((uint32_t)0x00000800)

#define  FMC_SDCR2_RBURST                            ((uint32_t)0x00001000)

#define  FMC_SDCR2_RPIPE                             ((uint32_t)0x00006000)
#define  FMC_SDCR2_RPIPE_0                           ((uint32_t)0x00002000)
#define  FMC_SDCR2_RPIPE_1                           ((uint32_t)0x00004000)

