SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
/*******************  Bit definition for FMC_SDSR register  *******************/
#define  FMC_SDSR_RE                                 ((uint32_t)0x00000001)

#define  FMC_SDSR_MODES1                             ((uint32_t)0x00000006)
#define  FMC_SDSR_MODES1_0                           ((uint32_t)0x00000002)
#define  FMC_SDSR_MODES1_1                           ((uint32_t)0x00000004)

#define  FMC_SDSR_MODES2                             ((uint32_t)0x00000018)
#define  FMC_SDSR_MODES2_0                           ((uint32_t)0x00000008)
#define  FMC_SDSR_MODES2_1                           ((uint32_t)0x00000010)

#define  FMC_SDSR_BUSY                               ((uint32_t)0x00000020)

/*******************  Bit definition for FMC_MISC register  *******************/
#define  FMC_MISC_NRFS_CNT                           ((uint32_t)0x0000000F)
#define  FMC_MISC_NRFS_CNT_0                         ((uint32_t)0x00000001)
#define  FMC_MISC_NRFS_CNT_1                         ((uint32_t)0x00000002)
#define  FMC_MISC_NRFS_CNT_2                         ((uint32_t)0x00000004)
#define  FMC_MISC_NRFS_CNT_3                         ((uint32_t)0x00000008)

#define  FMC_MISC_Phase_Sel                          ((uint32_t)0x000000F0)
#define  FMC_MISC_Phase_Sel_0                        ((uint32_t)0x00000010)
#define  FMC_MISC_Phase_Sel_1                        ((uint32_t)0x00000020)
#define  FMC_MISC_Phase_Sel_2                        ((uint32_t)0x00000040)
#define  FMC_MISC_Phase_Sel_3                        ((uint32_t)0x00000080)

#define  FMC_MISC_Enhance_read_mode                  ((uint32_t)0x00001000)
#define  FMC_MISC_En_Bank1                           ((uint32_t)0x00010000)
#define  FMC_MISC_En_Bank2                           ((uint32_t)0x00020000)

/******************************************************************************/
/*                                 ECDC                                      */
/******************************************************************************/
/*******************  Bit definition for ECDC_CTRL register  *******************/
#define  ECDC_KEYEX_EN                               ((uint32_t)0x00000001)
#define  ECDC_NORMAL_EN                              ((uint32_t)0x00000002)
#define  ECDC_MODE_SEL                               ((uint32_t)0x00000008)

#define  ECDC_CLKDIV_MASK                            ((uint32_t)0x00000070)

#define  ECDC_WRSRAM_EN                              ((uint32_t)0x00000080)
#define  ECDC_ALGRM_MOD                              ((uint32_t)0x00000100)
#define  ECDC_CIPHER_MOD                             ((uint32_t)0x00000200)

#define  ECDC_KLEN_MASK                              ((uint32_t)0x00000C00)

#define  ECDC_DAT_MOD                                ((uint32_t)0x00002000)

#define  ECDC_IE_SINGLE                              ((uint32_t)0x00020000)
#define  ECDC_IE_WRSRAM                              ((uint32_t)0x00040000)

#define  ECDC_CLOCK_SELECT                           ((uint32_t)0x01000000)
#define  ECDC_ECDC_SM4_CLOCK_EN                      ((uint32_t)0x02000000)

/*******************  Bit definition for ECDC_INT_FG register  *******************/
#define  ECDC_IF_EKDONE                              ((uint32_t)0x00010000)
#define  ECDC_IF_SINGLE                              ((uint32_t)0x00020000)
#define  ECDC_IF_WRSRAM                              ((uint32_t)0x00040000)

/*******************  Bit definition for ECDC_KEY register  *******************/
#define  ECDC_KEY_255T224                            ((uint32_t)0xFFFFFFFF)
#define  ECDC_KEY_223T192                            ((uint32_t)0xFFFFFFFF)
#define  ECDC_KEY_191T160                            ((uint32_t)0xFFFFFFFF)
#define  ECDC_KEY_159T128                            ((uint32_t)0xFFFFFFFF)
#define  ECDC_KEY_127T96                             ((uint32_t)0xFFFFFFFF)
#define  ECDC_KEY_95T64                              ((uint32_t)0xFFFFFFFF)
#define  ECDC_KEY_63T32                              ((uint32_t)0xFFFFFFFF)
#define  ECDC_KEY_31T0                               ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for ECDC_IV register  *******************/
#define  ECDC_IV_127T96                              ((uint32_t)0xFFFFFFFF)
#define  ECDC_IV_95T64                               ((uint32_t)0xFFFFFFFF)
#define  ECDC_IV_63T32                               ((uint32_t)0xFFFFFFFF)
#define  ECDC_IV_31T0                                ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for ECDC_SGSD register  *******************/
#define  ECDC_SGSD_127T96                            ((uint32_t)0xFFFFFFFF)
#define  ECDC_SGSD_95T64                             ((uint32_t)0xFFFFFFFF)
#define  ECDC_SGSD_63T32                             ((uint32_t)0xFFFFFFFF)
#define  ECDC_SGSD_31T0                              ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for ECDC_SGRT register  *******************/
#define  ECDC_SGRT_127T96                            ((uint32_t)0xFFFFFFFF)
#define  ECDC_SGRT_95T64                             ((uint32_t)0xFFFFFFFF)
#define  ECDC_SGRT_63T32                             ((uint32_t)0xFFFFFFFF)
#define  ECDC_SGRT_31T0                              ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for ECDC_SRC_ADDR register  *******************/
#define  ECDC_SRAM_SRC_ADDR                          ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for ECDC_DST_ADDR register  *******************/
#define  ECDC_SRAM_DST_ADDR                          ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for ECDC_SRAM_LEN register  *******************/
#define  ECDC_SRAM_LEN                               ((uint32_t)0xFFFFFFFF)

/******************************************************************************/
/*                                 DFSDM                                      */
/******************************************************************************/
/*******************  Bit definition for DFSDM_CFGR1 register  *******************/
#define  DFSDM_CFGR1_SITP                            ((uint32_t)0x00000003)
#define  DFSDM_CFGR1_SITP_0                          ((uint32_t)0x00000001)
#define  DFSDM_CFGR1_SITP_1                          ((uint32_t)0x00000002)

