SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
#define  DFSDM_CFGR1_SPICKSEL                        ((uint32_t)0x0000000C)
#define  DFSDM_CFGR1_SPICKSEL_0                      ((uint32_t)0x00000004)
#define  DFSDM_CFGR1_SPICKSEL_1                      ((uint32_t)0x00000008)

#define  DFSDM_CFGR1_SCDEN                           ((uint32_t)0x00000020)
#define  DFSDM_CFGR1_CKABEN                          ((uint32_t)0x00000040)
#define  DFSDM_CFGR1_CHEN                            ((uint32_t)0x00000080)
#define  DFSDM_CFGR1_CHINSEL                         ((uint32_t)0x00000100)

#define  DFSDM_CFGR1_DATMPX                          ((uint32_t)0x00003000)
#define  DFSDM_CFGR1_DATMPX_0                        ((uint32_t)0x00001000)
#define  DFSDM_CFGR1_DATMPX_1                        ((uint32_t)0x00002000)

#define  DFSDM_CFGR1_DATPACK                         ((uint32_t)0x0000C000)
#define  DFSDM_CFGR1_DATPACK_0                       ((uint32_t)0x00004000)
#define  DFSDM_CFGR1_DATPACK_1                       ((uint32_t)0x00008000)

#define  DFSDM_CFGR1_CKOUTDIV                        ((uint32_t)0x00FF0000)

#define  DFSDM_CFGR1_CKOUTSRC                        ((uint32_t)0x40000000)
#define  DFSDM_CFGR1_DFSDMEN                         ((uint32_t)0x80000000)

/*******************  Bit definition for DFSDM_CFGR2 register  *******************/
#define  DFSDM_CFGR2_DTRBS                           ((uint32_t)0x000000F8)
#define  DFSDM_CFGR2_OFFSET                          ((uint32_t)0xFFFFFF00)

/*******************  Bit definition for DFSDM_AWSCDR register  *******************/
#define  DFSDM_AWSCDR_SCDT                           ((uint32_t)0x000000FF)

#define  DFSDM_AWSCDR_BKSCD                          ((uint32_t)0x00003000)
#define  DFSDM_AWSCDR_BKSCD_0                        ((uint32_t)0x00001000)
#define  DFSDM_AWSCDR_BKSCD_1                        ((uint32_t)0x00002000)

#define  DFSDM_AWSCDR_AWFOSR                         ((uint32_t)0x001F0000)
#define  DFSDM_AWSCDR_AWFOSR_0                       ((uint32_t)0x00010000)
#define  DFSDM_AWSCDR_AWFOSR_1                       ((uint32_t)0x00020000)
#define  DFSDM_AWSCDR_AWFOSR_2                       ((uint32_t)0x00040000)
#define  DFSDM_AWSCDR_AWFOSR_3                       ((uint32_t)0x00080000)
#define  DFSDM_AWSCDR_AWFOSR_4                       ((uint32_t)0x00100000)

#define  DFSDM_AWSCDR_AWFORD                         ((uint32_t)0x00C00000)
#define  DFSDM_AWSCDR_AWFORD_0                       ((uint32_t)0x00400000)
#define  DFSDM_AWSCDR_AWFORD_1                       ((uint32_t)0x00800000)

/*******************  Bit definition for DFSDM_WDATR register  *******************/
#define  DFSDM_WDATR                                 ((uint16_t)0xFFFF)

/*******************  Bit definition for DFSDM_DATINR register  *******************/
#define  DFSDM_DATINR_INDAT0                         ((uint32_t)0x0000FFFF)
#define  DFSDM_DATINR_INDAT1                         ((uint32_t)0xFFFF0000)

/*******************  Bit definition for DFSDM_FLTCR1 register  *******************/
#define  DFSDM_FLTCR1_DFEN                           ((uint32_t)0x00000001)
#define  DFSDM_FLTCR1_JSWSTART                       ((uint32_t)0x00000002)
#define  DFSDM_FLTCR1_JSYNC                          ((uint32_t)0x00000008)
#define  DFSDM_FLTCR1_JSCAN                          ((uint32_t)0x00000010)
#define  DFSDM_FLTCR1_JDMAEN                         ((uint32_t)0x00000020)

#define  DFSDM_FLTCR1_JEXTSEL                        ((uint32_t)0x00000F00)
#define  DFSDM_FLTCR1_JEXTSEL_0                      ((uint32_t)0x00000100)
#define  DFSDM_FLTCR1_JEXTSEL_1                      ((uint32_t)0x00000200)
#define  DFSDM_FLTCR1_JEXTSEL_2                      ((uint32_t)0x00000400)
#define  DFSDM_FLTCR1_JEXTSEL_3                      ((uint32_t)0x00000800)

#define  DFSDM_FLTCR1_JEXTEN                         ((uint32_t)0x00006000)
#define  DFSDM_FLTCR1_JEXTEN_0                       ((uint32_t)0x00002000)
#define  DFSDM_FLTCR1_JEXTEN_1                       ((uint32_t)0x00004000)

#define  DFSDM_FLTCR1_RSWSTART                       ((uint32_t)0x00020000)
#define  DFSDM_FLTCR1_RCONT                          ((uint32_t)0x00040000)
#define  DFSDM_FLTCR1_RSYNC                          ((uint32_t)0x00080000)

#define  DFSDM_FLTCR1_RDMAEN                         ((uint32_t)0x00200000)

#define  DFSDM_FLTCR1_RCH                            ((uint32_t)0x01000000)

#define  DFSDM_FLTCR1_FAST                           ((uint32_t)0x20000000)
#define  DFSDM_FLTCR1_AWFSEL                         ((uint32_t)0x40000000)

/*******************  Bit definition for DFSDM_FLTCR2 register  *******************/
#define  DFSDM_FLTCR2_JEOCIE                         ((uint32_t)0x00000001)
#define  DFSDM_FLTCR2_REOCIE                         ((uint32_t)0x00000002)
#define  DFSDM_FLTCR2_JOVRIE                         ((uint32_t)0x00000004)
#define  DFSDM_FLTCR2_ROVRIE                         ((uint32_t)0x00000008)
#define  DFSDM_FLTCR2_AWDIE                          ((uint32_t)0x00000010)
#define  DFSDM_FLTCR2_SCDIE                          ((uint32_t)0x00000020)
#define  DFSDM_FLTCR2_CKABIE                         ((uint32_t)0x00000040)

#define  DFSDM_FLTCR2_EXCH                           ((uint32_t)0x00000300)
#define  DFSDM_FLTCR2_EXCH_0                         ((uint32_t)0x00000100)
#define  DFSDM_FLTCR2_EXCH_1                         ((uint32_t)0x00000200)

#define  DFSDM_FLTCR2_AWDCH                          ((uint32_t)0x00030000)
#define  DFSDM_FLTCR2_AWDCH_0                        ((uint32_t)0x00010000)
#define  DFSDM_FLTCR2_AWDCH_1                        ((uint32_t)0x00020000)

/*******************  Bit definition for DFSDM_FLTISR register  *******************/
#define  DFSDM_FLTISR_JEOCF                          ((uint32_t)0x00000001)
#define  DFSDM_FLTISR_REOCF                          ((uint32_t)0x00000002)
#define  DFSDM_FLTISR_JOVRF                          ((uint32_t)0x00000004)
#define  DFSDM_FLTISR_ROVRF                          ((uint32_t)0x00000008)
#define  DFSDM_FLTISR_AWDF                           ((uint32_t)0x00000010)

#define  DFSDM_FLTISR_JCIP                           ((uint32_t)0x00002000)
#define  DFSDM_FLTISR_RCIP                           ((uint32_t)0x00004000)

#define  DFSDM_FLTISR_CKABF                          ((uint32_t)0x00030000)
#define  DFSDM_FLTISR_CKABF_0                        ((uint32_t)0x00010000)
#define  DFSDM_FLTISR_CKABF_1                        ((uint32_t)0x00020000)

