SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
/*******************  Bit definition for LTDC_DCCR register  *******************/
#define  LTDC_DCCR_DCBLUE                            ((uint32_t)0x000000FF)
#define  LTDC_DCCR_DCGREEN                           ((uint32_t)0x0000FF00)
#define  LTDC_DCCR_DCRED                             ((uint32_t)0x00FF0000)
#define  LTDC_DCCR_DCALPHA                           ((uint32_t)0xFF000000)

/*******************  Bit definition for LTDC_BFCR register  *******************/
#define  LTDC_BFCR_BF2                               ((uint32_t)0x00000007)
#define  LTDC_BFCR_BF2_0                             ((uint32_t)0x00000001)
#define  LTDC_BFCR_BF2_1                             ((uint32_t)0x00000002)
#define  LTDC_BFCR_BF2_2                             ((uint32_t)0x00000004)

#define  LTDC_BFCR_BF1                               ((uint32_t)0x00000700)
#define  LTDC_BFCR_BF1_0                             ((uint32_t)0x00000100)
#define  LTDC_BFCR_BF1_1                             ((uint32_t)0x00000200)
#define  LTDC_BFCR_BF1_2                             ((uint32_t)0x00000400)

/*******************  Bit definition for LTDC_CFBAR register  *******************/
#define  LTDC_CFBAR_CFBADD                           ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for LTDC_CFBLR register  *******************/
#define  LTDC_CFBLR_CFBLL                            ((uint32_t)0x00001FFF)
#define  LTDC_CFBLR_CFBP                             ((uint32_t)0x1FFF0000)

/*******************  Bit definition for LTDC_CFBLNR register  *******************/
#define  LTDC_CFBLNR_CFBLNBR                         ((uint32_t)0x000007FF)

/*******************  Bit definition for LTDC_CLUTWR register  *******************/
#define  LTDC_CLUTWR_BLUE                            ((uint32_t)0x000000FF)
#define  LTDC_CLUTWR_GREEN                           ((uint32_t)0x0000FF00)
#define  LTDC_CLUTWR_RED                             ((uint32_t)0x00FF0000)
#define  LTDC_CLUTWR_CLUTADD                         ((uint32_t)0xFF000000)

/******************************************************************************/
/*                                 GPHA                                      */
/******************************************************************************/
/*******************  Bit definition for GPHA_CTLR register  *******************/
#define  GPHA_CTLR_START                             ((uint32_t)0x00000001)
#define  GPHA_CTLR_SUSP                              ((uint32_t)0x00000002)
#define  GPHA_CTLR_ABORT                             ((uint32_t)0x00000004)

#define  GPHA_CTLR_TCIE                              ((uint32_t)0x00000200)
#define  GPHA_CTLR_TWIE                              ((uint32_t)0x00000400)
#define  GPHA_CTLR_CAEIE                             ((uint32_t)0x00000800)
#define  GPHA_CTLR_CTCIE                             ((uint32_t)0x00001000)
#define  GPHA_CTLR_CEIE                              ((uint32_t)0x00002000)

#define  GPHA_CTLR_MODE                              ((uint32_t)0x00070000)
#define  GPHA_CTLR_MODE_0                            ((uint32_t)0x00010000)
#define  GPHA_CTLR_MODE_1                            ((uint32_t)0x00020000)
#define  GPHA_CTLR_MODE_2                            ((uint32_t)0x00040000)

/*******************  Bit definition for GPHA_ISR register  *******************/
#define  GPHA_ISR_TCIF                               ((uint32_t)0x00000002)
#define  GPHA_ISR_TWIF                               ((uint32_t)0x00000004)
#define  GPHA_ISR_CAEIF                              ((uint32_t)0x00000008)
#define  GPHA_ISR_CTCIF                              ((uint32_t)0x00000010)
#define  GPHA_ISR_CEIF                               ((uint32_t)0x00000020)

/*******************  Bit definition for GPHA_IFCR register  *******************/
#define  GPHA_IFCR_CTCIF                             ((uint32_t)0x00000002)
#define  GPHA_IFCR_CTWIF                             ((uint32_t)0x00000004)
#define  GPHA_IFCR_CAECIF                            ((uint32_t)0x00000008)
#define  GPHA_IFCR_CCTCIF                            ((uint32_t)0x00000010)
#define  GPHA_IFCR_CCEIF                             ((uint32_t)0x00000020)

/*******************  Bit definition for GPHA_FGMAR register  *******************/
#define  GPHA_FGMAR_MA                               ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for GPHA_FGOR register  *******************/
#define  GPHA_FGOR_LO                                ((uint32_t)0x00003FFF)

/*******************  Bit definition for GPHA_BGMAR register  *******************/
#define  GPHA_BGMAR_MA                               ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for GPHA_BGOR register  *******************/
#define  GPHA_BGOR_LO                                ((uint32_t)0x00003FFF)

/*******************  Bit definition for GPHA_FGPFCCR register  *******************/
#define  GPHA_FGPFCCR_CM                             ((uint32_t)0x0000000F)
#define  GPHA_FGPFCCR_CM_0                           ((uint32_t)0x00000001)
#define  GPHA_FGPFCCR_CM_1                           ((uint32_t)0x00000002)
#define  GPHA_FGPFCCR_CM_2                           ((uint32_t)0x00000004)
#define  GPHA_FGPFCCR_CM_3                           ((uint32_t)0x00000008)

#define  GPHA_FGPFCCR_CM_ARGB8888                    ((uint32_t)0x00000000)
#define  GPHA_FGPFCCR_CM_RGB888                      ((uint32_t)0x00000001)
#define  GPHA_FGPFCCR_CM_RGB565                      ((uint32_t)0x00000002)
#define  GPHA_FGPFCCR_CM_ARGB1555                    ((uint32_t)0x00000003)
#define  GPHA_FGPFCCR_CM_ARGB4444                    ((uint32_t)0x00000004)
#define  GPHA_FGPFCCR_CM_L8                          ((uint32_t)0x00000005)
#define  GPHA_FGPFCCR_CM_AL44                        ((uint32_t)0x00000006)
#define  GPHA_FGPFCCR_CM_AL88                        ((uint32_t)0x00000007)
#define  GPHA_FGPFCCR_CM_L4                          ((uint32_t)0x00000008)
#define  GPHA_FGPFCCR_CM_A8                          ((uint32_t)0x00000009)
#define  GPHA_FGPFCCR_CM_A4                          ((uint32_t)0x0000000A)
#define  GPHA_FGPFCCR_CM_YcbCr                       ((uint32_t)0x0000000B)

#define  GPHA_FGPFCCR_CCM                            ((uint32_t)0x00000010)
#define  GPHA_FGPFCCR_START                          ((uint32_t)0x00000020)

#define  GPHA_FGPFCCR_CS                             ((uint32_t)0x0000FF00)

#define  GPHA_FGPFCCR_AM                             ((uint32_t)0x00030000)
#define  GPHA_FGPFCCR_AM_0                           ((uint32_t)0x00010000)
#define  GPHA_FGPFCCR_AM_1                           ((uint32_t)0x00020000)

#define  GPHA_FGPFCCR_CSS                            ((uint32_t)0x000C0000)
#define  GPHA_FGPFCCR_CSS_0                          ((uint32_t)0x00040000)
#define  GPHA_FGPFCCR_CSS_1                          ((uint32_t)0x00080000)

#define  GPHA_FGPFCCR_AI                             ((uint32_t)0x00100000)
#define  GPHA_FGPFCCR_RBS                            ((uint32_t)0x00200000)

