SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
#define ETH_DMACHTDR_HTDAP   ((unsigned int)0xFFFFFFFF)  /* Host transmit descriptor address pointer */
#define ETH_DMACHRDR_HRDAP   ((unsigned int)0xFFFFFFFF)  /* Host receive descriptor address pointer */
#define ETH_DMACHTBAR_HTBAP  ((unsigned int)0xFFFFFFFF)  /* Host transmit buffer address pointer */
#define ETH_DMACHRBAR_HRBAP  ((unsigned int)0xFFFFFFFF)  /* Host receive buffer address pointer */


#define ETH_MAC_ADDR_HBASE   (ETH_MAC_BASE + 0x40)   /* ETHERNET MAC address high offset */
#define ETH_MAC_ADDR_LBASE    (ETH_MAC_BASE + 0x44)  /* ETHERNET MAC address low offset */

/* ETHERNET MACMIIAR register Mask */
#define MACMIIAR_CR_MASK    ((uint32_t)0xFFFFFFE3)

/* ETHERNET MACCR register Mask */
#define MACCR_CLEAR_MASK    ((uint32_t)0xFF20810F)

/* ETHERNET MACFCR register Mask */
#define MACFCR_CLEAR_MASK   ((uint32_t)0x0000FF41)

/* ETHERNET DMAOMR register Mask */
#define DMAOMR_CLEAR_MASK   ((uint32_t)0xF8DE3F23)

/* ETHERNET Remote Wake-up frame register length */
#define ETH_WAKEUP_REGISTER_LENGTH      8

/* ETHERNET Missed frames counter Shift */
#define  ETH_DMA_RX_OVERFLOW_MISSEDFRAMES_COUNTERSHIFT     17

/* ETHERNET DMA Tx descriptors Collision Count Shift */
#define  ETH_DMATXDESC_COLLISION_COUNTSHIFT        3

/* ETHERNET DMA Tx descriptors Buffer2 Size Shift */
#define  ETH_DMATXDESC_BUFFER2_SIZESHIFT           16

/* ETHERNET DMA Rx descriptors Frame Length Shift */
#define  ETH_DMARXDESC_FRAME_LENGTHSHIFT           16

/* ETHERNET DMA Rx descriptors Buffer2 Size Shift */
#define  ETH_DMARXDESC_BUFFER2_SIZESHIFT           16

/* ETHERNET errors */
#define  ETH_ERROR              ((uint32_t)0)
#define  ETH_SUCCESS            ((uint32_t)1)

#define PHY_REG_PAGE0                   0x00
#define PHY_REG_PAGE4                   0x04
#define PHY_REG_PAGE7                   0x07
#define PHY_REG_PAGE17                  0x11
#define PHY_REG_PAGE18                  0x12

/* PHY basic register */
#define PHY_BCR                         0x0           /*PHY transceiver Basic Control Register */
#define PHY_BSR                         0x01          /*PHY transceiver Basic Status Register*/
#define PHY_BMCR                        PHY_BCR
#define PHY_BMSR                        PHY_BSR
#define PHY_PHYIDR1                     0x02          /*PHY Identifier Register*/
#define PHY_PHYIDR2                     0x03          /*PHY Identifier Register*/
#define PHY_ANAR                        0x04          /* Auto-Negotiation Advertisement Register */
#define PHY_ANLPAR                      0x05          /* Auto-Negotiation Link Partner Base  Page Ability Register*/
#define PHY_PAG_SEL                     0x1F

/****************Page 0********************/
#define PHY_CONTROL1                    0x19
#define PHY_STATUS                      0x1A
#define PHY_INTERRUPT_IND               0x1E

/****************Page 7********************/
#define PHY_INTERRUPT_MASK              0x13



#define PHY_SPEED_100M_MODE            (1<<3)
#define PHY_SPEED_10M_MODE             (1<<2)
#define PHY_FULL_DUPLEX_MODE           (1<<1)
#define PHY_HALF_DUPLEX_MODE           (1<<1)


/* ch32h417_exti.h -----------------------------------------------------------*/

#ifndef __ASSEMBLER__

/* EXTI mode enumeration */
typedef enum
{
  EXTI_Mode_Interrupt = 0x00,
  EXTI_Mode_Event = 0x04
}EXTIMode_TypeDef;

/* EXTI Trigger enumeration */
typedef enum
{
  EXTI_Trigger_Rising = 0x08,
  EXTI_Trigger_Falling = 0x0C,
  EXTI_Trigger_Rising_Falling = 0x10
}EXTITrigger_TypeDef;

#endif

/* EXTI_Lines */
#define EXTI_Line0       ((uint32_t)0x00000001)  /* External interrupt line 0 */
#define EXTI_Line1       ((uint32_t)0x00000002)  /* External interrupt line 1 */
#define EXTI_Line2       ((uint32_t)0x00000004)  /* External interrupt line 2 */
#define EXTI_Line3       ((uint32_t)0x00000008)  /* External interrupt line 3 */
#define EXTI_Line4       ((uint32_t)0x00000010)  /* External interrupt line 4 */
#define EXTI_Line5       ((uint32_t)0x00000020)  /* External interrupt line 5 */
#define EXTI_Line6       ((uint32_t)0x00000040)  /* External interrupt line 6 */
#define EXTI_Line7       ((uint32_t)0x00000080)  /* External interrupt line 7 */
#define EXTI_Line8       ((uint32_t)0x00000100)  /* External interrupt line 8 */
#define EXTI_Line9       ((uint32_t)0x00000200)  /* External interrupt line 9 */
#define EXTI_Line10      ((uint32_t)0x00000400)  /* External interrupt line 10 */
#define EXTI_Line11      ((uint32_t)0x00000800)  /* External interrupt line 11 */
#define EXTI_Line12      ((uint32_t)0x00001000)  /* External interrupt line 12 */
#define EXTI_Line13      ((uint32_t)0x00002000)  /* External interrupt line 13 */
#define EXTI_Line14      ((uint32_t)0x00004000)  /* External interrupt line 14 */
#define EXTI_Line15      ((uint32_t)0x00008000)  /* External interrupt line 15 */
#define EXTI_Line16      ((uint32_t)0x00010000)  /* External interrupt line 16 Connected to the USBHS wakeup event */
#define EXTI_Line17      ((uint32_t)0x00020000)  /* External interrupt line 17 Connected to the RTC Alarm event */
#define EXTI_Line18      ((uint32_t)0x00040000)  /* External interrupt line 18 Connected to the SWPMI wakeup event*/
#define EXTI_Line19      ((uint32_t)0x00080000)  /* External interrupt line 19 Connected to the USBFSOTG Wakeup event */
#define EXTI_Line20      ((uint32_t)0x00100000)  /* External interrupt line 20 Connected to the USBPD Wakeup event */
#define EXTI_Line21      ((uint32_t)0x00200000)  /* External interrupt line 21 Connected to the ETH Wakeup event */
#define EXTI_Line22      ((uint32_t)0x00400000)  /* External interrupt line 22 Connected to the USBSS Wakeup event */
#define EXTI_Line23      ((uint32_t)0x00800000)  /* External interrupt line 23 Connected to the LPTIM1 Wakeup event */
#define EXTI_Line24      ((uint32_t)0x01000000)  /* External interrupt line 24 Connected to the LPTIM2 Wakeup event */
#define EXTI_Line25      ((uint32_t)0x02000000)  /* External interrupt line 25 Connected to the I3C Wakeup event */


/* ch32h417_flash.h ----------------------------------------------------------*/


