SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
/* FMC_ENHANCE_READ_MODE */
#define FMC_ENHANCE_READ_MODE_Enable                   ((uint32_t)0x00000000)
#define FMC_ENHANCE_READ_MODE_Disable                  ((uint32_t)0x00008000)

/* FMC_SDRAM_SEL */
#define FMC_SDRAM_SEL_None                             ((uint32_t)0x00000000)
#define FMC_SDRAM_SEL_Bank5                            ((uint32_t)0x00000010)
#define FMC_SDRAM_SEL_Bank6                            ((uint32_t)0x00000008)
#define FMC_SDRAM_SEL_Bank5_6                          ((uint32_t)0x00000018)

/* FMC_SDRAM_CMD_Mode */
#define FMC_SDRAM_CMD_Mode0                            ((uint32_t)0x00000000)
#define FMC_SDRAM_CMD_Mode1                            ((uint32_t)0x00000001)
#define FMC_SDRAM_CMD_Mode2                            ((uint32_t)0x00000002)
#define FMC_SDRAM_CMD_Mode3                            ((uint32_t)0x00000003)
#define FMC_SDRAM_CMD_Mode4                            ((uint32_t)0x00000004)
#define FMC_SDRAM_CMD_Mode5                            ((uint32_t)0x00000005)
#define FMC_SDRAM_CMD_Mode6                            ((uint32_t)0x00000006)

/* FMC_interrupts_definition */
#define FMC_IT_RE                                      ((uint32_t)0x00004000))

/* FMC_flags_definition */
#define FMC_FLAG_FEMPT                                 ((uint32_t)0x00000040)
#define FMC_FLAG_BUSY                                  ((uint32_t)0x10000020))
#define FMC_FLAG_RE                                    ((uint32_t)0x10000001))


/* ch32h417_gpio.h ------------------------------------------------------------*/

#ifndef __ASSEMBLER__

/* Output Maximum frequency selection */
#warning "Speeds on H41x have their own register, dont concat in CFGLR"
typedef enum
{
	GPIO_Speed_10MHz = 0,
	GPIO_Speed_50MHz,
	GPIO_Speed_100MHz,
	GPIO_Speed_180MHz,
} GPIOSpeed_TypeDef;

#endif

#define GPIO_CNF_IN_ANALOG   0
#define GPIO_CNF_IN_FLOATING 4
#define GPIO_CNF_IN_PUPD     8
#define GPIO_CNF_OUT_PP      1
#define GPIO_CNF_OUT_OD      5
#define GPIO_CNF_OUT_PP_AF   9
#define GPIO_CNF_OUT_OD_AF   13

/* Configuration Mode enumeration */
/*
typedef enum
{ GPIO_Mode_AIN = 0x0,
  GPIO_Mode_IN_FLOATING = 0x04,
  GPIO_Mode_IPD = 0x28,
  GPIO_Mode_IPU = 0x48,
  GPIO_Mode_Out_OD = 0x14,
  GPIO_Mode_Out_PP = 0x10,
  GPIO_Mode_AF_OD = 0x1C,
  GPIO_Mode_AF_PP = 0x18
}GPIOMode_TypeDef;
*/

#ifndef __ASSEMBLER__

/* Bit_SET and Bit_RESET enumeration */
typedef enum
{
		Bit_RESET = 0,
		Bit_SET
} BitAction;

#endif

/* GPIO_pins_define */
#define GPIO_Pin_0                         ((uint16_t)0x0001)  /* Pin 0 selected */
#define GPIO_Pin_1                         ((uint16_t)0x0002)  /* Pin 1 selected */
#define GPIO_Pin_2                         ((uint16_t)0x0004)  /* Pin 2 selected */
#define GPIO_Pin_3                         ((uint16_t)0x0008)  /* Pin 3 selected */
#define GPIO_Pin_4                         ((uint16_t)0x0010)  /* Pin 4 selected */
#define GPIO_Pin_5                         ((uint16_t)0x0020)  /* Pin 5 selected */
#define GPIO_Pin_6                         ((uint16_t)0x0040)  /* Pin 6 selected */
#define GPIO_Pin_7                         ((uint16_t)0x0080)  /* Pin 7 selected */
#define GPIO_Pin_8                         ((uint16_t)0x0100)  /* Pin 8 selected */
#define GPIO_Pin_9                         ((uint16_t)0x0200)  /* Pin 9 selected */
#define GPIO_Pin_10                        ((uint16_t)0x0400)  /* Pin 10 selected */
#define GPIO_Pin_11                        ((uint16_t)0x0800)  /* Pin 11 selected */
#define GPIO_Pin_12                        ((uint16_t)0x1000)  /* Pin 12 selected */
#define GPIO_Pin_13                        ((uint16_t)0x2000)  /* Pin 13 selected */
#define GPIO_Pin_14                        ((uint16_t)0x4000)  /* Pin 14 selected */
#define GPIO_Pin_15                        ((uint16_t)0x8000)  /* Pin 15 selected */
#define GPIO_Pin_All                       ((uint16_t)0xFFFF)  /* All pins selected */

/* GPIO_Remap_define */
#define GPIO_Remap_PD0PD1                  ((uint32_t)0x00000001)  /* PD0 and PD1 Alternate Function mapping */
#define GPIO_Remap_ADC1_ETRGREG            ((uint32_t)0x00000002)  /* ADC1 external trigger regular conversion mapping */
#define GPIO_Remap_ADC1_ETRGINJ            ((uint32_t)0x00000004)  /* ADC1 external trigger injection conversion mapping */
#define GPIO_Remap_ADC2_ETRGREG            ((uint32_t)0x00000008)  /* ADC2 external trigger regular conversion mapping */
#define GPIO_Remap_ADC2_ETRGINJ            ((uint32_t)0x00000010)  /* ADC2 external trigger injection conversion mapping */
#define GPIO_PartialRemap_UHSIF_CLK        ((uint32_t)0x00160040)  /* UHSIF CLK Partial Alternate Function mapping */
#define GPIO_PartialRemap1_UHSIF_CLK       ((uint32_t)0x00160080)  /* UHSIF CLK Partial1 Alternate Function mapping */
#define GPIO_FullRemap_UHSIF_CLK           ((uint32_t)0x001600C0)  /* UHSIF CLK Full Alternate Function mapping */
#define GPIO_PartialRemap_UHSIF_PORT       ((uint32_t)0x00180100)  /* UHSIF Port Partial Alternate Function mapping */
#define GPIO_PartialFullRemap_UHSIF_PORT   ((uint32_t)0x00180300)  /* UHSIF Port Full Alternate Function mapping */
#define GPIO_PartialRemap_SDMMC            ((uint32_t)0x001A0400)  /* SDMMC Partial Alternate Function mapping */
#define GPIO_PartialFullRemap_SDMMC        ((uint32_t)0x001A0C00)  /* SDMMC Full Alternate Function mapping */
#define GPIO_Remap_TIM2ITR1                ((uint32_t)0x00001000)  /* TIM2 TRIG Alternate Function mapping */
#define GPIO_Remap_VIO1V8_IO_HSLV          ((uint32_t)0x00200002)  /* VIO(1.8V) GPIO speed configration Alternate Function mapping */
#define GPIO_Remap_VIO3V3_IO_HSLV          ((uint32_t)0x00200004)  /* VIO(3.3V) GPIO speed configration Alternate Function mapping */
#define GPIO_Remap_VDD3V3_IO_HSLV          ((uint32_t)0x00200008)  /* VDD(3.3V) GPIO speed configration Alternate Function mapping */
#define GPIO_Remap_SWJ_Disable             ((uint32_t)0x00300400)  /* SWJ Disable Function mapping */

/* GPIO_Port_Sources */
#define GPIO_PortSourceGPIOA               ((uint8_t)0x00)
#define GPIO_PortSourceGPIOB               ((uint8_t)0x01)
#define GPIO_PortSourceGPIOC               ((uint8_t)0x02)
#define GPIO_PortSourceGPIOD               ((uint8_t)0x03)
#define GPIO_PortSourceGPIOE               ((uint8_t)0x04)
#define GPIO_PortSourceGPIOF               ((uint8_t)0x05)
#define GPIO_PortSourceCMP                 ((uint8_t)0x06)

/* GPIO_Pin_sources */
#define GPIO_PinSource0                    ((uint8_t)0x00)
#define GPIO_PinSource1                    ((uint8_t)0x01)
#define GPIO_PinSource2                    ((uint8_t)0x02)
#define GPIO_PinSource3                    ((uint8_t)0x03)
#define GPIO_PinSource4                    ((uint8_t)0x04)
#define GPIO_PinSource5                    ((uint8_t)0x05)
#define GPIO_PinSource6                    ((uint8_t)0x06)
#define GPIO_PinSource7                    ((uint8_t)0x07)
#define GPIO_PinSource8                    ((uint8_t)0x08)
#define GPIO_PinSource9                    ((uint8_t)0x09)
#define GPIO_PinSource10                   ((uint8_t)0x0A)
#define GPIO_PinSource11                   ((uint8_t)0x0B)
#define GPIO_PinSource12                   ((uint8_t)0x0C)
#define GPIO_PinSource13                   ((uint8_t)0x0D)
#define GPIO_PinSource14                   ((uint8_t)0x0E)
#define GPIO_PinSource15                   ((uint8_t)0x0F)

/* GPIO_AF_Define */
#define GPIO_AF0                           ((uint8_t)0x00)
#define GPIO_AF1                           ((uint8_t)0x01)
#define GPIO_AF2                           ((uint8_t)0x02)
#define GPIO_AF3                           ((uint8_t)0x03)
#define GPIO_AF4                           ((uint8_t)0x04)
#define GPIO_AF5                           ((uint8_t)0x05)
#define GPIO_AF6                           ((uint8_t)0x06)
#define GPIO_AF7                           ((uint8_t)0x07)
#define GPIO_AF8                           ((uint8_t)0x08)
#define GPIO_AF9                           ((uint8_t)0x09)
#define GPIO_AF10                          ((uint8_t)0x0A)
#define GPIO_AF11                          ((uint8_t)0x0B)
#define GPIO_AF12                          ((uint8_t)0x0C)
#define GPIO_AF13                          ((uint8_t)0x0D)
#define GPIO_AF14                          ((uint8_t)0x0E)
#define GPIO_AF15                          ((uint8_t)0x0F)


/* ch32h417_i2c.h ------------------------------------------------------------*/

/* I2C_mode */
#define I2C_Mode_I2C                    ((uint16_t)0x0000)
#define I2C_Mode_SMBusDevice            ((uint16_t)0x0002)
#define I2C_Mode_SMBusHost              ((uint16_t)0x000A)

/* I2C_duty_cycle_in_fast_mode */
#define I2C_DutyCycle_16_9              ((uint16_t)0x4000) /* I2C fast mode Tlow/Thigh = 16/9 */
#define I2C_DutyCycle_2                 ((uint16_t)0xBFFF) /* I2C fast mode Tlow/Thigh = 2 */

