SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
/* ADC_Clock_source= USBHS/Divx */
#define RCC_USBHS_Div5                   ((uint8_t)0x00)
#define RCC_USBHS_Div6                   ((uint8_t)0x01)
#define RCC_USBHS_Div7                   ((uint8_t)0x02)
#define RCC_USBHS_Div8                   ((uint8_t)0x03)
#define RCC_USBHS_Div9                   ((uint8_t)0x04)
#define RCC_USBHS_Div10                  ((uint8_t)0x05)
#define RCC_USBHS_Div11                  ((uint8_t)0x06)
#define RCC_USBHS_Div12                  ((uint8_t)0x07)
#define RCC_USBHS_Div13                  ((uint8_t)0x08)
#define RCC_USBHS_Div14                  ((uint8_t)0x09)
#define RCC_USBHS_Div15                  ((uint8_t)0x0A)
#define RCC_USBHS_Div16                  ((uint8_t)0x0B)
#define RCC_USBHS_Div17                  ((uint8_t)0x0C)
#define RCC_USBHS_Div18                  ((uint8_t)0x0D)
#define RCC_USBHS_Div19                  ((uint8_t)0x0E)
#define RCC_USBHS_Div20                  ((uint8_t)0x0F)
#define RCC_USBHS_Div21                  ((uint8_t)0x10)
#define RCC_USBHS_Div22                  ((uint8_t)0x11)
#define RCC_USBHS_Div23                  ((uint8_t)0x12)
#define RCC_USBHS_Div24                  ((uint8_t)0x13)
#define RCC_USBHS_Div25                  ((uint8_t)0x14)
#define RCC_USBHS_Div26                  ((uint8_t)0x15)
#define RCC_USBHS_Div27                  ((uint8_t)0x16)
#define RCC_USBHS_Div28                  ((uint8_t)0x17)
#define RCC_USBHS_Div29                  ((uint8_t)0x18)
#define RCC_USBHS_Div30                  ((uint8_t)0x19)
#define RCC_USBHS_Div31                  ((uint8_t)0x1A)
#define RCC_USBHS_Div32                  ((uint8_t)0x1B)
#define RCC_USBHS_Div33                  ((uint8_t)0x1C)
#define RCC_USBHS_Div34                  ((uint8_t)0x1D)
#define RCC_USBHS_Div35                  ((uint8_t)0x1E)
#define RCC_USBHS_Div36                  ((uint8_t)0x1F)

/* ADC_Clock_source = HCLK/(RCC_PPRE2*RCC_ADCPRE) */
#define RCC_PPRE2_DIV0                   ((uint8_t)0x00)
#define RCC_PPRE2_DIV2                   ((uint8_t)0x04)
#define RCC_PPRE2_DIV4                   ((uint8_t)0x05)
#define RCC_PPRE2_DIV8                   ((uint8_t)0x06)
#define RCC_PPRE2_DIV16                  ((uint8_t)0x07)

#define RCC_HCLK_ADCPRE_DIV2             ((uint8_t)0x00)
#define RCC_HCLK_ADCPRE_DIV4             ((uint8_t)0x01)
#define RCC_HCLK_ADCPRE_DIV6             ((uint8_t)0x02)
#define RCC_HCLK_ADCPRE_DIV8             ((uint8_t)0x03)

/* LSE_configuration */
#define RCC_LSE_OFF                      ((uint8_t)0x00)
#define RCC_LSE_ON                       ((uint8_t)0x01)
#define RCC_LSE_Bypass                   ((uint8_t)0x04)

/* RTC_clock_source */
#define RCC_RTCCLKSource_LSE             ((uint32_t)0x00000040)
#define RCC_RTCCLKSource_LSI             ((uint32_t)0x00000080)
#define RCC_RTCCLKSource_HSE_Div512      ((uint32_t)0x000000C0)

/* HB_peripheral */
#define RCC_HBPeriph_DMA1                ((uint32_t)0x00000001)
#define RCC_HBPeriph_DMA2                ((uint32_t)0x00000002)
#define RCC_HBPeriph_CRC                 ((uint32_t)0x00000040)
#define RCC_HBPeriph_FMC                 ((uint32_t)0x00000100)
#define RCC_HBPeriph_RNG                 ((uint32_t)0x00000200)
#define RCC_HBPeriph_SDMMC               ((uint32_t)0x00000400)
#define RCC_HBPeriph_USBHS               ((uint32_t)0x00000800)
#define RCC_HBPeriph_USBSS               ((uint32_t)0x00001000)
#define RCC_HBPeriph_DVP                 ((uint32_t)0x00002000)
#define RCC_HBPeriph_ETH                 ((uint32_t)0x00004000)
#define RCC_HBPeriph_OTG_FS              ((uint32_t)0x00020000)
#define RCC_HBPeriph_UHSIF               ((uint32_t)0x00040000)
#define RCC_HBPeriph_USBPD               ((uint32_t)0x00080000)
#define RCC_HBPeriph_SERDES              ((uint32_t)0x00100000)
#define RCC_HBPeriph_PIOC                ((uint32_t)0x00400000)

/* HB2_peripheral */
#define RCC_HB2Periph_AFIO               ((uint32_t)0x00000001)
#define RCC_HB2Periph_HSADC              ((uint32_t)0x00000002)
#define RCC_HB2Periph_GPIOA              ((uint32_t)0x00000004)
#define RCC_HB2Periph_GPIOB              ((uint32_t)0x00000008)
#define RCC_HB2Periph_GPIOC              ((uint32_t)0x00000010)
#define RCC_HB2Periph_GPIOD              ((uint32_t)0x00000020)
#define RCC_HB2Periph_GPIOE              ((uint32_t)0x00000040)
#define RCC_HB2Periph_GPIOF              ((uint32_t)0x00000080)
#define RCC_HB2Periph_ADC1               ((uint32_t)0x00000200)
#define RCC_HB2Periph_ADC2               ((uint32_t)0x00000400)
#define RCC_HB2Periph_TIM1               ((uint32_t)0x00000800)
#define RCC_HB2Periph_SPI1               ((uint32_t)0x00001000)
#define RCC_HB2Periph_TIM8               ((uint32_t)0x00002000)
#define RCC_HB2Periph_USART1             ((uint32_t)0x00004000)
#define RCC_HB2Periph_I2C4               ((uint32_t)0x00008000)
#define RCC_HB2Periph_SAI                ((uint32_t)0x00010000)
#define RCC_HB2Periph_SDIO               ((uint32_t)0x00040000)
#define RCC_HB2Periph_TIM9               ((uint32_t)0x00080000)
#define RCC_HB2Periph_TIM10              ((uint32_t)0x00100000)
#define RCC_HB2Periph_TIM11              ((uint32_t)0x00200000)
#define RCC_HB2Periph_TIM12              ((uint32_t)0x00400000)
#define RCC_HB2Periph_OPCM               ((uint32_t)0x00800000)
#define RCC_HB2Periph_DFSDM              ((uint32_t)0x02000000)
#define RCC_HB2Periph_ECDC               ((uint32_t)0x04000000)
#define RCC_HB2Periph_GPHA               ((uint32_t)0x08000000)
#define RCC_HB2Periph_LTDC               ((uint32_t)0x40000000)
#define RCC_HB2Periph_I3C                ((uint32_t)0x80000000)

/* HB1_peripheral */
#define RCC_HB1Periph_TIM2               ((uint32_t)0x00000001)
#define RCC_HB1Periph_TIM3               ((uint32_t)0x00000002)
#define RCC_HB1Periph_TIM4               ((uint32_t)0x00000004)
#define RCC_HB1Periph_TIM5               ((uint32_t)0x00000008)
#define RCC_HB1Periph_TIM6               ((uint32_t)0x00000010)
#define RCC_HB1Periph_TIM7               ((uint32_t)0x00000020)
#define RCC_HB1Periph_USART6             ((uint32_t)0x00000040)
#define RCC_HB1Periph_USART7             ((uint32_t)0x00000080)
#define RCC_HB1Periph_USART8             ((uint32_t)0x00000100)
#define RCC_HB1Periph_LPTIM1             ((uint32_t)0x00000200)
#define RCC_HB1Periph_LPTIM2             ((uint32_t)0x00000400)
#define RCC_HB1Periph_WWDG               ((uint32_t)0x00000800)
#define RCC_HB1Periph_QSPI1              ((uint32_t)0x00001000)
#define RCC_HB1Periph_QSPI2              ((uint32_t)0x00002000)
#define RCC_HB1Periph_SPI2               ((uint32_t)0x00004000)
#define RCC_HB1Periph_SPI3               ((uint32_t)0x00008000)
#define RCC_HB1Periph_SPI4               ((uint32_t)0x00010000)
#define RCC_HB1Periph_USART2             ((uint32_t)0x00020000)
#define RCC_HB1Periph_USART3             ((uint32_t)0x00040000)
#define RCC_HB1Periph_USART4             ((uint32_t)0x00080000)
#define RCC_HB1Periph_USART5             ((uint32_t)0x00100000)
#define RCC_HB1Periph_I2C1               ((uint32_t)0x00200000)
#define RCC_HB1Periph_I2C2               ((uint32_t)0x00400000)
#define RCC_HB1Periph_CAN3               ((uint32_t)0x01000000)
#define RCC_HB1Periph_CAN1               ((uint32_t)0x02000000)
#define RCC_HB1Periph_CAN2               ((uint32_t)0x04000000)
#define RCC_HB1Periph_BKP                ((uint32_t)0x08000000)
#define RCC_HB1Periph_PWR                ((uint32_t)0x10000000)
#define RCC_HB1Periph_DAC                ((uint32_t)0x20000000)
#define RCC_HB1Periph_I2C3               ((uint32_t)0x40000000)
#define RCC_HB1Periph_SWPMI              ((uint32_t)0x80000000)

/* CSSON */
#define RCC_CSSON_DISABLE                (uint8_t)0x00
#define RCC_CSSON_ENABLE                 (uint8_t)0x01

/* CSSHSEDIS */
#define RCC_CSSHSEDIS_DISABLE            (uint8_t)0x00
#define RCC_CSSHSEDIS_ENABLE             (uint8_t)0x01

/* Clock_source_to_output_on_MCO_pin */
#define RCC_MCO_NoClock                  ((uint8_t)0x00)
#define RCC_MCO_SYSCLK                   ((uint8_t)0x04)
#define RCC_MCO_HSI                      ((uint8_t)0x05)
#define RCC_MCO_HSE                      ((uint8_t)0x06)
#define RCC_MCO_PLLCLK_Div2              ((uint8_t)0x07)
#define RCC_MCO_UTMI                     ((uint8_t)0x08)
#define RCC_MCO_USBSSPLL_Div2            ((uint8_t)0x09)
#define RCC_MCO_ETHPLL_Div8              ((uint8_t)0x0A)
#define RCC_MCO_SERDESPLL_Div16          ((uint8_t)0x0B)

