SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
/* RCC_Flag */
#define RCC_FLAG_HSIRDY                  ((uint8_t)0x21)
#define RCC_FLAG_HSERDY                  ((uint8_t)0x31)
#define RCC_FLAG_USBHSPLLRDY             ((uint8_t)0x35)
#define RCC_FLAG_USBSSPLLRDY             ((uint8_t)0x37)
#define RCC_FLAG_PLLRDY                  ((uint8_t)0x39)
#define RCC_FLAG_ETHPLLRDY               ((uint8_t)0x3B)
#define RCC_FLAG_SERDESPLLRDY            ((uint8_t)0x3D)
#define RCC_FLAG_LSERDY                  ((uint8_t)0x41)
#define RCC_FLAG_LSIRDY                  ((uint8_t)0x61)
#define RCC_FLAG_PINRST                  ((uint8_t)0x7A)
#define RCC_FLAG_PORRST                  ((uint8_t)0x7B)
#define RCC_FLAG_SFTRST                  ((uint8_t)0x7C)
#define RCC_FLAG_IWDGRST                 ((uint8_t)0x7D)
#define RCC_FLAG_WWDGRST                 ((uint8_t)0x7E)
#define RCC_FLAG_LKUPRSTF                ((uint8_t)0x7F)

/*ETH 125M clock source*/
#define RCC_ETH125MSource_PLLCLK         ((uint8_t)0x00)
#define RCC_ETH125MSource_USBSS          ((uint8_t)0x01)
#define RCC_ETH125MSource_ETH_Div4       ((uint8_t)0x02)
#define RCC_ETH125MSource_SERDES_Div8    ((uint8_t)0x03)

/*HSADC clock source*/
#define RCC_HSADCSource_PLLCLK           ((uint8_t)0x00)
#define RCC_HSADCSource_SYSCLK           ((uint8_t)0x01)
#define RCC_HSADCSource_USBHS            ((uint8_t)0x02)
#define RCC_HSADCSource_ETH              ((uint8_t)0x03)

/* I2S2_clock_source */
#define RCC_I2S2CLKSource_SYSCLK         ((uint8_t)0x00)
#define RCC_I2S2CLKSource_PLLCLK         ((uint8_t)0x01)

/* I2S3_clock_source */
#define RCC_I2S3CLKSource_SYSCLK         ((uint8_t)0x00)
#define RCC_I2S3CLKSource_PLLCLK         ((uint8_t)0x01)

/* RNG_clock_source */
#define RCC_RNGCLKSource_SYSCLK          ((uint8_t)0x00)
#define RCC_RNGCLKSource_PLLCLK          ((uint8_t)0x01)

/* USBFS_clock_source */
#define RCC_USBFSCLKSource_PLL           ((uint8_t)0x00)
#define RCC_USBFSCLKSource_USBHSPLL      ((uint8_t)0x01)

/* USBFS_division_factor */
#define RCC_USBFS_Div1                   ((uint8_t)0x00)
#define RCC_USBFS_Div2                   ((uint8_t)0x01)
#define RCC_USBFS_Div3                   ((uint8_t)0x02)
#define RCC_USBFS_Div4                   ((uint8_t)0x03)
#define RCC_USBFS_Div5                   ((uint8_t)0x04)
#define RCC_USBFS_Div6                   ((uint8_t)0x05)
#define RCC_USBFS_Div8                   ((uint8_t)0x06)
#define RCC_USBFS_Div10                  ((uint8_t)0x07)
#define RCC_USBFS_1Div5                  ((uint8_t)0x08)
#define RCC_USBFS_2Div5                  ((uint8_t)0x09)
#define RCC_USBFS_3Div5                  ((uint8_t)0x0A)
#define RCC_USBFS_4Div5                  ((uint8_t)0x0B)
#define RCC_USBFS_5Div5                  ((uint8_t)0x0C)
#define RCC_USBFS_6Div5                  ((uint8_t)0x0D)
#define RCC_USBFS_7Div5                  ((uint8_t)0x0E)
#define RCC_USBFS_9Div5                  ((uint8_t)0x0F)

/* LTDC_clock_source */
#define RCC_LTDCClockSource_PLL          ((uint8_t)0x00)
#define RCC_LTDCClockSource_SERDESPLL    ((uint8_t)0x01)
#define RCC_LTDCClockSource_ETHPLL       ((uint8_t)0x02)
#define RCC_LTDCClockSource_USBHSPLL     ((uint8_t)0x03)

/* LTDC_division_factor */
#define RCC_LTDCClockSource_Div1         ((uint8_t)0x00)
#define RCC_LTDCClockSource_Div2         ((uint8_t)0x01)
#define RCC_LTDCClockSource_Div3         ((uint8_t)0x02)
#define RCC_LTDCClockSource_Div4         ((uint8_t)0x03)
#define RCC_LTDCClockSource_Div5         ((uint8_t)0x04)
#define RCC_LTDCClockSource_Div6         ((uint8_t)0x05)
#define RCC_LTDCClockSource_Div7         ((uint8_t)0x06)
#define RCC_LTDCClockSource_Div8         ((uint8_t)0x07)
#define RCC_LTDCClockSource_Div9         ((uint8_t)0x08)
#define RCC_LTDCClockSource_Div10        ((uint8_t)0x09)
#define RCC_LTDCClockSource_Div11        ((uint8_t)0x0A)
#define RCC_LTDCClockSource_Div12        ((uint8_t)0x0B)
#define RCC_LTDCClockSource_Div13        ((uint8_t)0x0C)
#define RCC_LTDCClockSource_Div14        ((uint8_t)0x0D)
#define RCC_LTDCClockSource_Div15        ((uint8_t)0x0E)
#define RCC_LTDCClockSource_Div16        ((uint8_t)0x0F)
#define RCC_LTDCClockSource_Div17        ((uint8_t)0x10)
#define RCC_LTDCClockSource_Div18        ((uint8_t)0x11)
#define RCC_LTDCClockSource_Div19        ((uint8_t)0x12)
#define RCC_LTDCClockSource_Div20        ((uint8_t)0x13)
#define RCC_LTDCClockSource_Div21        ((uint8_t)0x14)
#define RCC_LTDCClockSource_Div22        ((uint8_t)0x15)
#define RCC_LTDCClockSource_Div23        ((uint8_t)0x16)
#define RCC_LTDCClockSource_Div24        ((uint8_t)0x17)
#define RCC_LTDCClockSource_Div25        ((uint8_t)0x18)
#define RCC_LTDCClockSource_Div26        ((uint8_t)0x19)
#define RCC_LTDCClockSource_Div27        ((uint8_t)0x1A)
#define RCC_LTDCClockSource_Div28        ((uint8_t)0x1B)
#define RCC_LTDCClockSource_Div29        ((uint8_t)0x1C)
#define RCC_LTDCClockSource_Div30        ((uint8_t)0x1D)
#define RCC_LTDCClockSource_Div31        ((uint8_t)0x1E)
#define RCC_LTDCClockSource_Div32        ((uint8_t)0x1F)
#define RCC_LTDCClockSource_Div33        ((uint8_t)0x20)
#define RCC_LTDCClockSource_Div34        ((uint8_t)0x21)
#define RCC_LTDCClockSource_Div35        ((uint8_t)0x22)
#define RCC_LTDCClockSource_Div36        ((uint8_t)0x23)
#define RCC_LTDCClockSource_Div37        ((uint8_t)0x24)
#define RCC_LTDCClockSource_Div38        ((uint8_t)0x25)
#define RCC_LTDCClockSource_Div39        ((uint8_t)0x26)
#define RCC_LTDCClockSource_Div40        ((uint8_t)0x27)
#define RCC_LTDCClockSource_Div41        ((uint8_t)0x28)
#define RCC_LTDCClockSource_Div42        ((uint8_t)0x29)
#define RCC_LTDCClockSource_Div43        ((uint8_t)0x2A)
#define RCC_LTDCClockSource_Div44        ((uint8_t)0x2B)
#define RCC_LTDCClockSource_Div45        ((uint8_t)0x2C)
#define RCC_LTDCClockSource_Div46        ((uint8_t)0x2D)
#define RCC_LTDCClockSource_Div47        ((uint8_t)0x2E)
#define RCC_LTDCClockSource_Div48        ((uint8_t)0x2F)
#define RCC_LTDCClockSource_Div49        ((uint8_t)0x30)
#define RCC_LTDCClockSource_Div50        ((uint8_t)0x31)
#define RCC_LTDCClockSource_Div51        ((uint8_t)0x32)
#define RCC_LTDCClockSource_Div52        ((uint8_t)0x33)
#define RCC_LTDCClockSource_Div53        ((uint8_t)0x34)
#define RCC_LTDCClockSource_Div54        ((uint8_t)0x35)
#define RCC_LTDCClockSource_Div55        ((uint8_t)0x36)
#define RCC_LTDCClockSource_Div56        ((uint8_t)0x37)
#define RCC_LTDCClockSource_Div57        ((uint8_t)0x38)
#define RCC_LTDCClockSource_Div58        ((uint8_t)0x39)
#define RCC_LTDCClockSource_Div59        ((uint8_t)0x3A)
#define RCC_LTDCClockSource_Div60        ((uint8_t)0x3B)
#define RCC_LTDCClockSource_Div61        ((uint8_t)0x3C)
#define RCC_LTDCClockSource_Div62        ((uint8_t)0x3D)
#define RCC_LTDCClockSource_Div63        ((uint8_t)0x3E)
#define RCC_LTDCClockSource_Div64        ((uint8_t)0x3F)

/* UHSIF_clock_source */
#define RCC_UHSIFClockSource_SYSCLK      ((uint8_t)0x00)
#define RCC_UHSIFClockSource_PLL         ((uint8_t)0x01)
#define RCC_UHSIFClockSource_USBHSPLL    ((uint8_t)0x02)
#define RCC_UHSIFClockSource_ETHPLL      ((uint8_t)0x03)

/* UHSIF_division_factor */
#define RCC_UHSIFClockSource_Div1        ((uint8_t)0x00)
#define RCC_UHSIFClockSource_Div2        ((uint8_t)0x01)
#define RCC_UHSIFClockSource_Div3        ((uint8_t)0x02)
#define RCC_UHSIFClockSource_Div4        ((uint8_t)0x03)
#define RCC_UHSIFClockSource_Div5        ((uint8_t)0x04)
#define RCC_UHSIFClockSource_Div6        ((uint8_t)0x05)
#define RCC_UHSIFClockSource_Div7        ((uint8_t)0x06)
#define RCC_UHSIFClockSource_Div8        ((uint8_t)0x07)
#define RCC_UHSIFClockSource_Div9        ((uint8_t)0x08)
#define RCC_UHSIFClockSource_Div10       ((uint8_t)0x09)
#define RCC_UHSIFClockSource_Div11       ((uint8_t)0x0A)
#define RCC_UHSIFClockSource_Div12       ((uint8_t)0x0B)
#define RCC_UHSIFClockSource_Div13       ((uint8_t)0x0C)
#define RCC_UHSIFClockSource_Div14       ((uint8_t)0x0D)
#define RCC_UHSIFClockSource_Div15       ((uint8_t)0x0E)
#define RCC_UHSIFClockSource_Div16       ((uint8_t)0x0F)
#define RCC_UHSIFClockSource_Div17       ((uint8_t)0x10)
#define RCC_UHSIFClockSource_Div18       ((uint8_t)0x11)
#define RCC_UHSIFClockSource_Div19       ((uint8_t)0x12)
#define RCC_UHSIFClockSource_Div20       ((uint8_t)0x13)
#define RCC_UHSIFClockSource_Div21       ((uint8_t)0x14)
#define RCC_UHSIFClockSource_Div22       ((uint8_t)0x15)
#define RCC_UHSIFClockSource_Div23       ((uint8_t)0x16)
#define RCC_UHSIFClockSource_Div24       ((uint8_t)0x17)
#define RCC_UHSIFClockSource_Div25       ((uint8_t)0x18)
#define RCC_UHSIFClockSource_Div26       ((uint8_t)0x19)
#define RCC_UHSIFClockSource_Div27       ((uint8_t)0x1A)
#define RCC_UHSIFClockSource_Div28       ((uint8_t)0x1B)
#define RCC_UHSIFClockSource_Div29       ((uint8_t)0x1C)
#define RCC_UHSIFClockSource_Div30       ((uint8_t)0x1D)
#define RCC_UHSIFClockSource_Div31       ((uint8_t)0x1E)
#define RCC_UHSIFClockSource_Div32       ((uint8_t)0x1F)
#define RCC_UHSIFClockSource_Div33       ((uint8_t)0x20)
#define RCC_UHSIFClockSource_Div34       ((uint8_t)0x21)
#define RCC_UHSIFClockSource_Div35       ((uint8_t)0x22)
#define RCC_UHSIFClockSource_Div36       ((uint8_t)0x23)
#define RCC_UHSIFClockSource_Div37       ((uint8_t)0x24)
#define RCC_UHSIFClockSource_Div38       ((uint8_t)0x25)
#define RCC_UHSIFClockSource_Div39       ((uint8_t)0x26)
#define RCC_UHSIFClockSource_Div40       ((uint8_t)0x27)
#define RCC_UHSIFClockSource_Div41       ((uint8_t)0x28)
#define RCC_UHSIFClockSource_Div42       ((uint8_t)0x29)
#define RCC_UHSIFClockSource_Div43       ((uint8_t)0x2A)
#define RCC_UHSIFClockSource_Div44       ((uint8_t)0x2B)
#define RCC_UHSIFClockSource_Div45       ((uint8_t)0x2C)
#define RCC_UHSIFClockSource_Div46       ((uint8_t)0x2D)
#define RCC_UHSIFClockSource_Div47       ((uint8_t)0x2E)
#define RCC_UHSIFClockSource_Div48       ((uint8_t)0x2F)
#define RCC_UHSIFClockSource_Div49       ((uint8_t)0x30)
#define RCC_UHSIFClockSource_Div50       ((uint8_t)0x31)
#define RCC_UHSIFClockSource_Div51       ((uint8_t)0x32)
#define RCC_UHSIFClockSource_Div52       ((uint8_t)0x33)
#define RCC_UHSIFClockSource_Div53       ((uint8_t)0x34)
#define RCC_UHSIFClockSource_Div54       ((uint8_t)0x35)
#define RCC_UHSIFClockSource_Div55       ((uint8_t)0x36)
#define RCC_UHSIFClockSource_Div56       ((uint8_t)0x37)
#define RCC_UHSIFClockSource_Div57       ((uint8_t)0x38)
#define RCC_UHSIFClockSource_Div58       ((uint8_t)0x39)
#define RCC_UHSIFClockSource_Div59       ((uint8_t)0x3A)
#define RCC_UHSIFClockSource_Div60       ((uint8_t)0x3B)
#define RCC_UHSIFClockSource_Div61       ((uint8_t)0x3C)
#define RCC_UHSIFClockSource_Div62       ((uint8_t)0x3D)
#define RCC_UHSIFClockSource_Div63       ((uint8_t)0x3E)
#define RCC_UHSIFClockSource_Div64       ((uint8_t)0x3F)

