SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
/* USBHSPLL_clock_source */
#define RCC_USBHSPLLSource_HSE           ((uint8_t)0x00)
#define RCC_USBHSPLLSource_HSI           ((uint8_t)0x01)
#define RCC_USBHSPLLSource_20METH        ((uint8_t)0x02)
#define RCC_USBHSPLLSource_PLL_CLK_DIV   ((uint8_t)0x03)

/* USBHS PLL Refer clock */
#define RCC_USBHSPLLRefer_25M            ((uint8_t)0x00)
#define RCC_USBHSPLLRefer_20M            ((uint8_t)0x01)
#define RCC_USBHSPLLRefer_24M            ((uint8_t)0x02)
#define RCC_USBHSPLLRefer_32M            ((uint8_t)0x03)

/* USBSS PLL Refer clock */
#define RCC_USBSSPLLRefer_20M            ((uint8_t)0x00)
#define RCC_USBSSPLLRefer_24M            ((uint8_t)0x10)
#define RCC_USBSSPLLRefer_25M            ((uint8_t)0x20)
#define RCC_USBSSPLLRefer_30M            ((uint8_t)0x30)
#define RCC_USBSSPLLRefer_32M            ((uint8_t)0x40)
#define RCC_USBSSPLLRefer_40M            ((uint8_t)0x50)
#define RCC_USBSSPLLRefer_60M            ((uint8_t)0x60)
#define RCC_USBSSPLLRefer_80M            ((uint8_t)0x70)

/* USBHS PLL Source clock Division*/
#define RCC_USBHSPLL_IN_Div1             ((uint32_t)0x0000)
#define RCC_USBHSPLL_IN_Div2             ((uint32_t)0x0100)
#define RCC_USBHSPLL_IN_Div3             ((uint32_t)0x0200)
#define RCC_USBHSPLL_IN_Div4             ((uint32_t)0x0300)
#define RCC_USBHSPLL_IN_Div5             ((uint32_t)0x0400)
#define RCC_USBHSPLL_IN_Div6             ((uint32_t)0x0500)
#define RCC_USBHSPLL_IN_Div7             ((uint32_t)0x0600)
#define RCC_USBHSPLL_IN_Div8             ((uint32_t)0x0700)
#define RCC_USBHSPLL_IN_Div9             ((uint32_t)0x0800)
#define RCC_USBHSPLL_IN_Div10            ((uint32_t)0x0900)
#define RCC_USBHSPLL_IN_Div11            ((uint32_t)0x0A00)
#define RCC_USBHSPLL_IN_Div12            ((uint32_t)0x0B00)
#define RCC_USBHSPLL_IN_Div13            ((uint32_t)0x0C00)
#define RCC_USBHSPLL_IN_Div14            ((uint32_t)0x0D00)
#define RCC_USBHSPLL_IN_Div15            ((uint32_t)0x0E00)
#define RCC_USBHSPLL_IN_Div16            ((uint32_t)0x0F00)
#define RCC_USBHSPLL_IN_Div17            ((uint32_t)0x1000)
#define RCC_USBHSPLL_IN_Div18            ((uint32_t)0x1100)
#define RCC_USBHSPLL_IN_Div19            ((uint32_t)0x1200)
#define RCC_USBHSPLL_IN_Div20            ((uint32_t)0x1300)
#define RCC_USBHSPLL_IN_Div21            ((uint32_t)0x1400)
#define RCC_USBHSPLL_IN_Div22            ((uint32_t)0x1500)
#define RCC_USBHSPLL_IN_Div23            ((uint32_t)0x1600)
#define RCC_USBHSPLL_IN_Div24            ((uint32_t)0x1700)
#define RCC_USBHSPLL_IN_Div25            ((uint32_t)0x1800)
#define RCC_USBHSPLL_IN_Div26            ((uint32_t)0x1900)
#define RCC_USBHSPLL_IN_Div27            ((uint32_t)0x1A00)
#define RCC_USBHSPLL_IN_Div28            ((uint32_t)0x1B00)
#define RCC_USBHSPLL_IN_Div29            ((uint32_t)0x1C00)
#define RCC_USBHSPLL_IN_Div30            ((uint32_t)0x1D00)
#define RCC_USBHSPLL_IN_Div31            ((uint32_t)0x1E00)
#define RCC_USBHSPLL_IN_Div32            ((uint32_t)0x1F00)

/* SERDES PLL clock Mul*/
#define RCC_SERDESPLLMul_25              ((uint32_t)0x0000)
#define RCC_SERDESPLLMul_28              ((uint32_t)0x0001)
#define RCC_SERDESPLLMul_30              ((uint32_t)0x0002)
#define RCC_SERDESPLLMul_32              ((uint32_t)0x0003)
#define RCC_SERDESPLLMul_35              ((uint32_t)0x0004)
#define RCC_SERDESPLLMul_38              ((uint32_t)0x0005)
#define RCC_SERDESPLLMul_40              ((uint32_t)0x0006)
#define RCC_SERDESPLLMul_45              ((uint32_t)0x0007)
#define RCC_SERDESPLLMul_50              ((uint32_t)0x0008)
#define RCC_SERDESPLLMul_56              ((uint32_t)0x0009)
#define RCC_SERDESPLLMul_60              ((uint32_t)0x000A)
#define RCC_SERDESPLLMul_64              ((uint32_t)0x000B)
#define RCC_SERDESPLLMul_70              ((uint32_t)0x000C)
#define RCC_SERDESPLLMul_76              ((uint32_t)0x000D)
#define RCC_SERDESPLLMul_80              ((uint32_t)0x000E)
#define RCC_SERDESPLLMul_90              ((uint32_t)0x000F)

/* ADC_clock_H_Level_Duty_Cycle */
#define RCC_ADC_H_Level_Mode0            ((uint32_t)0x00000000)
#define RCC_ADC_H_Level_Mode1            ((uint32_t)0x40000000)

/* ADC_clock_source */
#define RCC_ADCCLKSource_HCLK            ((uint8_t)0x00)
#define RCC_ADCCLKSource_USBHSPLL        ((uint8_t)0x01)

/* SYSPLL_clock_source */
#define RCC_SYSPLLClockSource_PLL        ((uint8_t)0x00)
#define RCC_SYSPLLClockSource_USBHSPLL   ((uint8_t)0x04)
#define RCC_SYSPLLClockSource_ETHPLL     ((uint8_t)0x05)
#define RCC_SYSPLLClockSource_SERDESPLL  ((uint8_t)0x06)
#define RCC_SYSPLLClockSource_USBSSPLL   ((uint8_t)0x07)

#define RCC_RTCOutputSource_CalibClock   ((uint16_t)0x0008)
#define RCC_RTCOutputSource_Alarm        ((uint16_t)0x0010)
#define RCC_RTCOutputSource_Second       ((uint16_t)0x0030)
#define RCC_RTCOutputSource_None         ((uint16_t)0x0000)

/* ch32v00x_rng.h ------------------------------------------------------------*/

/* RNG_flags_definition*/
#define RNG_FLAG_DRDY               ((uint8_t)0x0001) /* Data ready */
#define RNG_FLAG_CECS               ((uint8_t)0x0002) /* Clock error current status */
#define RNG_FLAG_SECS               ((uint8_t)0x0004) /* Seed error current status */

/* RNG_interrupts_definition */
#define RNG_IT_CEI                  ((uint8_t)0x20) /* Clock error interrupt */
#define RNG_IT_SEI                  ((uint8_t)0x40) /* Seed error interrupt */


/* ch32h417_rtc.h ------------------------------------------------------------*/

/* RTC_interrupts_define */
#define RTC_IT_OW            ((uint16_t)0x0004)  /* Overflow interrupt */
#define RTC_IT_ALR           ((uint16_t)0x0002)  /* Alarm interrupt */
#define RTC_IT_SEC           ((uint16_t)0x0001)  /* Second interrupt */

/* RTC_interrupts_flags */
#define RTC_FLAG_RTOFF       ((uint16_t)0x0020)  /* RTC Operation OFF flag */
#define RTC_FLAG_RSF         ((uint16_t)0x0008)  /* Registers Synchronized flag */
#define RTC_FLAG_OW          ((uint16_t)0x0004)  /* Overflow flag */
#define RTC_FLAG_ALR         ((uint16_t)0x0002)  /* Alarm flag */
#define RTC_FLAG_SEC         ((uint16_t)0x0001)  /* Second flag */


