SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
/* R8_UH_TX_CTRL */
#define USBFS_UH_T_AUTO_TOG         0x08      // enable automatic toggle after successful transfer completion: 0=manual toggle, 1=automatic toggle
#define USBFS_UH_T_TOG              0x04      // prepared data toggle flag of host transmittal (SETUP/OUT): 0=DATA0, 1=DATA1
#define USBFS_UH_T_RES              0x01      // expected handshake response type for host transmittal (SETUP/OUT): 0=ACK (ready), 1=no response, time out from device, for isochronous transactions


/* ch32v00x_wwdg.h -----------------------------------------------------------*/


/* WWDG_Prescaler */
#define WWDG_Prescaler_1    ((uint32_t)0x00000000)
#define WWDG_Prescaler_2    ((uint32_t)0x00000080)
#define WWDG_Prescaler_4    ((uint32_t)0x00000100)
#define WWDG_Prescaler_8    ((uint32_t)0x00000180)

/* ch32h417_hsadc.h -----------------------------------------------------------*/

/* HSADC_First_Conversion_Cycle */
#define HSADC_First_Conversion_Cycle_8    ((uint32_t)0x00000000)
#define HSADC_First_Conversion_Cycle_9    ((uint32_t)0x00000020)
#define HSADC_First_Conversion_Cycle_10   ((uint32_t)0x00000040)
#define HSADC_First_Conversion_Cycle_11   ((uint32_t)0x00000060)

/* HSADC_data_size */
#define HSADC_DataSize_16b                ((uint32_t)0x00000000)
#define HSADC_DataSize_8b                 ((uint32_t)0x00000080)

/* HSADC_channels */
#define HSADC_Channel_0                   ((uint8_t)0x00)
#define HSADC_Channel_1                   ((uint8_t)0x01)
#define HSADC_Channel_2                   ((uint8_t)0x02)
#define HSADC_Channel_3                   ((uint8_t)0x03)
#define HSADC_Channel_4                   ((uint8_t)0x04)
#define HSADC_Channel_5                   ((uint8_t)0x05)
#define HSADC_Channel_6                   ((uint8_t)0x06)

/* HSADC_interrupts_definition */
#define HSADC_IT_EOC                      ((uint16_t)0x0100)
#define HSADC_IT_DMAEnd                   ((uint16_t)0x0200)
#define HSADC_IT_BurstEnd                 ((uint16_t)0x0400)

/* HSADC_flags_definition */
#define HSADC_FLAG_EOC                    ((uint16_t)0x0001)
#define HSADC_FLAG_DMAEnd                 ((uint16_t)0x0002)
#define HSADC_FLAG_BurstEnd               ((uint16_t)0x0004)
#define HSADC_FLAG_RXNE                   ((uint16_t)0x0008)
#define HSADC_FLAG_DualBufferAddr1        ((uint16_t)0x0010)
#define HSADC_FLAG_FIFO_NE                ((uint16_t)0x0100)
#define HSADC_FLAG_FIFO_Full              ((uint16_t)0x0200)
#define HSADC_FLAG_FIFO_OV                ((uint16_t)0x0400)

/* ch32h417_hsem.h -----------------------------------------------------------*/

/* HSEM_Core_ID */
#define HSEM_Core_ID_V3F   ((uint32_t)0x00000000)
#define HSEM_Core_ID_V5F   ((uint32_t)0x00000100)

/* ch32h417_i3c.h -----------------------------------------------------------*/

/* I3C_SDAHoldTime*/
#define I3C_SDAHoldTime_0_5                  ((uint32_t)0x00000000)
#define I3C_SDAHoldTime_1_5                  ((uint32_t)0x10000000)

/* I3C_WaitTime */
#define I3C_WaitTime_State_0                 ((uint32_t)0x00000000)
#define I3C_WaitTime_State_1                 ((uint32_t)0x00000100)
#define I3C_WaitTime_State_2                 ((uint32_t)0x00000200)
#define I3C_WaitTime_State_3                 ((uint32_t)0x00000300)

/* I3C_IBIPayloadSize */
#define I3C_IBIPayloadSize_None              ((uint32_t)0x00000000)
#define I3C_IBIPayloadSize_1B                ((uint32_t)0x00010000)
#define I3C_IBIPayloadSize_2B                ((uint32_t)0x00020000)
#define I3C_IBIPayloadSize_3B                ((uint32_t)0x00030000)
#define I3C_IBIPayloadSize_4B                ((uint32_t)0x00040000)

/* I3C_DataTurnAroundDuration */
#define I3C_DataTurnAroundDuration_Mode0     ((uint32_t)0x00000000)
#define I3C_DataTurnAroundDuration_Mode1     ((uint32_t)0x01000000)

/* I3C_MaxDataSpeed */
#define I3C_MaxDataSpeed_Format_Mode0        ((uint32_t)0x00000000)
#define I3C_MaxDataSpeed_Format_Mode1        ((uint32_t)0x00000100)
#define I3C_MaxDataSpeed_Format_Mode2        ((uint32_t)0x00000200)
#define I3C_MaxDataSpeed_Format_Mode3        ((uint32_t)0x00000300)

/* I3C_HandOffActivityState */
#define I3C_HandOffActivityState_0           ((uint32_t)0x00000000)
#define I3C_HandOffActivityState_1           ((uint32_t)0x00000001)
#define I3C_HandOffActivityState_2           ((uint32_t)0x00000002)
#define I3C_HandOffActivityState_3           ((uint32_t)0x00000003)

/* I3C_DeviceIndex */
#define I3C_DeviceIndex_1                    ((uint32_t)0x00000001)
#define I3C_DeviceIndex_2                    ((uint32_t)0x00000002)
#define I3C_DeviceIndex_3                    ((uint32_t)0x00000003)
#define I3C_DeviceIndex_4                    ((uint32_t)0x00000004)

/* I3C_Direction */
#define I3C_Direction_WR                     ((uint32_t)0x00000000)
#define I3C_Direction_RD                     ((uint32_t)0x00010000)

/* I3C_CONTROLLER MessageType */
#define I3C_CONTROLLER_MTYPE_RELEASE         ((uint32_t)0x00000000)
#define I3C_CONTROLLER_MTYPE_HEADER          I3C_CTLR_MTYPE_0
#define I3C_CONTROLLER_MTYPE_PRIVATE         I3C_CTLR_MTYPE_1
#define I3C_CONTROLLER_MTYPE_DIRECT          (I3C_CTLR_MTYPE_1 | I3C_CTLR_MTYPE_0)
#define I3C_CONTROLLER_MTYPE_LEGACY_I2C      I3C_CTLR_MTYPE_2
#define I3C_CONTROLLER_MTYPE_CCC             (I3C_CTLR_MTYPE_2 | I3C_CTLR_MTYPE_1)

/* I3C_EndMode */
#define I3C_GENERATE_STOP                    I3C_CTLR_MEND
#define I3C_GENERATE_RESTART                 ((uint32_t)0x00000000)

/* I3C_TARGET_MessageType */
#define I3C_TARGET_MTYPE_HOT_JOIN            I3C_CTLR_MTYPE_3
#define I3C_TARGET_MTYPE_CONTROLLER_ROLE_REQ (I3C_CTLR_MTYPE_3 | I3C_CTLR_MTYPE_0)
#define I3C_TARGET_MTYPE_IBI                 (I3C_CTLR_MTYPE_3 | I3C_CTLR_MTYPE_1)

/* I3C_PeripheralMode */
#define PeripheralMode_CONTROLLER            ((uint32_t)0x00000000)
#define PeripheralMode_TARGET                ((uint32_t)0x00000002)

/* I3C_RX_FIFO_THRESHOLD */
#define I3C_RXFIFO_THRESHOLD_1_4             ((uint32_t)0x00000000)
#define I3C_RXFIFO_THRESHOLD_4_4             I3C_CFGR_RXTHRES

/* I3C_TX_FIFO_THRESHOLD */
#define I3C_TXFIFO_THRESHOLD_1_4             ((uint32_t)0x00000000)
#define I3C_TXFIFO_THRESHOLD_4_4             I3C_CFGR_TXTHRES

