SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
/* PIOC Registers */
typedef struct
{
	uint32_t          RESERVED00;
	union {
		__IO uint32_t   D32_PIOC_SFR ; // RO/RW, PIOC SFR
		struct {
		__IO uint8_t  D8_INDIR_ADDR; // RO/RW, PIOC indirect address
		__IO uint8_t  D8_TMR0_COUNT; // RO/RW, PIOC timer count
		__IO uint8_t  D8_TMR0_CTRL; // RO/RW, PIOC timer control and GP bit
		__IO uint8_t  D8_TMR0_INIT; // RO/RW, PIOC timer initial value
		} ;
	} ;
	union {
		__IO uint32_t   D32_PORT_CFG ; // RO/RW, port status and config
		struct {
		__IO uint8_t  D8_BIT_CYCLE; // RO/RW, encode bit cycle
		__IO uint8_t  D8_INDIR_ADDR2; // RO/RW, PIOC indirect address 2
		__IO uint8_t  D8_PORT_DIR; // RO/RW, IO port direction and mode
		__IO uint8_t  D8_PORT_IO; // RO/RW, IO port input and output
		} ;
	} ;
	uint32_t          RESERVED0C;
	uint32_t          RESERVED10;
	uint32_t          RESERVED14;
	uint32_t          RESERVED18;
	union {
		__IO uint32_t   D32_DATA_CTRL ; // RW/RW, data control
		struct {
		__IO uint8_t  D8_SYS_CFG; // RW/RW, port config
		__IO uint8_t  D8_CTRL_RD; // RO/RW, data for master read only and PIOC write only
		__IO uint8_t  D8_CTRL_WR; // RW/RO, data for master write only and PIOC read only
		__IO uint8_t  D8_DATA_EXCH; // RW/RW, data exchange
		} ;
	} ;
	union {
		__IO uint32_t   D32_DATA_REG0_3 ; // RW/RW, data buffer 0~3
		struct {
		__IO uint8_t  D8_DATA_REG0; // RW/RW, data buffer 0
		__IO uint8_t  D8_DATA_REG1; // RW/RW, data buffer 1
		__IO uint8_t  D8_DATA_REG2; // RW/RW, data buffer 2
		__IO uint8_t  D8_DATA_REG3; // RW/RW, data buffer 3
		} ;
		__IO uint16_t   D16_DATA_REG0_1 ; // RW/RW, data buffer 0~1
	} ;
	union {
		__IO uint32_t   D32_DATA_REG4_7 ; // RW/RW, data buffer 4~7
		struct {
		__IO uint8_t  D8_DATA_REG4; // RW/RW, data buffer 4
		__IO uint8_t  D8_DATA_REG5; // RW/RW, data buffer 5
		__IO uint8_t  D8_DATA_REG6; // RW/RW, data buffer 6
		__IO uint8_t  D8_DATA_REG7; // RW/RW, data buffer 7
		} ;
	} ;
	union {
		__IO uint32_t   D32_DATA_REG8_11 ; // RW/RW, data buffer 8~11
		struct {
		__IO uint8_t  D8_DATA_REG8; // RW/RW, data buffer 8
		__IO uint8_t  D8_DATA_REG9; // RW/RW, data buffer 9
		__IO uint8_t  D8_DATA_REG10; // RW/RW, data buffer 10
		__IO uint8_t  D8_DATA_REG11; // RW/RW, data buffer 11
		} ;
	} ;
	union {
		__IO uint32_t   D32_DATA_REG12_15 ; // RW/RW, data buffer 12~15
		struct {
		__IO uint8_t  D8_DATA_REG12; // RW/RW, data buffer 12
		__IO uint8_t  D8_DATA_REG13; // RW/RW, data buffer 13
		__IO uint8_t  D8_DATA_REG14; // RW/RW, data buffer 14
		__IO uint8_t  D8_DATA_REG15; // RW/RW, data buffer 15
		} ;
	} ;
	union {
		__IO uint32_t   D32_DATA_REG16_19 ; // RW/RW, data buffer 16~19
		struct {
		__IO uint8_t  D8_DATA_REG16; // RW/RW, data buffer 16
		__IO uint8_t  D8_DATA_REG17; // RW/RW, data buffer 17
		__IO uint8_t  D8_DATA_REG18; // RW/RW, data buffer 18
		__IO uint8_t  D8_DATA_REG19; // RW/RW, data buffer 19
		} ;
	} ;
	union {
		__IO uint32_t   D32_DATA_REG20_23 ; // RW/RW, data buffer 20~23
		struct {
		__IO uint8_t  D8_DATA_REG20; // RW/RW, data buffer 20
		__IO uint8_t  D8_DATA_REG21; // RW/RW, data buffer 21
		__IO uint8_t  D8_DATA_REG22; // RW/RW, data buffer 22
		__IO uint8_t  D8_DATA_REG23; // RW/RW, data buffer 23
		} ;
	} ;
	union {
		__IO uint32_t   D32_DATA_REG24_27 ; // RW/RW, data buffer 24~27
		struct {
		__IO uint8_t  D8_DATA_REG24; // RW/RW, data buffer 24
		__IO uint8_t  D8_DATA_REG25; // RW/RW, data buffer 25
		__IO uint8_t  D8_DATA_REG26; // RW/RW, data buffer 26
		__IO uint8_t  D8_DATA_REG27; // RW/RW, data buffer 27
		} ;
	} ;
	union {
		__IO uint32_t   D32_DATA_REG28_31 ; // RW/RW, data buffer 28~31
		struct {
		__IO uint8_t  D8_DATA_REG28; // RW/RW, data buffer 28
		__IO uint8_t  D8_DATA_REG29; // RW/RW, data buffer 29
		__IO uint8_t  D8_DATA_REG30; // RW/RW, data buffer 30
		__IO uint8_t  D8_DATA_REG31; // RW/RW, data buffer 31
		} ;
	} ;
} PIOC_TypeDef;

#define PIOC          ((PIOC_TypeDef *)PIOC_BASE)

/* ch32h417_qspi.h -----------------------------------------------------------*/

/* QSPI_Clock_Mode */
#define QSPI_CKMode_Mode0                     ((uint32_t)0x00000000)
#define QSPI_CKMode_Mode3                     ((uint32_t)QSPI_DCR_CKMODE)

/* QSPI_ChipSelectHighTime */
#define QSPI_CSHTime_1Cycle                   ((uint32_t)0x00000000)
#define QSPI_CSHTime_2Cycle                   ((uint32_t)QSPI_DCR_CSHT_0)
#define QSPI_CSHTime_3Cycle                   ((uint32_t)QSPI_DCR_CSHT_1)
#define QSPI_CSHTime_4Cycle                   ((uint32_t)QSPI_DCR_CSHT_0 | QSPI_DCR_CSHT_1)
#define QSPI_CSHTime_5Cycle                   ((uint32_t)QSPI_DCR_CSHT_2)
#define QSPI_CSHTime_6Cycle                   ((uint32_t)QSPI_DCR_CSHT_2 | QSPI_DCR_CSHT_0)
#define QSPI_CSHTime_7Cycle                   ((uint32_t)QSPI_DCR_CSHT_2 | QSPI_DCR_CSHT_1)
#define QSPI_CSHTime_8Cycle                   ((uint32_t)QSPI_DCR_CSHT)

/* QSPI_Fash_Select */
#define QSPI_FSelect_1                        ((uint32_t)0x00000000)
#define QSPI_FSelect_2                        ((uint32_t)QSPI_CR_FSEL)

/* QSPI_Dual_Flash */
#define QSPI_DFlash_Disable                   ((uint32_t)0x00000000)
#define QSPI_DFlash_Enable                    ((uint32_t)QSPI_CR_DFM)

/* QSPI_ComConfig_Functional_Mode */
#define QSPI_ComConfig_FMode_Indirect_Write   ((uint32_t)0x00000000)
#define QSPI_ComConfig_FMode_Indirect_Read    ((uint32_t)QSPI_CCR_FMODE_0)
#define QSPI_ComConfig_FMode_Auto_Polling     ((uint32_t)QSPI_CCR_FMODE_1)
#define QSPI_ComConfig_FMode_Memory_Mapped    ((uint32_t)QSPI_CCR_FMODE)


/* QSPI_ComConfig_SendInstructionOnlyOnceMode */
#define QSPI_ComConfig_SIOOMode_Disable       ((uint32_t)0x00000000)
#define QSPI_ComConfig_SIOOMode_Enable        ((uint32_t)QSPI_CCR_SIOO)

/* QSPI_ComConfig_DataMode */
#define QSPI_ComConfig_DMode_NoData           ((uint32_t)0x00000000)
#define QSPI_ComConfig_DMode_1Line            ((uint32_t)QSPI_CCR_DMODE_0)
#define QSPI_ComConfig_DMode_2Line            ((uint32_t)QSPI_CCR_DMODE_1)
#define QSPI_ComConfig_DMode_4Line            ((uint32_t)QSPI_CCR_DMODE)

/* QSPI_ComConfig_AlternateBytesSize */
#define QSPI_ComConfig_ABSize_8bit            ((uint32_t)0x00000000)
#define QSPI_ComConfig_ABSize_16bit           ((uint32_t)QSPI_CCR_ABSIZE_0)
#define QSPI_ComConfig_ABSize_24bit           ((uint32_t)QSPI_CCR_ABSIZE_1)
#define QSPI_ComConfig_ABSize_32bit           ((uint32_t)QSPI_CCR_ABSIZE)

/* QSPI_ComConfig_AlternateBytesMode */
#define QSPI_ComConfig_ABMode_NoAlternateByte ((uint32_t)0x00000000)
#define QSPI_ComConfig_ABMode_1Line           ((uint32_t)QSPI_CCR_ABMODE_0)
#define QSPI_ComConfig_ABMode_2Line           ((uint32_t)QSPI_CCR_ABMODE_1)
#define QSPI_ComConfig_ABMode_4Line           ((uint32_t)QSPI_CCR_ABMODE)

/* QSPI_ComConfig_AddressSize */
#define QSPI_ComConfig_ADSize_8bit            ((uint32_t)0x00000000)
#define QSPI_ComConfig_ADSize_16bit           ((uint32_t)QSPI_CCR_ADSIZE_0)
#define QSPI_ComConfig_ADSize_24bit           ((uint32_t)QSPI_CCR_ADSIZE_1)
#define QSPI_ComConfig_ADSize_32bit           ((uint32_t)QSPI_CCR_ADSIZE)

