SoftwareArchitekt/hal_wch/ch32fun/ch32v41xhw.h
/* QSPI_ComConfig_AddressMode */
#define QSPI_ComConfig_ADMode_NoAddress       ((uint32_t)0x00000000)
#define QSPI_ComConfig_ADMode_1Line           ((uint32_t)QSPI_CCR_ADMODE_0)
#define QSPI_ComConfig_ADMode_2Line           ((uint32_t)QSPI_CCR_ADMODE_1)
#define QSPI_ComConfig_ADMode_4Line           ((uint32_t)QSPI_CCR_ADMODE)

/* QSPI_ComConfig_InstructionMode */
#define QSPI_ComConfig_IMode_NoInstruction    ((uint32_t)0x00000000)
#define QSPI_ComConfig_IMode_1Line            ((uint32_t)QSPI_CCR_IMODE_0)
#define QSPI_ComConfig_IMode_2Line            ((uint32_t)QSPI_CCR_IMODE_1)
#define QSPI_ComConfig_IMode_4Line            ((uint32_t)QSPI_CCR_IMODE)


/* QSPI_Interrupts_definition */
#define QSPI_IT_TO                            (uint32_t)(QSPI_CR_TOIE | QSPI_SR_TOF)
#define QSPI_IT_SM                            (uint32_t)(QSPI_CR_SMIE | QSPI_SR_SMF)
#define QSPI_IT_FT                            (uint32_t)(QSPI_CR_FTIE | QSPI_SR_FTF)
#define QSPI_IT_TC                            (uint32_t)(QSPI_CR_TCIE | QSPI_SR_TCF)
#define QSPI_IT_TE                            (uint32_t)(QSPI_CR_TEIE | QSPI_SR_TEF)

/* QSPI_Flags_definition */
#define QSPI_FLAG_TO                          QSPI_SR_TOF
#define QSPI_FLAG_SM                          QSPI_SR_SMF
#define QSPI_FLAG_FT                          QSPI_SR_FTF
#define QSPI_FLAG_TC                          QSPI_SR_TCF
#define QSPI_FLAG_TE                          QSPI_SR_TEF
#define QSPI_FLAG_BUSY                        QSPI_SR_BUSY
#define QSPI_FLAG_IDLE                        QSPI_SR_IDLEF

/* QSPI_Polling_Match_Mode */
#define QSPI_PMM_AND                          ((uint32_t)0x00000000)
#define QSPI_PMM_OR                           ((uint32_t)QSPI_CR_PMM)

/* QSPI_SIOXEN  */
#define QSPI_SIOXEN                           ((uint32_t)0x00002000)

/* ch32h417_sai.h -----------------------------------------------------------*/

/* SAI_Block_Mode */
#define SAI_Mode_MasterTx               ((uint32_t)0x00000000)
#define SAI_Mode_MasterRx               ((uint32_t)0x00000001)
#define SAI_Mode_SlaveTx                ((uint32_t)0x00000002)
#define SAI_Mode_SlaveRx                ((uint32_t)0x00000003)

/* SAI_Block_Protocol */
#define SAI_Free_Protocol               ((uint32_t)0x00000000)
#define SAI_SPDIF_Protocol              ((uint32_t)SAI_CFGR1_PRTCFG_0)
#define SAI_AC97_Protocol               ((uint32_t)SAI_CFGR1_PRTCFG_1)

/* SAI_Block_Data_Size */
#define SAI_DataSize_8b                 ((uint32_t)0x00000040)
#define SAI_DataSize_10b                ((uint32_t)0x00000060)
#define SAI_DataSize_16b                ((uint32_t)0x00000080)
#define SAI_DataSize_20b                ((uint32_t)0x000000A0)
#define SAI_DataSize_24b                ((uint32_t)0x000000C0)
#define SAI_DataSize_32b                ((uint32_t)0x000000E0)

/* SAI_Block_MSB_LSB_transmission */
#define SAI_FirstBit_MSB                ((uint32_t)0x00000000)
#define SAI_FirstBit_LSB                ((uint32_t)SAI_CFGR1_LSBFIRST)

/* SAI_Block_Clock_Strobing */
#define SAI_ClockStrobing_FallingEdge   ((uint32_t)0x00000000)
#define SAI_ClockStrobing_RisingEdge    ((uint32_t)SAI_CFGR1_CKSTR)

/* SAI_Block_Synchronization */
#define SAI_Asynchronous                ((uint32_t)0x00000000)
#define SAI_Synchronous                 ((uint32_t)SAI_CFGR1_SYNCEN_0)

/* SAI_Block_NoDivider */
#define SAI_MasterDivider_Enabled       ((uint32_t)0x00000000)
#define SAI_MasterDivider_Disabled      ((uint32_t)SAI_CFGR1_NODIV)

/* SAI_Block_FS_Definition */
#define SAI_FS_StartFrame               ((uint32_t)0x00000000)
#define I2S_FS_ChannelIdentification    ((uint32_t)SAI_FRCR_FSDEF)

/* SAI_Block_FS_Polarity */
#define SAI_FS_ActiveLow                ((uint32_t)0x00000000)
#define SAI_FS_ActiveHigh               ((uint32_t)SAI_FRCR_FSPOL)

/* SAI_Block_FS_Offset */
#define SAI_FS_FirstBit                 ((uint32_t)0x00000000)
#define SAI_FS_BeforeFirstBit           ((uint32_t)SAI_FRCR_FSOFF)

/* SAI_Block_Slot_Size */
#define SAI_SlotSize_DataSize           ((uint32_t)0x00000000)
#define SAI_SlotSize_16b                ((uint32_t)0x00000040)
#define SAI_SlotSize_32b                ((uint32_t)0x00000080)

/* SAI_Block_Slot_Active */
#define SAI_Slot_NotActive              ((uint32_t)0x00000000)
#define SAI_SlotActive_0                ((uint32_t)0x00010000)
#define SAI_SlotActive_1                ((uint32_t)0x00020000)
#define SAI_SlotActive_2                ((uint32_t)0x00040000)
#define SAI_SlotActive_3                ((uint32_t)0x00080000)
#define SAI_SlotActive_4                ((uint32_t)0x00100000)
#define SAI_SlotActive_5                ((uint32_t)0x00200000)
#define SAI_SlotActive_6                ((uint32_t)0x00400000)
#define SAI_SlotActive_7                ((uint32_t)0x00800000)
#define SAI_SlotActive_8                ((uint32_t)0x01000000)
#define SAI_SlotActive_9                ((uint32_t)0x02000000)
#define SAI_SlotActive_10               ((uint32_t)0x04000000)
#define SAI_SlotActive_11               ((uint32_t)0x08000000)
#define SAI_SlotActive_12               ((uint32_t)0x10000000)
#define SAI_SlotActive_13               ((uint32_t)0x20000000)
#define SAI_SlotActive_14               ((uint32_t)0x40000000)
#define SAI_SlotActive_15               ((uint32_t)0x80000000)
#define SAI_SlotActive_ALL              ((uint32_t)0xFFFF0000)

/* SAI_Mono_Streo_Mode */
#define SAI_MonoMode                    ((uint32_t)SAI_CFGR1_MONO)
#define SAI_StreoMode                   ((uint32_t)0x00000000)

/* SAI_TRIState_Management */
#define SAI_Output_NotReleased          ((uint32_t)0x00000000)
#define SAI_Output_Released             ((uint32_t)SAI_CFGR2_TRIS)

/* SAI_Block_Fifo_Threshold */
#define SAI_Threshold_FIFOEmpty         ((uint32_t)0x00000000)
#define SAI_FIFOThreshold_1QuarterFull  ((uint32_t)0x00000001)
#define SAI_FIFOThreshold_HalfFull      ((uint32_t)0x00000002)
#define SAI_FIFOThreshold_3QuartersFull ((uint32_t)0x00000003)
#define SAI_FIFOThreshold_Full          ((uint32_t)0x00000004)

/* SAI_Block_Companding_Mode */
#define SAI_NoCompanding                ((uint32_t)0x00000000)
#define SAI_ULaw_1CPL_Companding        ((uint32_t)0x00008000)
#define SAI_ALaw_1CPL_Companding        ((uint32_t)0x0000C000)
#define SAI_ULaw_2CPL_Companding        ((uint32_t)0x0000A000)
#define SAI_ALaw_2CPL_Companding        ((uint32_t)0x0000E000)

/* SAI_Block_Mute_Value */
#define SAI_ZeroValue                   ((uint32_t)0x00000000)
#define SAI_LastSentValue               ((uint32_t)SAI_CFGR2_MUTEVAL)

/* SAI_Block_Interrupts_Definition */
#define SAI_IT_OVRUDR                   ((uint32_t)SAI_INTENR_OVRUDRIE)
#define SAI_IT_MUTEDET                  ((uint32_t)SAI_INTENR_MUTEDETIE)
#define SAI_IT_WCKCFG                   ((uint32_t)SAI_INTENR_WCKCFGIE)
#define SAI_IT_FREQ                     ((uint32_t)SAI_INTENR_FREQIE)
#define SAI_IT_CNRDY                    ((uint32_t)SAI_INTENR_CNRDYIE)
#define SAI_IT_AFSDET                   ((uint32_t)SAI_INTENR_AFSDETIE)
#define SAI_IT_LFSDET                   ((uint32_t)SAI_INTENR_LFSDETIE)

